{
    "肺胃風寒證": "噁心, 小便不利, 脈弦緩, 氣喘, 身痛如束, 頭額目痛, 繼發大小不等之風疹, 惡寒, 關節酸痛, 惡風, 腰脊強, 咳嗽, 眩, 嘔吐酸苦,項背強痛, 脈浮而長, 氣逆作嘔, 脈浮緊, 發熱, 胸痞, 苔薄白, 周身劇烈瘙癢, 不食, 脈浮有力, 胸滿, 無汗, 浮洪微滑, 鼻幹不得臥, 苔淡灰薄膩",
    "肺脾風寒證": "脈沉, 小便不利, 怕冷, 苔白膩, 鼻塞流涕, 脈沉遲, 四肢煩疼, 畏寒怕冷, 腹痛, 脘痞, 汗出不透, 四肢熱甚, 胸悶重, 腹鳴。利白色黏液",
    "肝肺風寒證": "脈左浮緊, 右關沉滑, 或前半無苔, 氣從上逆, 滿而不痛, 胸脘滿痛, 甚則沉弦而澀, 舌苔白滑, 頭痛, 惡寒無汗, 沉澀, 白滑而厚, 咽部不適, 鼻塞, 身熱, 中後白膩而厚, 右弦急, 或浮或沉, 右沉弦, 胸悶太息, 弦急而滑, 胸脅痞滿, 噁心吐酸, 胸脅串痛",
    "肺腎風寒證": "唇乾, 兩顴赤色, 四肢抽掣, 不能嚏, 咳嗽氣逆, 舌淡紅潤淡白, 咽痛淡紅不腫, 脈細, 不能平臥, 少苔或無苔, 四肢厥而不逆, 尿少而赤, 舌苔乾白而膩, 流清涕, 腰酸, 戰寒體痛, 舌燥口渴, 氣急, 目珠上瞪, 惡寒發熱無汗, 咳嗽, 右沉遲, 膝軟, 目珠上瞪, 惡寒發熱無汗, 咳嗽, 右沉遲, 膝軟, 面赤神揚, 舌紫而於, 欲嚏不能, 脈浮緊而弦, 身體螻臥, 失音, 腰膝酸軟, 神情頹唐, 身熱不揚, 口燥咽乾, 頭痛鼻塞, 脈沉, 脈浮緊,苔白滑, 左浮緊, 惡寒鼓傈, 左半邊有汗, 脈沉細遲無力, 脈緊左大, 舌形雖濕而乾, 無苔, 微有惡寒, 腰痛, 口淡喜熱飲, 咽痛異常",
    "膽胃風寒證": "脅下鞭滿, 或單邊白, 耳聾目眩, 左弦而浮大, 頸項強, 舌苔白滑, 頭痛, 欲嘔, 寒熱往來, 身熱惡風, 或舌尖苔白, 胸脅滿疼, 脈沉緊, 微惡寒, 脅下滿, 脈右弦滑, 頭角痛, 手足溫而渴, 乾嘔不能食, 或兩邊白",
    "肝胃風寒證": "耳鳴耳聾, 舌質淡紅, 偏正頭痛, 噁心嘔吐, 惡寒發熱, 苔薄白而中間微黃, 頭暈目眩, 脈浮滑者, 目眩眩暈鼻塞, 苔薄白, 胸脅苦滿, 咽中似有痰阻, 咯之不暢, 或巔頂作痛",
    "肺衛風熱證": "苔薄, 苔黃, 兩寸獨大, 咳嗽痰多, 舌紅, 氣喘, 尺膚熱甚, 身酸困, 頭痛, 咽部不適, 頭昏, 鼻塞, 脈浮弦, 脈不緩不緊而動數, 午後熱甚, 胸痞, 微惡風寒, 欬逆, 無汗, 口渴, 脘悶不飢, 身熱自汗, 咽癢",
    "肺胃風熱證": "身體疼痛, 疹出稠密, 痰黃稠, 白黏痰, 苔中微黃, 尿黃灼熱, 苔白膩, 鼻塞流涕, 四肢時涼時熱, 咽部不適, 惡寒, 脈浮滑數, 項背牽強, 朝輕暮重, 胸滿胸痛, 咳嗽, 咳甚則嘔, 口渴喜冷飲, 舌苔垢濁, 脈浮數有力, 痰多, 微汗, 唇紅口乾, 便秘尿赤, 頭痛, 聲音沙啞, 舌邊紅, 惡風發熱, 口乾欲飲, 息粗有聲, 咯痰不暢, 鼻衄, 無汗",
    "膽胃風熱證": "苔黃, 微汗, 背寒, 口苦, 頭痛, 惡寒, 嘔吐, 頭項強痛, 脈浮弦, 目眩, 苔膩, 左弦洪長, 往來寒熱, 頭項強痛, 苔白, 脈浮數, 胸中痞悶, 不能轉側, 惡熱, 發熱無汗, 寒熱交作, 渴不欲, 休作有時",
    "肝肺風熱證": "乳蛾腫大, 舌質淡紅, 舌苔黃少津, 身痛, 腮腫, 舌紅, 脈細數, 面赤, 發熱惡寒, 瘙癢, 按之微熱, 不惡寒, 上身為甚, 鼻流清涕, 咽喉疼痛, 咳嗽, 口渴引飲, 少腹引痛, 舌尖紅苔薄, 背發風疹, 苔薄膩, 左耳疼痛, 其上罩有黃色黏狀物, 小便短赤, 紅色風疹, 脈浮數, 鼻衄, 脈滑數, 無汗",
    "心肝風熱證": "咳嗽, 身體疼痛, 紅中兼白色, 苔黃, 舌紅, 夜熱自汗, 體發赤疹, 鼻塞清涕, 譫語, 頭痛, 微寒, 腫癢難忍, 斑疹紅赤不透, 惡風, 發熱, 鼻衄, 無汗, 驚跳不安",
    "肝膽風陽證": "眠差, 舌紅少津苔黃, 口眼歪斜, 舌質綹, 頭脹, 頭暈目眩, 昏暈欲僕, 巔頂痛徹目, 面色潮紅, 偏頭痛, 易怒, 邊薄黃, 小便黃, 手麻, 溲黃, 心悸, 脈弦滑而數, 畏熱自汗, 頭暈脹痛, 耳鳴耳聾, 午後潮熱, 胸腹悶, 脈弦數, 面部烘熱, 兩腿抽撣攣痛,小便黃赤, 口苦, 頭暈, 心中煩熱, 夜躁, 口燥咽乾, 肢體浮腫, 脈弦, 煩躁不靜, 發熱, 目赤, 頭重腳輕, 口渴, 目脹痛失明, 便結",
    "心肝風陽證": "耳鳴, 心跳氣短, 急躁易怒, 面色發紅, 頭暈目眩, 舌淡帶青, 口渴喜飲, 面色潮紅, 自訴烘熱難忍, 手足強直, 脈細, 獨頭搖晃, 惡夢驚恐, 腰酸, 恍惚多疑, 目緊閉, 舌尖紅苔薄膩, 煩躁不寧, 煩悶悲哭, 筋脈拘攣, 耳鳴如潮, 頭痛頭脹, 氣粗似喘, 舌體顫抖, 言語模糊, 脈弦勁, 納呆噯氣, 脈細數虛經, 舌邊紅, 脈弦, 頭劇痛時泛惡, 夜寐不安, 苔薄白, 目慌無所見, 舌紅苔黃燥, 噁心嘔吐不止, 口不能言, 心悸少眠, 昏厥發作時有氣上沖, 頸項強硬",
    "肝腎風陽證": "肢體顫動, 肌肉消瘦, 脈細數, 脈細弦滑, 震顫無力, 兩手潤動不已, 面赤轟熱, 角膜邊緣有綠褐色環, 頸項強痛, 不能自主, 閉目畏光, 驚則益重, 頭皮發麻, 頭重, 手小指發麻, 巔頂疼痛, 心悸, 心煩悶亂, 耳鳴耳聾, 鬱怒, 口乾, 張目便眩暈欲倒, 肢體軟弱, 口燥, 脈沉左關獨弦, 頭暈, 頭頂部有跳動感, 腰酸腿麻, 頭昏脹痛, 盜汗, 汗多, 胸中煩熱, 胸悶, 苔薄黃, 便秘, 行走強直欲傾倒, 舌正無苔, 言語謇澀, 口乾咽燥, 午後頭面及周身感發熱, 舌乾瘦無苔, 痙攣, 肢體僵直, 舌紅少苔, 舌紅綹, 視物昏花, 口酸",
    "心腎風陽證": "耳鳴, 舌體顫抖, 手臂局部發麻, 發麻痺, 涼透胸口, 片刻自醒, 脈細弦微澀, 頭昏, 發涼, 性情急躁, 小便黃, 頭部震顫時有轟熱汗出, 溲黃, 耳鳴如潮, 口乾唇燥, 腰酸痛, 帶下多而腥臭, 心悸心煩, 小便黃赤, 頭暈, 大便狀如羊屎, 語無倫次, 陣發性出汗, 沉取無力, 苔白微膩, 記憶力差, 無苔, 昏厥, 臂熱, 面部潮熱, 脈弦細數, 夜難入眠, 手心常灼",
    "肝腎虛風證": "口齒欠利, 大便秘結不通, 午後顴紅, 精神軟弱, 頸部肌肉掣動, 動作則甚, 腰酸腳軟, 小便短黃, 脈弦細緩, 脈虛弦數, 健忘, 肢體震顫, 手足心熱, 頻點點頭, 點頭風, 眼光發花, 驚悸, 睡眠易驚, 大便乾結, 頭暈, 臉部肌肉抽搐, 舌強語塞, 頭暈腦脹, 月經量少色淡而錯後, 潮熱, 大便秘結, 苔薄白, 面色皖白, 心煩意亂, 眠差, 耳鳴, 聽力減退, 步履不遂, 左側上下肢不停地擺動, 目眩畏光, 肢倦, 舌淡無苔, 舌體顫動,暈厥僕地, 記憶減退, 項背牽強, 少眠失眠, 心悸, 耳鳴如潮, 兩目複視, 心悸氣短, 脈細弱無力尺尤甚, 脈虛弦緩, 小頻數餘瀝不盡, 便秘, 口乾咽燥",
    "肝脾虛風證": "情緒激動可使症狀加重, 頭頂劇痛, 白天磨牙, 右肢日夜亂動, 精神呆痴, 不語, 咽乾口苦, 目幹, 舌潤, 眼突, 怠倦, 複視, 惡風,面時潮紅, 舌紅潤無苔, 不能自行控制, 苔薄質淡, 寐少夢多, 面唇淡, 精神怠倦, 脈弦數, 脈濡緩, 吞嚥困難, 夜寐易驚, 頭痛, 搖頭不止, 心煩不寧, 苔薄黃, 左肢麻痺如廢, 脈弦細數",
    "脾腎虛風證": "睡眠差, 身體瘦弱, 反酸, 腹脹欲嘔, 兩耳鳴, 脈略數, 頭暈目眩, 腰痛如斷, 大便急迫溏薄, 額痛, 脈細, 下肢厥冷, 神誌清楚, 飲食少思, 數小時後如常, 脈沉細而濡, 汗出惡風, 突然僕倒兩次, 夜寐多夢, 時泛清水如湧泉, 頭痛, 耳鳴目眩, 欲嘔, 小溲時有遲緩, 脈弦,閉目則稍緩, 脈浮弦, 視物如旋, 腰酸乏力, 苔薄白, 四肢酸楚, 脈弦細數, 頭痛如劈",
    "脾胃陰寒證": "舌淡, 神倦氣怯, 肢厥, 嘔吐, 身重, 口淡胃鈍, 神倦好寐, 腹滿, 沉微似伏, 脈沉濡無力, 小便短少而白, 四肢逆冷, 苔白厚, 舌白滑灰刺, 腹時痛, 面青黑色, 汗多, 自利, 脈沉, 嘔吐清水, 胸痞, 不食, 便溏, 食不下, 苔黑滑黏膩浮胖",
    "肺脾陰寒證": "指端青紫, 胸背劇痛, 熱汗驟至, 色白神疲, 烘以烈火傾刻不離, 寒戰鼓, 惡寒甚劇, 戰課動搖, 舌苔邊白中里滑, 面青足冷, 面色青足冷, 面色青黃, 大便洩瀉, 四肢厥冷, 大便不實, 咳, 肩背惡寒, 脈沉細無力, 嘔, 小便清, 脈浮緩, 白舌苔白嫩",
    "脾腎陰寒證": "煩渴, 身雖熱而反近衣, 額上冷汗不止, 頭體微痛, 或爪甲青紫, 身戰掉欲倒地, 按之不鼓擊, 口乾舌燥, 右關尺虛微,驚悸, 面青, 口雖渴喜熱飲, 按之無力, 發熱汗出多, 脈沉, 脈弦遲, 身大熱, 身體疼痛, 兩目出火, 發熱, 脈緊左大, 目赤, 便溏, 脈豁大, 不能轉側, 口渴, 身涼手足厥, 中痛, 脈反沉, 語言狂亂, 脈細, 苦嘔下洩, 神不舒, 脈七八至, 遍身吟疼不已,嘔逆, 脈象忽然雙伏或單伏, 舌白, 寐中糊言, 狂臀不避親疏, 惡寒發熱, 頭重目眩, 神情頹唐, 自利, 四肢厥冷, 肩背胸脅斑出十數點, 手按鬚史冷透如冰, 垂頭不欲語, 手足欲用水浸, 胸滿, 左脈弦澀, 尺寸脈俱浮數",
    "肝腎陰寒證": "嘔吐黃涎, 食行則吐, 善太息, 身寒熱, 胸脅痛, 細微, 冷汗遍體, 疝瘕痛, 頭痛, 小便清頻, 目痛不甚, 流冷淚, 舌本燥, 形寒怕冷, 舌淡苔白, 大便自利, 脈沉弦, 兩臂不舉, 自汗惡寒, 面色能白, 兩尺沉細, 頭頂脹悶疼痛",
    "肝脾陰寒證": "蜷縮, 四肢厥逆, 發熱不退, 張目不眠, 唇紅而焦, 唇縮, 目紅面赤, 按之索然, 不得臥, 亂言無倫, 面赤, 腹痛, 身有微熱,舌黑, 發狂有力, 面少赤, 口唇淡, 不耐煩, 下指洪大, 時吐食人反出, 乾嘔不止, 手足逆冷, 熱熾躁擾, 六脈浮, 遇寒則甚, 無暫安時, 口舌千而澀, 脈沉緊, 腹脹, 腹滿而脹, 少腹痛, 浮數無力, 口渴, 大熱譫語, 脈數大而空",
    "肝胃陰寒證": "脘痞喜按, 得食則痛緩, 四肢厥逆, 頭中冷痛畏風, 舌冷如冰, 失眠, 憂鬱青晦, 舌淡, 頭暈目眩, 入夜不知睡眠, 面白, 痛在頭頂, 徹夜不眠, 頭痛如破, 脈細沉弦, 噁心作嘔, 脈雙弦, 耳如蟬鳴, 面色慘淡, 口味覺酸, 胃脘陣陣作痛, 脘痛吐酸, 兩目昏花, 煩躁不寧, 偏陣陣作痛, 脘痛吐酸, 兩目昏花, 煩躁不寧, 偏左頭痛如劈, 嘔吐食物, 但喜手按, 頻吐涎水, 脘脅脹痛, 身搖搖欲墜, 人口即吐, 頭暈, 食藥不進, 脈小左弦, 幹嘔吐涎沫, 苔白滑, 沉緊, 脈左關弦細, 頭目暈眩, 苔白, 右關沉遲無力, 不眠, 時或腹痛拘急, 便溏, 沉遲, 周圍轉動, 脘腹作痛",
    "肺衛寒熱證": "咳嗽, 苔黃, 咽癢微紅, 咳嗆, 口乾, 鼻塞聲重流清涕, 口燥, 口苦, 氣喘, 身熱汗出, 頭痛, 惡寒, 尿黃赤, 胸背痛, 脈浮弦, 苔膩, 口乾咽燥, 脈滑, 苔白, 形寒, 口渴",
    "肺胃寒熱證": "骨節疼痛, 不得眠, 灼熱自汗, 乾咳, 四肢不溫, 咽部不適, 浮數, 皮膚乾燥無汗, 惡風, 下部尤甚, 頭項痛, 鼻塞聲重, 兩目俱痛, 前額連眼眶脹痛, 身痛如割, 咳嗽, 渾身骨節痛, 脈右寸關大, 喉癢, 但熱無寒, 胸膈飽脹, 乾嘔, 微熱惡寒, 周身酸楚, 苔薄黃,脈浮緊, 頭痛如裂, 口渴, 呼吸粗促, 時煩",
    "膽胃寒熱證": "暴露其身, 口乾不欲飲, 咳不爽, 熱升先惡寒, 乍熱時即撤去衣被, 煩熱, 邊尖薄白, 不勝其熱, 心煩, 嘔吐, 身有微熱, 胸脅苦滿, 更用扇煽, 咽乾, 乍寒時即以衣被厚覆, 不勝其寒, 脈弦數, 口苦, 頭痛, 脘痞不思飲食, 苔淡黃, 按之小弦, 脈弦, 蒙頭而臥, 目眩, 熱降大汗惡風, 默默不欲飲食, 往來寒熱, 苔白, 脈浮數, 舌邊尖紅苔黃, 胸中煩",
    "脾胃虛寒證": "甚則色黑, 便血紫暗, 神倦懶言, 伴脘腹隱痛, 面色不華, 舌淡, 便溏, 素喜熱飲, 脈細",
    "肝胃虛寒證": "得食痛緩, 進寒藥益甚, 苔薄, 污濁湧吐, 舌苔黃膩, 舌淡, 腹中急痛, 心腹卒痛, 脘脅痛, 脹痛, 苔白膩, 脈細, 食慾不振, 脈沉, 嘔吐清冷涎沫, 食後更甚, 喜熱畏寒, 手足厥冷, 噯氣頻作, 腹部作脹, 脘背覺熱, 胃脘隱疼, 苔黃多液",
    "肝脾虛寒證": "蒼白, 形寒肢冷, 噁心, 嘔不出物, 舌淡苔薄白多津, 怕冷, 吐酸噯氣, 窘迫難忍, 苔灰, 腹痛喜暖喜按, 嘔吐食物殘渣, 脈細, 便後腹中即舒, 矢氣頻, 晨洩, 苔中後膩潤, 嘔吐, 畏寒怕冷, 四肢倦怠無力, 青黃, 飲食人口即吐, 怯冷, 面色白, 沉細而結, 久瀉帶黏液, 脈濡, 脘腹脹痛感涼, 畏寒, 自覺有氣自臍下向上頂衝, 苔白舌邊有齒印和紫斑, 苔白滑膩, 脈沉, 脈弦, 腹痛脹滿夜發甚, 便前腸鳴, 小便清長, 有時嘔吐清水夾粘液, 洩瀉, 便溏, 納呆",
    "脾腎虛寒證": "形體畏寒, 舌淡, 面色晦暗, 進熱食則舒, 四肢不溫, 腸鳴便瀉, 大便溏薄, 脈細, 面色青黃, 四肢清冷, 腰膝酸軟乏力, 脈沉無力, 胃冷, 入夜加重, 食慾不佳, 苔薄, 完穀不化, 帶多清稀, 噯氣吞酸, 畏寒, 手足逆冷, 舌質胖嫩有齒印, 脈沉, 惡寒身倦乏力,脘痛, 口淡納差, 腹脹, 下腹冷痛, 小便清長, 身重懶言, 白滑",
    "肝腎虛寒證": "睪丸上提, 神識不清, 白帶甚多, 痛劇則嘔吐, 腰腿皆酸, 下肢痛不能抬舉, 有齒印, 睪丸掣痛, 腹痛, 疼引陰囊, 連及少腹, 脈沉細而弦, 面容蒼白, 陰莖內縮, 四肢逆冷, 少腹疼痛, 少腹兩旁疼痛, 脈沉, 形寒惡冷, 陰囊清冷, 足冷, 陰囊皺縮, 夜間常被痛醒, 發熱, 舌苔白薄, 洩瀉, 便溏, 背脊惡寒而痛, 頭部昏脹, 舌稍紫",
    "肺腎虛寒證": "胸脹不舒, 舌質淡白少苔, 餓不欲食, 乏力, 吐之不出, 脈象沉遲細弱, 脈沉細而微, 精神疲憊, 咽乾欲熱飲, 咽乾咳痛聚脹, 脈沉痰, 咽之不下, 常自汗出, 喉部有痰阻, 顏面枯暗無色澤, 氣逆咳喘, 喉痛聲嘶, 發音不揚",
    "肺衛風暑證": "咳嗆, 頭脹, 脘悶, 右寸浮數虛數, 頭昏, 渴飲即吐, 脈數, 胸悶重, 苔微黃, 惡寒發熱無汗, 身熱頭脹, 痰多, 脈左勁右濡, 喉嚨痛痰多, 舌苔厚白膩, 左胸前區憋悶, 項強反張, 頭痛, 畏寒, 夜躁, 胸悶, 發熱汗出, 不飢, 煩躁不靜, 小便短赤, 四肢麻痺, 微有寒熱, 煩渴引飲, 舌邊尖紅, 麻痺欲厥",
    "肺胃風暑證": "舌紅苔白中黃, 脈左浮緊, 面赤煩渴, 熱盛口渴, 漸然厥起, 胸前灼熱, 或汗出不透, 尺膚熱甚, 左手反小, 惡寒, 煩燠少寐, 四肢不仁, 身熱無汗, 苔白, 身熱自汗",
    "心肝風暑證": "呼吸促, 煩渴, 神昏驚 , 高熱, 舌紅, 脈細數, 面紅唇赤, 苔白膩, 苔幹, 高熱無汗, 小便短黃, 面紫, 遍發赤疹, 密集粟粒樣紅疹潮紅如塗丹, 兩目紅赤, 舌綿, 咳嗽, 苔黃, 脈弦數, 遍布水泡如豆大, 瘡癤, 大便色綛稀溏, 唇幹少津, 夜躁, 苔薄黃, 煩躁不靜, 紅綿, 下利, 灼痛化膿, 周身皮膚灼紅, 煩渴引飲, 脈洪數有力",
    "肺胃暑濕證": "痞悶不飢, 噁心, 舌苔黃厚濁, 胸膈痞滿, 脈濡而微弱, 頭痛如裹, 脈細, 脘悶, 惡寒, 大便洩瀉, 頭昏, 四肢關節酸痛, 嘔吐, 身重,惡風, 周身疫楚, 目赤心煩, 溏洩, 腹滿, 前板齒燥, 目黃, 渴不欲飲, 午後潮熱, 目不了了, 小便已灑然無聳, 耳聾, 便時莖痛, 脈沉, 小便短赤, 肌熱如灼, 大便閉結, 發熱無汗, 身痛骨節疫楚, 咽癢",
    "肺脾暑濕證": "弦數, 頭及上身汗出如流, 腹熱, 便閉, 舌暗苔厚穢膩, 頭重作脹, 胸悶心悸, 煩躁不寐, 脈細, 脈右濡細數而不揚, 頭重, 口甜, 溺赤短少, 左弦數, 身重疫痛, 鼻流清涕, 發熱凜寨, 渴不喜飲, 背冷, 臉腿浮腫, 頭暈, 得汗不暢, 口不知味, 脈沉, 胸脘作悶, 舌苔黃膩根厚, 食納差, 嘔惡有黏痰, 四肢乏力",
    "脾胃暑濕證": "厭食便溏, 皮膚灼熱, 脈弦滑, 或少汗, 尿赤黃少, 心煩, 倦怠無力, 面垢, 腹滿, 舌苔薄白, 薄黃苔, 煩躁不寧, 胸腹悶痛, 發熱口渴自汗, 苔黃, 濡數, 噁心嘔吐, 乏力, 納呆無味, 午後高熱, 多飲多尿, 腸鳴漉漉, 腹脹, 苔膩, 口唾白沫, 便溏, 洩瀉, 瀉時腹滿, 脈緩, 無汗",
    "膽胃暑濕證": "弦數, 便溏熱, 舌紅, 大便溏似痢, 脈濡數無力, 噝氣, 嘔惡, 汗不暢, 脘悶, 舌紅苔黃, 惡寒, 微寒熱甚, 少寐, 小赤少寐, 小赤少寐, 溲黃, 口渴引飲, 苔白布糜, 熱勢不揚, 寒熱起伏, 小便赤少, 口燥, 耳聾, 糊數, 煩懊, 苔淡黃, 退則有汗, 腹灼, 寒熱間作",
    "肺衛風濕證": "脊痛, 納呆少食, 四肢倦怠, 嘔惡, 頭痛如裹, 頭脹沉重, 頸筋疼痛, 頭重, 身重, 惡風, 頸項似拔, 上肢酸, 肢體酸楚沉困, 胸悶重, 鼻塞聲重, 項背牽強, 有麻感, 微腫, 清涕不已, 咳嗽, 腰似折, 惡寒發熱, 微汗, 左胸前區憋悶, 舌苔白滑, 身疼痛, 胸悶, 口苦微渴, 脈浮緊, 脈浮緊不數, 噴嚏, 苔薄白, 肩疼痛, 舌苔厚膩, 舌苔白潤略厚, 無汗, 舌苔白黃相混, 脈浮而數, 脈浮弦緩",
    "肺脾風濕證": "惡寒不發熱微汗出, 噁心, 脈弦緩, 頭脹, 咳不暢, 脘悶, 不思納食, 背及兩膝發涼, 鼻塞, 腹痛, 身重, 四肢倦息, 舌苔薄白,脈浮緩尺弱, 肢冷, 惡風汗出不透, 胸悶短氣, 大便不暢, 頭痛, 舌苔白滑黏膩, 脈浮弦, 洩瀉, 便溏, 形寒, 發熱惡寒無汗, 斑發隱癢不透",
    "肝脾風濕證": "脈沉滑, 陰雨天疼加, 有時惡風, 脈弦滑, 脈細滑數, 手指屈伸不利, 疼痛局部腫脹, 質淡紅, 四肢疼痛走無定處, 精神倦怠, 紫紅黯突出, 關節疼熱, 皮下小結, 惡寒發熱, 舌紅苔白乾或黃燥, 沉重不能抬舉, 下腹隱痛瀉後較舒, 關節疫楚疼痛, 脈關弦, 發熱, 苔膩, 苔白, 舌邊瘀斑,納少胸悶, 關節紅腫劇痛",
    "肝腎風濕證": "兩足腫痛, 日夜呻吟痛苦, 腰脊痛不可忍, 乏力, 苔膩薄, 脈略滑, 腰部尤甚, 脈細, 腰髀痛麻痺連及胯腹, 脈沉滯, 行履不能, 兩足麻木, 苔粉白, 寸關弦澀, 周身關節酸痛, 舌質色淡, 難於轉側, 苔薄白, 苔白, 體倦, 神疲, 背脊及兩腰脅痛引兩腿, 痛甚則泛惡清涎, 脈兩尺沉細",
    "肺衛寒濕證": "手足遲重, 脈細濡不數, 脈右緩左緊, 不欲食, 頭痛, 惡寒, 鼻塞, 遍身疫痛, 苔白滑膩, 口中淡, 身重, 舌淡苔白, 惡寒發熱自汗, 肢冷, 一身骨節疼痛, 懶言語",
    "肺胃寒濕證": "小便不利, 頭痛且脹, 舌質暗, 咳嗽痰多, 胸膈痞滿, 凜凜惡寒, 大便反快, 脘中痞悶, 頭脹暈痛, 舌苔白厚膩, 咽部不適, 吞酸,鼻塞, 口甜, 脈沉弦滯, 寒多熱少, 鼻內疫痛, 弦緩, 甚則足冷, 身重肢懈, 乾咳無痰, 口淡不渴, 神倦嗜臥, 一身盡痛,苔白滑, 胸痛, 如裹如蒙, 頭重脹痛, 脈數帶弦, 關節尤痛, 發熱無汗, 氣逆",
    "肺脾寒濕證": "脈沉滑, 形寒肢冷, 脈弦滑, 嘔清水飲食, 腹痛脹滿, 舌苔白潤, 小便短少, 苔穢膩, 身倦, 脈濡數, 頭脹暈痛, 重按無力, 脈弦而滯, 發熱惡寒, 胸悶重, 便艱, 苔白膩略黃, 脈沉伏, 斑發隱見無常作癢, 口淡不思飲, 脛冷, 少納脘悶, 舌苔灰白而滑, 暗淡, 臉色蒼白, 左胸前區憋悶, 頭痛, 胸悶, 咽乾痰黏滯, 脈浮緊, 腰背酸痛, 脈浮弦, 緊按腹部, 便溏, 洩瀉, 無汗, 舌薄白, 氣逆",
    "膽胃寒濕證": "脈象遲細弱, 飲即吐涎, 小便不利, 皮膚灼熱, 胸腹苦悶, 寒重熱輕, 胸脅滿微結, 但頭汗出, 肢冷, 淡黃灰膩, 脈右浮動而滑,喜熱, 神疲, 每天中午發作, 骨楚, 有汗, 乏力, 但寒不熱, 氣短懶言, 頭暈, 舌苔白滑, 頭痛, 語聲低微, 熱不退, 苔轉微黃, 身重體倦, 嘔吐清冷, 寒多微有熱, 心煩口淡乏味, 面色無華, 往來寒熱, 脈滑數, 口渴, 脈左沈遲弦",
    "脾胃寒濕證": "肢困, 噁心, 或按時而至, 沉弦而滯, 脈弦緩, 肩背沉重, 發熱不已, 寒起四末, 嗜睡, 胸脘腹部悶脹不適, 吞酸, 舌苔中部白濁厚膩, 腹痛,頭重, 身重, 下肢冷, 眼瞼下垂而腫, 輕微畏寒, 面色青暗, 兩尺沉無力, 腹滿而喘, 咳嗽, 指甲發青, 頭暈, 左胸前區憋悶, 沉伏, 頭痛,大便瀉水, 多氣, 口中淡, 尿少, 便溏, 形寒, 寒熱交作, 蒼白, 小便不利, 大便稀溏, 寒熱定時, 體倦神疲, 下肢無法邁開大步, 脈細,不渴, 低燒, 下痢紅白, 胸悶重, 大便順, 灰黃, 面黃乏力, 傍晚身熱, 渴喜熱飲, 惡寒怕冷, 沉細而緩, 納谷欠香, 脈濡緩, 胸悶, 舌苔白膩, 不飢, 嘔水, 舌苔垢膩中根厚, 不食, 間日惡寒, 小便澀, 白滑, 四肢乏力, 納呆, 兩臂上舉困難, 氣逆",
    "脾腎寒濕證": "變形, 脈虛細, 大便自調或溏, 固定不移, 指關節腫大, 舌紫苔白, 苔白膩, 腹常脹滿, 兩肩, 麻痺, 疼痛, 面色漆黑, 時見赤白,無法自由活動外, 腹痛腸鳴, 遇寒加重, 步履維艱, 腰膝疫重, 口唇及上齦色紫, 腹瀉經年, 兩踝及兩手腕, 舌苔薄膩, 臍痛連腰, 伸屈不利,兩髖關節亦強直僵化, 腿痛, 帶下, 腰髀痛麻痺連及胯腹, 面黃, 便白腖, 脈沉, 苔白滑, 苔薄白膩, 平時大便稀溏, 陰股間寒, 舌淡白而潤, 脈右沉小, 兩腿疼痛不能移動只能仰臥, 脈沉細少力, 兩腿麻木不仁, 舌淡, 腹痛便前後更劇, 淡白胖滑, 身常凜凜, 肢厥, 帶色淡黃, 脈細, 脈沉弦且遲, 面色晦滯, 陰寒加劇, 不能翻身, 腳攣急拘痛, 體重, 腰酸腿軟, 四肢清冷, 午後形寒, 畏寒納少, 手指麻木, 質清稀, 面浮, 四肢骨節沉困疼痛, 兩膝酸痛, 嗜睡懶言, 足脛疼痛, 喜食甜味, 口淡不渴, 腸鳴腹脹, 兩膝, 納減, 難於轉側, 肘關節亦僵化, 遇冷則發, 大便溏瀉, 肢重, 骨節酸困疼痛, 兩下肢浮腫冷痛, 沈遲, 兩膝關節及肩關節冷痛",
    "肝脾寒濕證": "腹滿不欲飲食, 疲憊不堪, 經不行, 四肢關節痛, 指關節腫大畸形, 不能接續, 四肢浮腫, 脅下拘急而痛, 舌淡暗, 大便灰黑, 形體消瘦, 四肢屈伸不利,面色萎黃間灰黑, 全身肌肉, 強直僵化, 面目黧黑, 苔膩, 舌淡有齒痕苔白膩, 苔白, 形寒畏冷, 脈沉弦滑, 發涼屈伸不利, 脈象虛弦, 畏冷, 手, 舌淡苔薄膩, 張口困難, 右脅疼痛, 胸悶重, 肢冷, 脈緊弦, 四肢彎曲, 喜暖惡寒, 左下肢疼痛麻木沉重, 痛處怕冷, 氣短懶言, 沉重, 薄白, 臉色蒼白, 兩脅痛, 脈微欲絕, 沉細緩無力, 脈弦緊略細, 觸之疼痛叫喊, 唇甲蒼白而暗, 肌肉萎縮, 不飢不渴, 腰痛, 高熱不退, 皮膚紅斑, 下肢關節疫脹疼痛, 舌不能伸張, 脈細弦滑, 一身盡黃, 不思飲, 神衰氣短, 大汗淋漓, 消瘦, 脈象細遲, 惡寒汗出, 面淡黃, 苔厚白膩, 或黃色不鮮, 倦怠嗜臥, 頭暈, 左胸前區憋悶, 大便清稀, 全身關節疼痛紅腫, 苔中後白薄微膩, 汗多, 關節疼痛, 形容憔悴, 舌淡稍胖, 語言低微, 洩瀉, 便溏, 吝嗇惡寒, 全身困乏, 畏寒喜熱, 納少泛惡, 肘痛, 嘔惡, 脈沉遲, 腰酸腿軟, 晦暗無澤, 以兩膝關節明顯, 脈沉細而緊, 麻木, 脈緩細滑, 經痛, 頭昏心悸, 經行色黑量少, 面色乏華, 胸悶, 小渡淡黃, 夜間疼甚, 不能抬舉屈伸, 精神萎靡",
    "肝腎寒濕證": "苔白厚膩, 排尿無力, 少腹劇痛伴嘔吐, 龜頭觸覺不靈, 脈弦滑, 性交後加重, 腰骶部疼痛, 面黃蜷縮, 怕冷, 苔薄白而滑, 發涼暖水袋須史不離, 舌體胖大, 畏寒怕冷, 四肢清冷, 尿頻數, 足跟不能任地, 形寒怯冷, 手腕指關節腫痛, 弦而緩, 面色眺白, 全身關節腫痛, 全身倦怠, 怯冷, 陰莖內縮, 兩睪丸陰冷而潮濕, 月經後期, 腰部酸軟, 脈瀨緩, 汗出淋漓, 舌淡邊紫, 畏寒, 少腹時有隱痛, 活動不利,尺部沉弱, 脈弦緩無力, 苔厚濁, 苔薄白膩, 陰雨加劇, 舌淡紅有齒痕, 脈沉細遲, 經行色淡, 白帶多, 經行少腹痛脹, 遇寒則收縮引痛, 舌質淡",
    "肺衛濕熱證": "噁心, 四肢麻痺痛, 肢節紅腫疼痛, 舌紅, 苔黃厚膩, 小便黃少, 肢腫, 口唇周圍有數個小潰瘍, 肢若廢, 四肢關節酸楚, 惡風, 發熱惡寒, 足不任地, 胸悶重, 咳痰少, 舌尖, 高燒, 肢節疫楚, 面赤口渴, 咽喉疼痛, 肢不舉, 身疼, 齒齦紅腫, 發熱寒熱起伏, 頭暈脹蒙, 苔白薄膩,左胸前區憋悶, 身, 周身酸楚, 口歪, 胸悶, 納穀不馨, 午後發熱汗出熱不解, 浮細數, 大便較燥, 手不可近, 納呆, 頭痛而昏, 骨骱煩痛",
    "肺胃濕熱證": "肢軟肢冷, 倦怠乏力, 身重頭脹, 苔黃白相兼黏膩而薄, 脈濡數, 苔白膩, 嗜睡, 低燒不退, 便瀉, 便軟, 脈弦滑略數, 神疲手足心熱, 頭脹頭昏, 身重身痛, 咳嗽, 渴不喜飲, 乏力, 肌膚隱黃, 數沉鬱不揚, 少氣懶言, 口膩微渴, 頭痛, 身熱不揚, 其熱愈甚, 夜寐不安, 小水不利赤數, 烈日不暄, 或凜凜惡寒, 目赤, 體倦, 肢體疫楚困重, 兩腮腫痛, 畏風振寒, 頭昏倦怠, 面目浮腫, 渴不欲多飲, 午後為甚, 脈右滯濡緩, 煩熱, 熱勢不揚於外, 嘔惡, 舌苔膩, 白厚膩, 便溏溺熱, 面色晦滯, 沉取躁動,知飢不食, 口渴不甚引飲, 舌苔必水滑, 困倦肢懈, 身熱自汗, 面色必暗滯, 惡寒發熱, 細數, 萎黃, 耳聾, 胸脘痞悶, 皮膚發小疹如水晶色, 遍體不適, 汗出熱不退, 無汗, 頭額獨熱",
    "肺脾濕熱證": "小便赤澀, 酸楚不適, 脈像模糊, 胸部痞悶, 脈濡而數, 白瘩佈於胸腹, 面赤目赤, 嘔惡, 脘悶, 時時千噦, 按其皮膚不甚灼熱, 脈反緩而弦, 舌苔滿布, 略帶黃色, 精神疲倦, 渴喜熱飲, 舌白, 胸脘痞悶不舒, 氣促, 四肢背脊惡寒, 腿足疫痛, 背脹, 苔灰膩, 口渴不喜飲, 苔白厚, 頭痛, 色頗透明, 口有甜味, 表有微熱, 身重不能轉側, 但熱不寒, 口反不渴, 肢微厥, 脈弦小而滑, 便溏, 身痛不能屈伸, 肘膝疫痛, 全身重著, 外熱反不盛",
    "膽胃濕熱證": "欲嘔欲吐, 熱則面赤肉潤, 舌苔黃白相兼, 舌苔微黃, 寒起四末, 必待汗出淋漓而熱始退, 肌膚無汗, 或軟, 重棉厚被不禁其寒, 舌苔薄白, 或洪, 胸中痞悶, 欲食, 口渴引飲, 氣促, 頭痛欲裂, 脈弦數, 脈弦勁, 惡寒壯熱, 大便時溏時幹, 乾嘔, 脅痛, 神倦肢怠, 著衣則煩, 口苦咽乾, 去衣則凜, 四肢抽搐, 寒熱往來, 舌苔白膩, 舌膩厚措, 心煩煩躁不安, 痰多脘悶, 胸脅滿痛,脈弦, 潮熱自汗, 脈象浮弦, 汗多心熱, 小便赤, 脈滑, 神誌恍惚, 脈弦緊, 寒則戰課鼓頜, 舌灰黃膩邊紫, 脈弦而數, 舌紅苔白厚微黃",
    "肺肝濕熱證": "苔黃, 便不暢, 惡風寒, 苔灰膩, 左脅痛不能轉側, 日晡熱甚, 澧短赤, 頭痛, 脈澀滯, 身熱夜甚, 底絳, 咽部不適, 脈沉濡, 舌邊尖綿, 小腹亦痛, 苔膩, 脈數, 苔白, 無汗, 胸膈痞痛, 渴不欲飲",
    "肺腎濕熱證": "咳嗽, 口渴便秘, 癃閉, 脈弦滑, 舌綿苔黃根膩, 發熱, 短氣, 尿少, 氣喘, 納呆, 浮腫, 咽部不適",
    "脾胃濕熱證": "紅多白少, 舌紅, 舌苔灰黃, 舌邊紅苔黃膩, 晝夜下利, 先瀉後痢, 腹痛, 痞悶, 胸悶重, 面色淡黃, 瀨緩, 渴不欲飲, 小便赤短澀痛, 口渴引飲, 如水晶狀, 苔中黃膩, 裡急後重, 發熱纏綿不解, 大便糊狀, 不食不飢, 口苦, 根部微黃, 脈瀨緩, 左胸前區憋悶, 午後夜間為甚, 頸部及胸前皮膚均見到白密布, 瀉利黃水, 脈濡細而數, 神疲肢倦, 食後作瀉, 胸悶, 脘疼, 大便不爽, 下利膿血, 泛惡, 汗出熱退, 腹脹, 苔膩, 脘脹, 脈滑, 舌邊深紅, 苔白, 糞少而黏",
    "胃腸濕熱證": "舌質淡紅, 色黃, 溏瀉灼肛, 脈來沉滑略數, 大便黏膩臭穢如醬, 大便雖亦有完穀不化, 膿血稠黏, 腹瀉便秘交替, 小便短少, 下痢後重, 脈濡數, 腹脹滿痛, 溏矢不爽, 蘊熱不退, 嘔吐, 苔膩灰, 脈沉滑數, 發熱惡寒, 色多黃赤黑, 白膩而乾, 按之軟而痛, 脈數, 而狀如垢膩, 腹痛拒按, 澧痛, 下墜窘迫, 大便不通, 舌苔黃濁膩, 腹痛後重, 脈弦數, 脈濡, 口苦, 痛加, 大便膠閉痛,腸鳴洩瀉, 頻轉矢氣, 且皆熱臭氣暖如湯, 苔薄黃, 脘麻痺, 腹灼, 下利膿血, 胸痞, 苔膩, 後重而滯, 便下白黏腖和爛肉樣物",
    "肝胃濕熱證": "脈小弦而數, 胃脘作痛, 寒熱起伏不清, 苔黃濁, 尿熱, 不時呃逆, 少腹作痛拒按, 口苦, 左胸前區憋悶, 氣逆撐脹, 嘔吐不止, 胸悶,苔薄黃, 神情沉迷, 小便短赤, 胸痞, 發熱, 胸悶重, 口乾欲飲, 飲人即吐, 弦而數",
    "肝脾濕熱證": "食人攻撐, 身痛, 肢節木僵, 尿赤面熱, 血殷紅, 歷節紅腫疼痛, 舌紅, 鞏膜黃染, 遍身及目俱黃染, 小便癃閉, 大便反快, 脈桿數, 夜間尤劇者, 心煩, 大便為白色, 伴索狀暗紅瘀腫, 灼痛瘙癢, 膝關節腫大紅灼熱, 腹大如箕, 腹滿, 時欲吐, 沉緩小澀, 脘腹作脹, 人夜疼痛更劇, 心煩易怒, 腹脹納少厭油, 渴不喜飲, 脈弦數, 尿色如茶, 肢節煩痛, 苔黃稍膩, 神倦無力, 足膝腫痛, 足膝腫痛掀赤, 脈弦滑數, 身強不能俯仰, 皮膚發黃, 溺赤不利短澀, 痛不可觸, 脈濡細而數, 身熱夜甚, 難以屈伸, 關部弦滑, 奇癢脫屑, 苔膩, 腰痛上引肩背, 左踝關節紅腫灼熱疼痛, 小便赤澀, 肢節疫痛, 大便少, 充血糜爛, 飽則頭眩, 腿足痿重, 夜不成寐, 煩躁不安, 大便燥結, 煩躁, 面色晦滯, 心下痞滿, 間歇遊走發作, 心中懊儂, 低熱, 煩躁, 不能站立行走, 發熱口苦口渴, 煩躁不寧, 渴不欲飲, 伴隨發燒, 肢節熱痛, 苔黃, 渴喜熱飲, 噁心嘔吐, 皮里膜外筋結痂塊, 舌苔黃膩, 苔黃膩而厚, 陰瘡, 全身皮疹, 頭汗出, 病久皮膚留有瘀斑, 惡食油膩, 濕疹瘙癢, 不飢, 四肢微急, 一身盡痛不能轉側, 是鮮明色, 不能食, 無汗, 脈弦滑帶數, 舌暗紅苔薄滑, 疼痛難忍",
    "肺衛風燥證": "喉嚨焦燥, 喉癢, 咳嗽陣作, 脈小滑, 舌紅, 口燥, 乾咳, 聲啞, 咳嗽氣急, 舌尖紅, 浮數而弱, 不能平臥, 痰少, 唇燥乾, 鼻塞,納少口乾, 喉頭通紅, 苔膩, 苔薄白乾, 苔白, 形寒, 咳嗽痰粘, 脈浮滑",
    "肺胃溫燥證": "小便赤澀, 乾咳咽癢, 左弦澀, 痰少而稠黏, 咽喉乾痛, 咯痰多稀而黏, 心煩口渴, 面赤, 胸悶重, 鼻乾唇燥, 嘔逆, 細數,吐氣烘熱, 胸脅刺痛, 乾咳無痰, 咳痰不爽, 左胸前區憋悶, 身熱壯熱, 聲音沙啞, 胸悶, 氣逆而喘, 鼻流濁涕, 息粗有聲, 脈浮數, 脈右浮數, 舌紅苔薄白燥",
    "肺胃燥熱證": "大渴飲冷, 苔全剝呈鏡面舌而不燥, 大煩喜冷, 汗不出, 浮洪大浮滑, 尺膚熱甚, 熱甚氣喘, 頭汗出, 苔黃燥, 燥裂生刺, 口唇燥裂, 面赤, 斑疹隱隱, 面垢, 大熱汗出, 溺短赤熱, 唇焦, 脈微弱沉伏, 舌質偏紅, 脈數, 惡熱, 口咽乾思涼飲, 鼻乾燥不得睡眠",
    "心肺燥熱證": "失眠, 入夜不知睡眠, 舌尖綛獨幹, 大便秘結不通, 徹夜不眠, 舌尖赤色作痛, 舌上無津, 心煩, 舌紅苔黃, 舌紫腫大而生大紅點, 脈數, 唇朱顴赤, 綾, 面色紅潤, 舌尖獨赤起刺, 發疹如丹, 聲音嘶嗄, 喉中乾燥, 尖幹有刺, 口渴之甚, 流涎拒食, 夜躁, 兩目有神, 如有針孔出血如線, 大便秘結, 舌瘡, 便秘, 煩躁不靜, 兩唇開裂, 發熱, 發熱夜甚, 口舌糜爛, 喜冷飲, 不眠, 鼻衄, 脈滑數有力, 寸部較浮, 唇乾舌燥, 時有心煩, 溲赤",
    "心胃燥熱證": "便閉, 少公頃蔓延全身, 色鮮紅, 時時懊儂, 唇燥齒槁, 絳紫而乾, 舌紅, 舌赤舌色絳, 面紅目赤, 出血, 汗多口渴, 周身發斑如錦紋, 口乾舌象, 下肢紫斑, 右盛於左, 四肢青紫如錦紋, 神昏譫語妄言, 目赤心煩, 背部紫黑, 發黑紫斑, 神煩惡熱, 心煩睡臥不寧, 微睡喘, 脈弦數, 熱甚於午後, 不知飢渴, 躁擾不安, 脈數而有中止, 舌尖有出血點三枚色紫, 舌綺起刺, 口渴, 牙齦出血如泉湧, 昏瞀耳聾, 前半截紅綛而痛, 胸腔青藍, 脈象弦數, 咽乾溲少, 自利紅水, 舌苔燥黑, 內含黃色水液, 煩躁不安, 發水皰, 或溶匯而成片, 中心乾, 舌燥苔黃, 汛不當期而至, 疹色為丹斑疹稠密, 右洪搏數, 不惡寒, 全身肌膚發赤, 直視, 身熱自汗, 全身紫斑, 舌赤或綾, 口鼻乾燥, 脈左小數, 脈數且澀, 劇痛不祥, 溺血便血, 便黑, 浮腫作痛, 舌綛如朱, 高熱不退, 幾無隙地",
    "心營燥熱證": "煩渴, 癤癤癰, 夜熱轉甚, 苔黃黑燥, 高熱, 唇焦舌燥, 脈細數, 舌赤, 大便色黑, 口渴恣飲, 筋脈拘急, 脈數, 暮夜神識不清, 煩躁不寧, 熱以夜甚, 夜煩不寐, 舌綿, 邊瘀斑, 昏睡間有躁動, 舌鮮紅, 紫紅色瘀斑, 口苦咽乾, 齒槁, 四肢厥冷, 便秘, 小便短赤, 神昏譫語, 齒衄, 芒刺, 鼻衄, 舌質淡, 氣促無汗",
    "肝肺燥熱證": "心煩不 是, 口齦出血, 舌赤, 口乾喜飲, 煩躁坐臥不寧, 灼熱瘙癢, 小便短澀赤熱, 大便乾燥, 咽乾, 舌絳, 舌潤而無苔垢, 脈軟而或弦, 或微數, 甚有肢冷脈伏, 脈弦滑數, 苔黃舌紅綛, 脈沉小數, 午後夜間為甚, 心悸氣短, 不喜飲, 口未渴而心煩惡熱, 口雖乾, 胸腹斑疹隱隱, 面紅熱盛, 下肢出血性紅斑, 夜寐不安, 舌鮮紅無苔, 脈細數無倫, 鼻衄, 舌於綥無苔",
    "腎臟胃燥熱證": "煩渴, 舌尖顫動, 心煩無汗, 口糜氣穢, 舌燥唇焦齒燥, 脈大無倫, 舌色粉紅, 多食, 苔黃白少津, 脈右洪, 小便頻數, 右脈弦數, 顏面潮紅, 晡熱, 頸項白密布, 沉滑數, 口乾思飲, 潮熱, 消谷善飢, 夜寐不安, 齒衄, 唇紅發皺, 光綹, 左數, 忽爾尪, 赤便結, 目幹, 五心灼熱, 氣怯多汗, 口渴多飲, 不寒癉熱, 重按無力, 齦腐, 肌膚粗糙, 終日神疲, 色空浮而無根, 午後熱升, 細數, 舌邊紫舌紅, 脈虛數無力, 肌膚消瘦, 腰疫腿軟, 多尿, 咽乾微痛, 舌赤無苔, 納少喜臥, 早上熱盡, 消脅肌肉, 舌紅少苔",
    "心肺虛燥證": "欲食不能食, 午後為甚, 表情淡漠, 神倦懶語, 脈細數, 唇齒幹, 動輒咽喉腫痛, 神思不清, 脈右弱, 汗多不止, 弱不禁風, 口唇乾燥, 手足心熱,不思食, 心煩不寐, 意識朦朧, 飲而不多, 口乾, 口燥, 舌尖紅苔薄, 欲臥不能臥, 心神恍惚, 素體贏瘦, 渴飲, 口乾咽燥, 右促, 溺數, 舌紅少苔",
    "肺腎虛燥證": "五心潮熱, 肌肉消瘦, 食少納困, 右側尤劇, 咳嗽氣促, 聲嘶, 寐後盜汗, 形似煙薰, 脈細澀, 便幹, 五心煩熱, 撫如乾板, 形體消瘦, 夜不安臥, 苔薄黃乾, 咽乾咽痛, 口乾唇燥, 午後發熱, 顴赤如妝, 面額黧黑, 脈沉細數無力, 頭暈, 夜寐不寧, 脈虛浮大而數,溲赤便艱, 咽乾痛, 於少津, 形倦莫支, 右脈沉細無力, 痰少色黃, 舌無苔, 鼻流濁涕, 口渴, 咳嗽胸疼, 便結, 精神萎靡",
    "肝胃虛燥證": "口於, 內熱, 夜不成寐, 大便燥結, 脈細數, 不思飲, 日輕夜重, 唇深紅, 胸腹痛不可忍, 脈左關沉弦, 小便頻數, 飲食不進, 舌紅糙有細裂痕, 脈來細弦, 心中煩熱, 有時吐白黏沫, 只能進半流質食物, 舌尖紅舌苔白而燥, 潮熱, 粒米不能下嚥, 每日只飲米湯數匙, 脈沉澀, 久吐不止, 脈弦大, 口渴, 夢遺, 消渴善飢",
    "肝脾虛燥證": "短赤澀, 便閉, 舌紅, 頭暈, 苔燥黃, 脈象沉遲, 口燥不喜飲, 口苦咽乾, 嘈雜善飢, 脈弦, 少腹兩側酸楚, 脈浮弦, 脈沉弱無力, 唇焦, 舌淡紅, 舌紅朱點, 舌黑乾燥如粟殼一層, 頭目暈眩, 頭目昏瞀",
    "肝腎虛燥證": "脈象弦數, 後根黑膩, 舌淡, 便秘時時欲解, 自臀部以下痿軟無力, 舌赤苔燥, 脈細而澀, 兩足不能任身, 脈細, 澀滯不暢, 面赤, 腰腳乏力, 面黃肌削, 羸瘦如柴, 必得解而後快, 頭目昏暈, 大便閉結, 脈芤澀, 口乾舌燥, 二便艱澀, 舌前半絢脹, 肛門墜脹,心煩不寐",
    "肺脾燥濕證": "心煩惡熱, 渴不思飲, 苔乾燥起刺裂紋, 渴飲不多, 黏帶血, 咳痰稠黏, 脈轉洪數, 咽喉乾痛, 唇乾鼻痰, 瀉利艱澀, 喉癢乾咳, 肛門熱痛, 溺短赤熱, 胸脅脹疼, 便洩不爽, 咳痰少, 舌苔粗如積粉, 飲水即吐, 兩邊白滑, 煩悶不寧, 腹痛按之痛甚, 口燥咽乾, 舌苔粗糙, 發熱, 大腹滿痛, 下痢白滯, 大便洩水如注, 灼熱, 胸脅串痛",
    "脾胃燥濕證": "口渴引飲, 食減納呆, 苔灰白而乾, 舌赤苔薄稍乾, 面無光澤, 大便溏薄, 盜汗, 脘悶不舒, 食物口中發甜感, 脈細濡, 低熱失眠,脈數無力, 口唇失潤, 喉間多痰質黏, 搔癢, 腹脹, 心煩少寐, 胸悶泛惡, 體倦乏力, 形體消瘦, 望食生畏",
    "脾腎燥濕證": "脈沉弱, 極易急發怒, 臉色蒼白, 噯氣, 頭暈而痛, 舌質鮮紅少津, 食慾不振, 大便溏洩, 舌淡胖苔白, 納少口黏, 昏沉不清, 腹脹, 失眠日久, 語音低微, 四肢疫麻, 無汗, 心煩寐少",
    "肺胃風火證": "腮腺腫痛, 發熱高熱, 目不能開, 舌紅, 頭脹, 見風更劇, 大便秘結不通, 苔白兼黃, 咽部不適, 鼻塞, 涎涕帶血, 胸緊氣促, 舌苔白厚帶刺, 頭痛, 音啞, 苔薄膩, 大便秘結, 脈弦, 舌燥唇幹, 目赤, 微惡寒, 口乾欲飲, 口渴, 尿少色赤, 舌質淡, 頤腫, 身無汗出, 頭痛抽掣, 時覺寒熱, 喉嚨痛欲閉, 胸脘滿悶, 脈弦滑, 咳嗽吐痰, 脈細數, 脈細, 耳前耳後腫, 胸脘滿悶, 脈弦滑, 咳嗽吐痰, 脈細數, 脈細, 耳前耳後腫, 脈浮滑數, 右寸關仍滑, 咽痛喉腫, 脈浮數有力, 惡寒發熱, 汗出不暢, 頭面紅腫掀痛, 質紅, 左關弦滑而尚浮, 寸關脈浮洪而數, 舌邊紅, 膿泡瘡引起周身浮腫, 痛時覺脹, 關節酸痛, 便秘, 目眩, 昏眩, 苔薄白微黃, 腹脹, 鼻流濁涕, 黏涎滿布, 脈浮數, 鼻衄",
    "脾胃風火證": "兩耳痛引腦後, 口苦口乾, 脈細數, 面唇俱白, 頭暈, 或二便阻滯, 食已即飢, 頭痛, 瘡腫腫毒, 惡寒, 面紅, 大汗淋漓,便秘, 惡風, 渾身大熱, 小便短赤, 脈寸弦, 不眠, 無汗, 四肢怠惰, 癮疹紅塊, 潮熱畏寒, 兩關洪大之至",
    "膽胃風火證": "耳中紅腫痛, 體痛, 兩腮紅也紅腫痛甚, 舌紅, 浮弦略緊, 頭痛, 少腹脹痛, 惡寒無汗, 溺短赤澀, 澳熱便溏, 時時嘔逆,目赤口苦, 煩滿, 背脊拘攣串痛, 耳中築築作痛, 腹滿, 苔白膩帶黃, 耳聲如蟬噪, 脈右浮數, 兩耳輪黃",
    "肝胃風火證": "口舌唇皆白點連成片狀, 目珠脹, 口氣臭穢, 大便燥結, 脈細數, 脈數有力, 口角流涎, 頜關節稍腫大, 頰車, 目糊, 腹痛, 時有鼻衄, 搔癢難忍時以冷水敷貼即稍感舒適, 小便黃, 溲黃, 紅色斑疹, 耳鳴耳聾, 苔黃, 胸腹部尤甚劇癢, 小便黃赤, 口唇周圍及眼瞼生瘡, 口眼囑, 無法碰觸, 稍癢, 紅斑晝伏夜現, 臉頰拘急, 面赤高熱(41℃), 舌紅暗, 苔膩, 目赤, 脈浮數, 口渴, 口不能開,煩熱口渴, 紅腫瀰漫, 苔黃幹, 舌紅綿, 顴骨部灼熱潮紅, 斑塊色紅而癢, 少津",
    "肝膽風火證": "脈弦滑而實, 急躁易怒, 眩暈旋運, 舌紅, 昏暈欲僕, 巔頂痛徹目, 耳流膿, 時緩時劇, 咽部不適, 顏面發紅, 漫赤, 頭痛如掣, 苔薄, 濁涕稠黏, 脈弦數, 舌邊尖紅而多刺, 頭昏頭脹, 咯有凝血, 目赤, 耳鳴耳聾耳癢, 唇紫而腫, 時流黃水, 沉取尤甚, 頭重足輕, 眠差, 脈弦緊有力, 脈數有力, 面紅唇焦, 額痛, 臭難聞, 耳內潮濕作癢, 肢體拘急, 弦疾, 項背牽強, 煩躁失眠, 麻木, 苔黃, 噁心嘔吐, 脈弦勁, 兩眼眨動頻仍, 鼻竅不通, 咳嗆見血, 眼花繚亂, 便秘, 口渴煩熱, 目眩, 咽腭乾燥, 兩足易冷, 口苦咽乾舌乾",
    "心膽風火證": "左脈弦滑而數, 潮熱一日輕一日重, 熱多, 舌大燥而垢膩, 胸前紅疹, 舌赤, 顴紅, 熱甚於夜, 有時昏糊欲睡, 舌綹赤, 心煩, 脈細而數, 夜熱反熾, 大渴引飲, 按之無神, 發狂, 舌中灰, 氣有噦聲, 汗定動皆洩舌象, 大便口渴引飲, 小頻數, 寐中傷有肢掣, 經水適來, 右脈虛大而滑, 左脈小弦而數, 右脈數, 舌紅起刺, 舌邊綾, 神昏諵語,右脈數滑而大, 口渴, 苔中黃, 有時語言錯誤",
    "心肝風火證": "神識不清, 身熱如火, 脈數左甚, 面赤, 赤若丹砂, 指顏動, 昏迷不省, 目赤唇焦, 項背牽強, 牙關緊閉, 手足微冷, 脈弦滑而數, 角弓反張, 面紅顴赤, 脈弦數, 潮熱夜甚, 神呆, 其痛非常, 手足瘛瘲, 舌多鮮紅, 脈虛細數, 汗多, 四肢僵直, 舌紅刺僵脈象, 發丹疹, 煩躁躁擾, 形似錦紋, 高熱不退",
    "肺胃寒火證": "身痛, 手足涼, 壯熱多汗大汗, 便閉, 斑疹不透, 發熱惡風寒, 氣粗, 嘔惡不納, 鼻塞, 苔穢乾無津, 目赤唇紅, 形體消瘦, 熱多寒少, 脈浮右大於左, 耳根發涼, 臥重衾中, 仍嫌不溫, 口穢噴人, 神昏妄語, 咳嗽痰黃, 頭痛, 沉細而滯, 脈來洪滑且數,乳蛾兩顆, 尿赤便結, 滑數, 苔黃質紅, 不惡寒反惡熱, 目痛鼻乾齒板燥, 咽喉腫痛, 且發戰粟, 神昏肢冰, 煩躁不安, 苔膩白厚, 色如石榴子, 心煩不眠, 浮數, 頭昏, 寒時則厥, 苔黃舌紅, 嘔逆, 大渴口渴喜冷, 細數, 口大渴喜冷, 面色少華,肌膚灼熱, 咳痰白稠, 苔色黃膩垢濁, 周身酸楚, 頻溺短縮, 舌赤苔黃膩, 胸膈煩悶, 無汗, 半時許吐痰數口, 身大熱而惡寒",
    "膽胃寒火證": "脈象弦數, 但欲眠睡, 身疼無汗, 胸悶胸滿, 頭痛如破, 心下急, 心下痞硬, 白膩, 脈左弦右洪, 胸脅苦滿, 飲食不進, 脅下滿, 每至平旦交陽分始退, 日晡潮熱無汗, 背痛, 鬱鬱微煩, 熱多寒少, 口渴惡熱, 口渴惡熱喜飲, 發必在暮夜陰盛之際, 心中痞硬, 身痛無汗, 身尚惡風, 耳聾, 目合則汗, 鼻燥口乾, 苔薄黃, 脈象沉弦, 發熱時, 發寒時, 頭項強, 身熱惡風, 小便短赤, 目赤, 大便瀉利, 發熱亦甚, 脅大痛, 胸脅痛滿, 先寒後熱",
    "心肺寒火證": "躁擾不寧, 舌鮮紅起刺, 深紅無苔, 脈關尺沉弦小數, 頭暈, 厥逆, 面垢齒燥, 飲即乾嘔, 口乾不喜飲, 頭痛, 發熱日輕夜重, 心煩, 惡寒, 咽燥如故, 兩寸獨數, 惡風惡寒, 苔白, 脈左弦, 肢冷, 無汗, 惡熱, 目赤唇紅, 胸腹灼熱如焚, 舌綿",
    "胃腸寒火證": "惡寒, 嗜臥, 全身骨痛, 斑當欲出未透之時, 筋脈牽掣不停, 形寒惡風, 不得汗, 一身及面目悉黃",
    "肝胃寒火證": "或黃黑濁飲, 體溫漸高, 嘔惡益頻, 心中疼熱, 氣上撞心, 或下蟈, 痛時如絞, 脈微, 嘔吐青綠黑臭之水, 寒熱, 飢而不欲食, 心胸格拒, 或吐酸苦黃綠之水, 大汗淋漓, 熱仍不退, 突發上腹陣陣鑽痛, 嘔逆, 膚冷, 利不止, 消渴, 食則吐蛔, 不思納谷, 乾嘔, 煩躁無暫安, 或吐痰涎濁沫, 脈細小而沉, 四肢厥冷, 舌常色, 四末微冷, 脈象滑數, 脘痞嘔惡, 苔薄白,輾轉不安",
    "肺胃濕火證": "便溏自利, 口苦口渴, 汗出不暢, 大便不暢, 汗多, 胸悶納呆, 潮熱, 膩白, 舌苔白糙, 膈間煩悶特甚, 腹脹, 午後人夜更甚,脘悶胸滿, 身熱不退, 咳痰黏, 無汗, 便秘溲赤, 神糊煩懊",
    "胃腸濕火證": "小便赤澀, 自利不爽, 垢膩臭穢, 苔黃不甚燥, 下黃黑稠黏, 腹痛洩瀉, 汗出手足較甚, 痞滿燥實, 完穀不化, 脈沉數, 裡急後重, 口乾, 暴注下迫, 口燥, 瀉出如射, 吃湯下湯, 臍旁硬痛不可忍, 大便閉, 夜躁, 脈小弦, 日夜無度, 潮熱, 煩躁不靜, 溏如敗醬膠飴, 沈實搏指, 口乾咽燥, 大便解多不爽, 大便閉結, 肛門痛",
    "膽胃濕火證": "昏睡上視, 左浮滯沉數, 頭痛, 多在午後與夜間, 夜半始退, 斷齒咬牙, 舌紅, 黃糙, 溲濁黃赤, 胸腹鬱悶, 凜寒起伏, 脈息緩滯, 冷時雖擁被猶寒, 午前發熱, 脈浮洪數, 舌苔滿布, 舌苔白膩而厚, 目瞪上視, 熱時亦有微汗, 咳聲低微, 汗出不清, 脅痛, 昏睡露睛, 脈數而滯, 兩脈沈實, 面色黑滯, 而胸腹之熱不除, 舌苔穢而厚, 膈悶欲嘔, 目赤, 不惡寒反惡熱, 遍身熵熱內熾, 身熱退, 神昏氣絕, 口苦口渴, 煩躁不安, 舌紅刺苔黃膩間現黑點, 嘔惡, 舌苔邊白中黃, 脘痞, 胸脅苦滿, 腹臍作痛拒按, 面白唇蒼, 口臭便難, 煩悶, 苔黃, 默默不食, 欲睡, 耳聾, 寒熱類瘧, 胸脘痞滿, 大便秘或溏臭, 脈象弦急, 脈六部俱無,脈沉弦, 深紫苔滿布堆積如粉",
    "肝胃濕火證": "便溏下利, 心中疼熱, 有氣從小腹上沖, 氣上撞心, 寒熱似瘧夜作, 先厥後熱, 細小而沉, 下利血水, 四肢不熱, 人暮諵語, 吞酸, 心胸格拒, 胸腹板實, 勞則發熱, 飢不欲食, 舌苔黃中帶灰黑, 腹痛久痢, 下蛔, 聲音不出, 耳聾, 脈滯而沉, 中心如焚, 身熱, 神蒙, 舌灰潤, 身熱如焚, 靜而時煩, 痞結, 口渴, 肢寒",
    "心肺濕火證": "心胸悶悶, 壯熱不為汗解, 口燥引飲, 熱起煩擾, 舌尖邊俱綿, 則呼吸之氣有出無人, 面赤目紅, 失眠, 苔黃濁, 入夜不知睡眠, 徹夜不眠, 脈沉而數, 心煩, 便秘, 神昏譫語, 熱勢起伏, 痰黏難出, 赤疹密布, 不眠, 小短少, 胸悶煩躁, 交睫驚跳, 夜煩不寐",
    "心胃濕火證": "煩渴, 舌淡綿有刺, 便閉, 舌紅, 脈大而虛, 發熱有汗不解, 衄血不止, 舌中白, 心煩, 舌邊爛, 面赤, 右脈滑, 煩渴而不欲飲, 舌黃或焦紅, 左部弦大, 溺赤A澀, 便血大便或血或黑, 項發白瘩, 脈象弦堅而數, 左脈數, 舌綿, 苔黃, 氣粗似喘, 壯熱多汗, 午後發熱, 寐中錯語, 舌苔滿布而厚膩, 胸現紅疹, 夜間煩躁, 不臥, 夜甚, 神昏譫語, 根帶灰黴, 渴飲, 脈細數虛而啄指, 便溏, 無寐, 咯痰帶血, 脈數右部沉鬱, 脈形細數",
    "心營濕火證": "脈息弦滑而疾, 時有譫語, 舌綛苔少, 大便色黑如醬, 舌苔中黑邊綹, 面紅目赤, 心煩, 帶血, 舌現紅星點點, 熱熾熱勢不挫, 聲啞不語, 苔轉灰黑, 齦瓣如漿, 焦紅或縮, 至夜則劇, 舌苔焦黑無津, 神糊, 紫乾, 煩渴大渴飲冷, 圓硬, 口燥不欲飲,舌黑咽燥, 遍發斑疹, 咳唾粉紅, 小便短赤, 夜寐不安, 舌鮮紅燥刺, 妄言, 脈數左弦, 胸部細紅斑點隱隱, 口渴, 周身皮膚滿布紫紅色斑疹",
    "心肝濕火證": "坐臥不安, 腫脹劇痛, 汗血, 舌苔黃, 舌紅, 脈細數, 咳嗽多痰, 心煩, 苔根黃膩, 脈弦數而急疾, 簇狀水皰晶瑩腫脹, 大便量少而乾, 皮膚赤紅, 搔癢難忍, 小便黃, 上下失血, 遍身癢疹, 溲黃, 疹色鮮紅, 脈弦數, 小便黃赤, 胸脅部近乳處起泡狀疹, 發熱, 鼻衄, 灼熱或赤或紫, 舌紅綿, 舌紅少苔",
    "心腎濕火證": "唇舌赤腫, 眠差, 溲短赤熱, 心煩惡熱, 脈沉數, 舌苦薄黃, 發熱不退, 寒少熱多, 口苦, 口乾不喜飲, 日輕夜重, 面垢, 燥裂, 目赤唇紅, 胸腹灼熱如焚, 經水不應期而驟至",
    "脾胃濕火證": "噁心, 腹滿腹痛, 喜動惡靜, 脈沉實, 目黃而赤, 面微赤, 中見黑點, 溲短赤澀, 胸腹灼熱, 大便初硬後溏, 小便徹黃, 渴而喜飲, 汗多, 懦細數, 黃燥, 但熱不寒, 氣粗煩喘, 目赤, 渴欲飲水, 中脘按之微痛不硬, 脈洪數, 心煩惡熱, 夜不能眠,面目俱赤, 苔芒刺, 脘悶, 大便不解, 苔黃厚膩稍乾, 齒燥, 嘔逆, 熱後汗多不解, 口臭, 口乾, 大便熱瀉, 唇焦齒燥, 溺赤, 胸滿痞, 食指與小拇指有麻感, 耳聾, 口苦, 口燥咽乾, 甚或大堅而長, 便秘, 唇焦, 舌苔黃膩帶灰, 四肢痛而沉重, 發熱午後尤重,雙下肢關節痛, 多敗漿色溏糞",
    "肺胃燥火證": "坐臥不安, 徹夜咳嗽不休, 腹脹痛拒按, 舌紅, 大便秘結不通, 苔黃燥, 左脈小實, 胸膺板悶, 心煩, 痰多痰粘, 唇焦煩渴, 大汗淋漓, 胸膈灼熱, 胃脘拒按, 面色紅赤, 口腔潰瘍, 苦難名狀, 小便短澀而赤, 氣促, 脈象細數, 氣逼, 腹滿不大便, 大煩渴, 夜不安寐,氣粗聲高, 少腹熱灼如焚, 咳嗽頻繁, 大熱, 尿短赤極臭, 脘腹灼熱, 至下午尤甚, 大便秘結, 起刺, 目赤, 渴欲飲水, 大便閉結, 咽喉腫痛, 咳嗆乾咳, 脈弦而數有力, 煩躁不安, 右脈沉伏而數, 日晡益甚, 脈盡伏, 咳嗽氣逆不能合自, 赤斑周身如錦文, 喉間痰鳴, 輕度鼻煽, 身熱灼手, 胸痛脘悶, 黃糙中心部黑燥而厚, 舌苔邊黃, 便秘, 口苦唇赤",
    "胃腸燥火證": "申酉潮熱, 小便不利, 張目不眠, 腹脹日加, 全腹均有壓痛及反跳痛, 口渴不思飲, 繞臍作痛, 堅硬拒按, 手足汗, 黃赤短數, 咽部不適,舌黃燥起刺, 脈弦滑數有力, 大渴引飲, 頭痛始劈, 大便不通, 黑刺, 惡熱煩躁, 脈沉有力, 口渴引飲, 舌苔黃乾, 大便膠閉, 無排氣排便, 喘冒不得臥, 脈沈實右滑, 心下痛滿, 腹中轉矢氣, 咽於",
    "脾胃燥火證": "口唇黏膜潰瘍, 口氣臭味, 大便偏乾, 咽喉乾痛, 脈細數, 唇鼻生瘡, 咽部及扁桃腺潰瘍多處, 舌體潰瘍, 脘腹微脹, 低熱, 齦肉疼痛, 牙齦周圍紅腫, 便乾, 舌尖, 口微苦, 口燥而熱, 牙齦紅腫疼痛, 苔薄黃膩, 齦腫齒衄, 稍食辛辣之品疼痛更甚, 周圍充血水腫, 口黏膩略有臭氣, 口乾口渴, 且有假膜覆蓋, 煩躁煩熱不眠, 大便秘結, 尿微黃, 便秘, 牙宜出血, 口舌潰爛生瘡, 舌紅邊有齒印, 尿黃赤黃澀,心中時熱, 目赤唇裂, 上下唇反覆腫脹破潰口臭流涎, 舌體腫脹",
    "膽胃燥火證": "頭痛, 胸悶作惡, 煩躁不安, 胸脅痛, 寒熱如瘧, 大便秘結不通, 苔黃燥, 咳嗽多痰, 右脅脹痛, 口渴口乾而苦, 尿赤短少, 熱則妄言, 脈右浮滑, 脘脅痞悶, 熱多寒少, 脈弦數, 午後壯熱, 黑燥, 兩太陽痛, 脈弦數而促, 寒熱往來, 大便秘結, 便秘, 舌苔黃燥, 默默不欲食, 腹脹, 寒則戰慄, 汗出熱減舌象",
    "心胃燥火證": "大熱不退, 口燥但欲漱水不欲咽, 苔黃帶黑, 煩躁不安, 口舌及口唇生口瘡, 散在如米粒, 白星, 大便未解, 心煩, 頭痛項強, 嘔吐, 牙齦潰瘍,綾, 左部數, 氣粗煩躁, 疼痛時哭, 口乾渴, 舌深綹, 脈弦數, 脈大而數, 口舌水泡破潰流血水疼痛, 大熱大渴, 舌紅起刺或紅星, 面紅赤, 衄血, 汗多, 下痢黃水, 唇紅, 便秘, 唇焦, 目赤, 苔色灰厚, 舌尖露絳, 目紅, 脈滑數有力, 夜熱轉盛, 六脈滑數無力, 舌紅少苔, 渴引冷飲",
    "心肝燥火證": "遍體赤斑, 小便赤澀, 唇乾, 舌苔尖紅黑, 舌邊有瘀點, 苔黃燥, 思涼飲, 舌質紫綛, 煩渴飲冷, 苔黃白膩, 脈數, 面紅目赤唇紅, 脈數而軟, 苔黃, 小便黃短, 舌紅或紫暗, 夜躁不寐, 嘔血如汁, 舌綛光乾裂, 便血, 齒縫出血, 夜躁, 兩目色紅, 鼻流衄血, 關節疼痛, 光面舌, 身熱, 唇燥口渴, 全身無力肌肉疫痛, 煩躁不靜, 高燒不退, 邊紅中黑, 紅中帶黑點, 咯血, 脈弦細數, 脈弦而數, 吐衄, 或出血瘀",
    "心腎燥火證": "眠差, 口舌牙齦, 苔薄, 胸中煩躁, 舌紅, 頰粘膜潰瘍, 時發狂笑, 脈細, 血尿, 舌紅苔黃, 舌赤少津, 滑數, 夜寐不安, 尿頻尿痛, 口渴, 口乾舌燥, 心煩懊儂, 兩額烘熱, 紫斑",
    "肺腎燥火證": "消渴, 弦大而澀, 脈沉數, 小便不利, 小便少, 舌光絳無液, 脈小數, 小溲赤熱, 唇焦齒燥, 喘急, 喜飲不食, 肌熱口乾,便秘, 無尿, 口乾不欲食, 胸滿, 便涮不爽, 咳痰黏, 兩層深紫若胭脂, 夜不安睡, 脈弦而數",
    "肝膽燥火證": "大小便皆不利, 耳中疼痛, 隱澀難開, 白星翳疊出, 黑珠有浮翳膜, 舌紅, 全頭脹痛, 目始紅腫, 口渴多飲, 舌紅苔黃, 牽引頭痛, 洪大鼓指, 腦顱欲裂, 太陽痛, 面目紅赤如醉酒狀, 大便時乾時稀, 發熱煩躁, 兩太陽穴經脈怒張, 頭目眩暈, 乳突觸痛, 小便黃赤, 耳廓潰瘍流膿, 頭目嗆悶, 苔少, 口苦咽乾, 波及頸顳, 便秘, 弦數有力, 目赤, 時欲飲冷, 紅腫灼痛",
    "肝肺燥火證": "左脅隱痛, 急躁易怒, 頻呼胸中悶熱如焚, 頭脹, 苔黃而乾, 呼吸氣粗, 鼻乾口燥欲飲, 煩躁易怒, 大便乾燥, 動則氣急, 逆上氣, 咳中帶血, 喜飲冷水, 夾有紫血塊, 小便黃短, 脈弦數, 胸痛脅脹, 邊尖深紅, 脈弦, 身熱, 兩脅作脹, 大量咯血不止, 胸悶不舒, 口渴,心情煩躁, 脈洪數有力, 脈弦大略數, 胸悶痛, 咳喘, 舌紅苔薄膩, 低熱, 口鼻皆嗆出鮮血, 口臭, 口乾, 口燥, 舌鮮紅, 面色赤如火燎, 面赤顴紅, 夜躁, 喉部有熱氣上沖感, 苔薄黃, 鮮紅紫暗相兼, 咯血如泉湧, 便秘, 煩躁不靜, 舌乾, 舌光紅, 口乾咽燥, 鼻衄, 脈弦細數, 舌紅綿",
    "肺胃鬱火證": "食少, 脈緊數, 咳痰多, 形寒足厥, 鼻乾不得眠, 噯氣, 目珠發脹, 胃脹, 熱以暮盛, 心煩, 惡寒, 身熱畏風, 腰腿疫痛, 弦長, 舌黃濁膩, 痰涎甚多, 口腔潰瘍, 溲黃, 目痛, 頭昏如蒙, 溺赤, 乾嘔, 口穢, 頭額痛, 脈微洪, 脈洪大, 發熱自汗, 便黑, 胸煩悶, 無汗, 口渴, 頭部兩側及兩眼外眥不定時灼痛, 懊悶少寐, 怕冷風, 氣逆",
    "脾胃鬱火證": "捫之灼手, 四肢特甚, 寐則頭與胸前大汗如漉, 肢節煩疼, 脈濡數, 熱如火燎, 四肢發熱, 頭脹痛, 晝夜不減, 脈數, 舌苔薄白, 邊紅, 口腔潰瘍, 長期低燒, 心悸, 口臭, 苔黃, 口渴飲冷, 太陽俱酸痛, 大痛引急如掣, 洪大, 口苦尿赤, 目中如有風吹狀,頭筋扛起, 苔膩, 自珠與眉棱",
    "心胃鬱火證": "舌苔白滑微黃或灰白, 胸部, 飢不能食, 時嘆息, 腹滿, 短氣, 心下結痛, 心窩苦悶",
    "肝膽鬱火證": "一身筋攣, 胸滿而痛, 耳聾, 口苦, 寒熱類瘧, 脅疼, 舌紫苔黃, 頭痛, 熱重寒輕, 欲嘔, 指頭冷, 納差, 舌暗苔黃, 目赤,手足乍溫乍冷, 脈左弦滑, 先冷後熱",
    "肝臟肺鬱火證": "苔薄, 飲而不多, 脈沉細帶數, 但痰色必有青黃稠濁如涕, 咳嗽嘔惡, 脈左關獨見浮弦且數舌象, 左胸前區憋悶, 或帶血, 或帶粉紅, 胸悶, 寒熱分爭, 惡風, 胸悶重, 口乾欲飲, 項背牽強, 舌質暗紅, 或薄或濃, 音爍, 胸肋滿痛, 氣喘吁籲而粗, 所見之痰",
    "心肝鬱火證": "月經按期量少, 頭目昏重, 雙乳作脹, 溲赤便秘, 煩躁不安, 脈弦數滑, 脈細數, 雙腿抖顫難以自控, 舌質邊紅苔薄膩, 舌尖紅赤, 脈細, 心煩, 肢體抖顫, 寒熱似瘧, 發熱口苦, 煩躁, 戚太息, 昏沉, 小溲不暢, 脈象弦細, 心胸煩悶, 手足心熱, 煩躁不寧, 心煩易怒, 苔黃, 夜戚寐多夢, 不飢不食, 夢寐失寧, 胸脅痞悶, 潮熱, 脈弦, 情志抑鬱, 經淨而反量多不淨, 面色青白, 苔膩, 苔白",
    "肝胃鬱火證": "耳鳴, 舌淡嫩, 弦數, 頭痛脹熱, 口苦口乾, 脈細數, 舌赤苔黃, 脈浮滑者, 脘痛連脅, 煩躁易怒, 脘中劇痛不可按, 或微黃, 近煙火尤甚, 胸脘作痛, 時欲嘔, 偏頭痛反覆發作, 每延及頭巔及項部, 耳鳴如潮, 目紅發癢, 苔黃, 口千苦, 噁心嘔吐, 有腥臭,脈弦數有力, 大便乾結, 小便黃赤, 鼻塞涕出黃稠量多, 呈持續性抽痛, 發熱而渴, 目眩, 苔薄白, 吞酸嘈雜, 嘔吐清水或酸水",
    "肝脾鬱火證": "四肢苦煩熱, 脈弦數, 耳聾, 頭暈, 咽乾口苦, 頭痛, 熱退復熱, 苔薄黃, 寒熱, 腹痛, 小便短赤, 喜冷飲, 胸脅痛, 身熱自汗",
    "心肺虛火證": "失眠, 而兩寸尤甚, 大便乾結, 入夜不知睡眠, 小便黃赤, 脈弦細數不靜, 若有神靈, 口苦, 苔略黃, 虛煩不耐, 徹夜不眠, 苔白膩, 時說胡話, 頭痛, 莫可名狀, 脈細, 心煩, 焦躁, 脈滑, 不眠, 微有薄苔",
    "心肝虛火證": "耳鳴, 失眠多夢易驚, 心熱口渴, 易舉易洩, 煩躁不安, 舌紅, 難以任勞, 脈細數, 苔白膩, 脈細, 且微有薄苔脈象, 多言多笑, 心煩, 手足心灼熱, 心神不寧, 性情急躁, 脈細弦帶數, 耳鳴如潮, 苔黃, 舌紅質地偏紅, 面紅顴赤, 脈弦數, 口乾, 心悸怔忡驚悸, 夜難臥而出並不知不覺, 大便乾結, 小便黃赤, 口燥, 或多汗, 頭暈, 盜汗舌幹, 口齒乾燥, 舌尖紅, 舌乾而紅, 胸中煩熱, 晝則神思恍惚, 神倦舌象, 口乾嚥燥, 脈滑, 口渴",
    "心腎虛火證": "躁動, 骨蒸潮熱, 舌尖尤甚, 舌紅, 重按多疾, 耳鳴咽乾, 脛瘦, 夜臥驚丟, 少苔或無苔, 寢汗, 舌苔薄黃, 大便乾燥, 口乾舌燥, 心煩不寐, 心內煩熱, 口乾唇紅, 腰以下厥, 似寐非寐, 脈左寸細數, 寐即遺精, 苔少, 脈細稍數, 夜臥驚亂, 頭中火升, 怔忡不安, 神疲不支, 尤善忘事, 陽痿, 脈細數, 四心灼熱, 徹夜不眠, 神思恍惚, 口乾咽燥而不欲飲, 五心灼熱, 長期間歇低熱, 脈弦細而數, 冷寒冷徹骨, 忽睡忽醒, 多夢汗出, 遺尿, 或夢中驚醒, 小溲短赤, 麻木, 癢如蟲行, 頭暈而眩, 赤, 中心少苔, 尤以舌尖赤而突出, 質紅, 反覆轉側, 盜汗, 小便餘瀝, 頭目昏蒙, 光紅無苔, 左寸獨旺, 無苔, 舌質色綹, 腰酸腰痛, 夢遺, 舌紅少苔",
    "脾胃虛火證": "胃中灼熱, 常呈淡黃色稀糊狀, 大便結, 身熱高達39.5℃, 食下不久即感胃中灼熱, 白帶多淋漓, 小便短少, 唇紅而乾燥, 舌紅苔黃, 大便不實, 右部稍弦, 飲冷則舒, 紅邊苔白黃而膩, 脈遲而右部稍弦, 手足心熱, 久熱不退, 舌根苔微黃膩, 結如羊矢, 完穀不化, 飢時尤甚, 大便素溏, 素體瘦弱, 噯氣吞酸, 頭暈, 頭痛, 神疲肢倦, 晨起胃脘有氣包突起, 身熱而煩, 小便黃熱, 或渴不止,腸鳴腹脹, 便秘, 通身皮膚灼熱, 人暮煩擾不寧, 稍睡即醒, 腹脹, 人暮較甚, 脈洪大, 尿少色黃而臊甚, 洩瀉, 便溏, 久瀉不止",
    "肝膽虛火證": "煩渴, 脈象弦數, 午後寒熱往來, 日晡發熱, 起於晡後, 舌紅, 譫語, 寐不安, 發熱惡寒, 色鮮舌象, 舌淡紅, 神疲, 下血, 手足心熱, 經轉先期, 心悸, 喜漱水不欲咽, 色黑黏稠, 脈弦數, 左關見動, 少神, 心悸心煩, 腹部疼痛, 耳聾, 色澤鮮紅, 頭汗至頸, 頭痛, 大便不暢, 似狂非狂, 夜躁, 流產流血不止, 口苦咽乾, 面黃, 潮熱, 尚有形寒, 量多如崩, 小便稍黃, 煩躁不靜, 質地黏, 午夜口乾,而不惡寒, 口乾不渴, 脈沉澀, 胸脅脹滿, 熱甚於暮, 胸脅翳悶",
    "肝胃虛火證": "脈象弦數, 氣升欬逆, 吵雜燒灼, 熱灼發熱不退, 脈細數, 舌赤, 噯氣泛酸, 大便不暢, 口乾味苦, 虛數無力, 苔薄黃, 脘中燒灼熱辣疼痛, 心中懊儂, 唇赤, 心中煩躁易怒, 舌紅少苔, 舌紅綿, 渴面多飲, 痛勢急迫",
    "肝脾虛火證": "脈細弱, 目於澀, 日晡發熱, 倦怠乏力, 咳嗽痰稠, 畏熱汗出, 色紫暗而有塊, 或如蠅頭, 面蒼白而浮, 經期7~10天, 脈弦細略數, 性急易怒, 寐少夢多, 脈弦細數無力, 苔薄, 午後潮熱, 納少腹脹, 尖有紅刺, 手抖, 大便乾結, 神疲體倦, 頭暈, 遇勞則眩,舌淡舌胖暗有齒印, 或如蚊跡, 苔薄白, 而不惡寒, 邊尖紅苔白, 納旺易飢, 鼻衄齒衄, 舌淡, 形瘦色萎, 微渴,脈象緩細, 脈細數弱, 面目黃浮, 氣短, 月經錯後, 經前後頭頂痛, 舌苔淡黃, 心悸, 口乾, 細數, 不思納谷, 心悸心煩, 口苦, 夜眠不安, 苔薄淨, 苔白中黃膩, 便不成形, 小便稍黃, 下肢有散在性瘀斑, 胸脅翳悶, 自汗盜汗",
    "肝肺虛火證": "掌心發熱, 舌紅, 咳痰稠, 心煩, 多則咳吐數十口鮮紅挾有血塊, 舌綛尖有紅刺, 時有低熱, 面浮神疲, 脈虛弦, 午後潮熱, 脈弦數, 腰瘦腿軟, 大便乾結, 咳血不止, 經血點滴不至, 舌少津, 口渴, 自覺氣從少腹上沖, 舌質淡紅, 舌綛苔微黃, 面容消瘦, 形瘦色萎, 脈細數, 凜寒潮熱, 每日少則痰中帶血, 脈細, 右胸隱痛, 舌淡胖, 右脅脹痛, 肝區作脹, 頭眩心悸, 經行吐血, 脈弦數有力, 不思納谷, 顴紅頰赤, 咳血, 即咳吐血, 胸脅刺痛, 咳痰不爽, 口苦, 舌苔黃乾, 盜汗, 夜躁, 苔薄黃, 發熱心, 煩躁不靜, 口乾嚥燥, 咯血, 脈弦細數",
    "肝腎虛火證": "耳鳴, 關節疫痛, 舌紅無苔脈象, 滿身疼痛, 脈沉細數, 胸脅痛, 舌紅, 臉頰潮紅, 腰胯疫楚, 足脛亦熱, 脈細無力, 一時厥逆, 舌燥唇焦, 且口水甚多, 咽喉乾燥, 口乾燥, 轉側不利, 常夜寐不安, 兩側太陽穴頭痛, 夜寐遺精, 舌純紅起刺, 口唇乾燥, 常便秘, 夜寐身重, 口千而喜熱飲, 耳鳴如潮, 身半以下畏寒, 苔薄, 足心熱, 午後發熱, 細數, 尿後白濁, 夜間發熱, 口燥咽乾, 心煩眠差, 頭昏耳鳴, 日間則涼, 唇紅, 潮熱, 耳聾齒枯, 腰痛, 脈弦細數, 苔淨, 舌苔尖紅根紫, 足心灼熱",
    "肺腎虛火證": "眠差, 頭暈體倦, 失眠, 疲倦, 渴不多飲, 舌紅, 脈細數, 夜則發熱面赤, 唇口殷紅, 入夜不知睡眠, 口舌乾燥, 徹夜不眠, 汗多, 咽乾灼熱,午後益甚, 夜寐不安, 左脅痛如針刺, 腰疫肢怠, 不眠, 脈緩, 手足心熱, 舌紅少苔",
    "肺胃氣鬱證": "胸膺塞不舒, 苦難名狀, 食人尤甚, 胸背脹悶, 呃逆, 失音, 咳嗽胸悶, 嘔逆不止, 似脹非脹, 似痛非痛, 似悶非悶",
    "脾氣氣鬱證": "痛時隆起作脹, 吐酸燒心, 脘脅痞滿, 脈澀, 氣閉則疼痛, 反胃噯氣, 納差, 噯噫矢氣則痛稍快, 胸悶重, 痛而脹滿得矢氣則痛減, 嘔逆, 胃多氣隱隱作痛, 胃脘脹痛胃脘上下作痛, 泛吐清水, 苔黃, 腹滿作脹, 左胸前區憋悶, 胸中氣塞, 胸悶, 苔薄膩, 關脈弦, 時太息, 脈弦, 食後更甚, 滿腹走注疼痛, 痛止則平而無跡, 脈沉弦, 走竄不定, 脈緩, 痛連脘腹",
    "肝膽氣鬱證": "脅迫時脹, 胸脅亦感脹痛, 善太息, 腋下疼痛, 經將臨期, 脘腹隱痛, 噯氣, 痛不可按, 脘悶, 或咳, 呼吸不利, 舌苔薄白, 食納欠馨, 引及肩背, 上下走竄無定, 脈弦數, 噯氣吞酸, 發則由少腹上沖胸痛, 少腹痛上下不定, 有時作脹, 小腹隱隱脹痛不舒, 經後則痛止, 脈象沉弦, 經前則小腹脹痛, 乳房作脹, 泛惡, 苔膩, 脈左弦, 牽引及脅部, 弦滑脈細弦, 痛而下墜, 身心不快",
    "肝胃氣鬱證": "心下痞, 胸臆相引得噯則寬, 痛時隱隱悶結, 脘脹, 脘脅痞滿時欲嘆息, 納呆不思飲食",
    "肝脾氣鬱證": "胃脘作痛, 氣上逆則嘔, 乾咳, 脈沉細澀, 腹脹滿痛, 腸鳴不斷, 脅脘脹悶, 痛連胸脅, 納差, 噯氣不舒, 脘腹脹痛, 有時便秘, 嘔逆, 脈弦澀間見, 脈細弦, 胸悶噯氣, 牽連胸脅, 上吐涎沫, 嘔吐頻作, 噯氣則舒, 胸悶嗞悶, 苔薄膩, 下注則腹痛, 舌苔厚膩微黃, 下洩腹痛",
    "肝肺氣鬱證": "胸悶咳嗽, 胸肋阻痛, 欬逆, 脈弦滑而數大, 胸脅阻痛",
    "肝腎氣鬱證": "小便不行, 脈搏不暢, 胸腔作脹, 小腹膜脹引腰而痛, 腹滿引背快怏然, 小腹滿膨脹左側更甚, 腰中走注疼痛, 腹部覺脹, 忽聚忽散, 小便頻數, 動作痛甚, 脈弦急, 乳房結塊, 腰痛, 量少窘急",
    "心肺氣瘀證": "舌胖苔薄膩, 四肢麻木, 有冷汗出, 脈細帶數(88次/分), 脈細弦滑, 面色較暗, 時有結代, 舌質偏紫苔白薄膩, 胸悶痛,左胸區憋悶, 早搏頻繁, 胸悶, 心前區時感悶痛, 脈沉澀而短, 重時延至頸背, 氣短, 胸悶重, 痛引左肩, 心悸, 舌質紫黯",
    "肝膽氣瘀證": "兩脅脹痛, 面容少華, 腹脹更甚, 不排精, 刺痛不移, 苔白膩, 色紫暗而有塊, 夜間尤甚, 月經來潮, 塊下痛減, 白膩, 突然下血量多, 舌紅有瘀點, 下腹脹痛, 沉默不語, 形體消瘦, 血行不暢, 苔薄, 少腹痛墜, 惡露甚少, 色紫暗成塊, 汗出頗多, 苔薄膩, 少腹拒按, 經來量少難下, 周身困倦不適, 痛劇拒按, 口乾目眩, 經閉不行, 性急煩躁易怒, 時有紫色小血塊, 兩乳作脹, 脈濡弱,臍周圍疼痛, 胸脅脹悶, 形寒發熱, 產後腹痛拒按, 納食不香, 舌苔薄白, 胸脅脹滿不休, 少腹時痛, 腰腹脹痛甚劇, 右上腹痛, 胸脘痞悶, 脘腹劇痛, 少腹脹痛, 時太息, 舌邊有瘀斑, 精神抑鬱不樂, 脈沉弦, 脈沉澀, 淋漓不斷, 脈弦澀, 中脘滿悶, 舌質紫黯",
    "肝胃氣瘀證": "口渴於苦, 胃痛似有物頂, 噁心, 嘔血, 出血後症反減, 胸悶氣, 其血必紫成塊, 脈小滑, 脈必帶澀, 胸脅作痛, 嘔吐酸苦水, 嘈雜似飢, 噯氣, 痞滿, 胸悶難堪, 腹痛, 口中血腥氣, 納差, 脈細遲, 紫黑血塊, 胃脘脹, 先見胸脅疼痛發悶, 痰血, 苔黃, 口淡無咪,舌邊紫, 胃脘脹痛, 胸中氣塞, 咽梗, 苔薄膩, 舌苔白膩, 脈弦, 兩脈沉而有力, 苔膩, 脈弦急, 舌悶不舒, 氣逆",
    "肝脾氣瘀證": "重者有嘔吐者不能進食, 少腹隱痛, 臍週脹悶疼痛, 脈弦滑, 面色晦暗, 舌紅, 得矢氣則脹痛消失, 痛如針刺, 夜間尤甚, 咖啡色, 疼痛日久, 痛有定處, 腹痛洩瀉, 臍上有條索狀塊物, 紅色, 上腹疼痛, 苔薄, 脘痛串脅, 夜間加劇, 身體羸瘦, 臍腹右側疼如刀割, 呈咖啡色, 少腹疼痛, 多呈間歇性, 嘔吐物如山楂水樣, 尿皆呈黃紅色, 大腹脹滿最為痛苦, 舌苔白膩, 腹脹, 舌質青紫, 舌邊瘀斑, 苔白, 痛連脘腹, 疼痛時非常劇烈, 舌質暗紅, 腹痛時發, 脹痛在左脅痛如刀割",
    "心肝氣瘀證": "稍勞則心絞痛發作, 臥不安, 胸脅隱痛, 煩滿短氣, 促, 四肢麻木, 脈細弦滑, 胸悶噝氣隱痛, 臂內肘腕一線痛, 結代交替, 四肢麻木, 下肢浮腫胸疼, 下肢浮腫胸痛, 氣短, 不耐勞累, 心悸(夜間尤甚), 呼吸困難, 舌胖苔薄膩, 舌苔薄白質暗, 脈細帶數(88次/分), 舌偏紫苔白薄膩, 時有結代, 轉側若刀錐之刺, 謙悶, 左胸前區憋悶, 面色略暗, 舌淡青, 苔薄膩, 脈弦, 目幹羞明, 腹脹, 早搏心慌, 脈澀小, 左肩臂痛",
    "肝肺氣瘀證": "耳鳴, 咳嗽, 體倦納差, 上肢活動掣引痛, 耳聾, 腫塊性硬壓痛, 胸肋關節及肋軟骨部位隆起, 胸痛徹背, 氣喘不能臥, 脈弦略數, 舌紅苔白, 噯氣吐酸, 耳鳴如潮",
    "肝腎氣瘀證": "舌質暗紅少苔, 月經突然閉止, 月經每天下午發熱, 脈弦滑, 量少色紫帶有血塊, 頭暈目眩, 苔白膩, 脈細, 經行每每期, 兩乳脹痛, 舌質紫暗, 胸悶重, 腰部刺痛, 舌暗, 兩尺數滑, 腰痛如折, 脈象細澀, 苔薄, 小腹脹墜, 脈形澀小, 六脈脈沉澀而細, 左胸前區憋悶, 小腹脹痛, 夜不安寐, 胸悶, 心悸煩躁, 脈弦, 腰背疼痛, 少腹疼痛拒按, 舌苔白薄, 經淨後發熱自愈, 苔白, 經閉不行, 脈弦澀",
    "肺胃氣痰證": "咳, 渴喜熱飲, 胸膈刺痛, 喉中痰鳴, 噫氣, 時發眩暈, 短氣, 氣喘, 呃逆, 脈右糊滯, 善噫, 胸脘痞滿, 苔白滑膩, 中脘痞阻, 舌滑, 食物自噎即出, 多痰",
    "肝肺氣痰證": "舌質淡紅, 舌苔黃糙, 上氣, 善太息, 脈濡軟, 喘急, 咳引脅痛, 苔白膩, 咳嗽氣逆, 或如梅核, 飲食少進, 胸悶重, 胃痛牽引胸脅, 苔黃膩兼黑如楊梅色少津, 痞滿痰壅, 右弦滑舌象, 左關沉小帶弦, 咳嗽, 右胸脅突然劇痛, 咯之不出, 脈滑數而浮, 左胸區憋悶, 脅痛, 呃逆不止, 胸悶, 左脅不時攻痛, 苔薄白, 喉中如破絮, 咽之不下, 神氣漸昏, 甚則厥逆, 喜熱湯, 脈寸浮滑, 關尺沉滑微數",
    "肝胃氣痰證": "兩脅脹滿, 氣從胃膈上沖咽, 面帶苦憂, 苔白膩, 胸脘作痛, 下及少腹攻注疼痛, 有水聲, 舌淡紅, 飲食甚少, 舌苔薄膩,噫氣不除, 呃逆, 脅痛, 飲食格格不納, 脘痛引背, 脈小弦, 脈弦, 胃氣上沖胸脅, 食人片刻即吐, 暮食朝吐, 犯上, 苔薄白, 吐出宿食為大量清水, 脘腹作痛, 胃脘脹痛連脅, 背部酸痛, 舌質胖, 脈弦滑, 或朝食暮吐, 脈細數, 心情抑鬱, 吐後可得緩解, 晚上尤甚, 胸膈滿悶, 食人即吐, 苦白厚, 苔白膩滑, 噯氣頻頻, 聲短頻響, 弦結, 泛酸噯氣則舒, 噁心嘔吐, 舌苔黃膩, 氣味酸臭, 上腹脹痛, 胸悶脘痞, 自覺有氣由胃脘上沖至腦而散, 嘔逆不已, 臉色蒼白, 怕冷喜睡, 喜熱飲, 脈沉弦, 脈象糯滑, 嘔吐清水或酸水",
    "肝脾氣痰證": "睡眠差, 噫氣, 舌質正紅, 頭脹, 頭昏目眩, 胸脘脅痛, 大便日行數次, 胸部不適, 腹痛, 脈沉弦遲, 納差, 口淡, 小便黃, 得矢氣較舒, 胸悶太息, 苦薄黃, 溲黃, 睡眠不實, 脹悶不舒, 咽喉不舒暢, 咳嗽有痰, 噁心嘔吐, 喳氣厭食, 小便黃赤, 脈濡滑, 脈形細弦而帶數, 漸有阻塞之象, 苔薄白帶穢, 泛酸吐痰涎, 便秘, 腹脹, 便溏, 潮熱少汗",
    "心肺氣痰證": "癱軟無力, 心動悸, 舌胖苔薄膩, 乏力, 發則汗出肢厥, 脈細帶數(88次/分), 左胸前區憋悶, 苔白膩, 畏寒, 心胸悶亂心悸,兼結代, 胸悶, 咳嗽痰多胸堵塞感, 胃痛牽至心區及背, 顏面蒼白, 心中痞塞, 胸痛徹背, 腹脹, 胸悶重, 胸滿悶時痛, 脈細弦, 脈浮滑",
    "心肝氣痰證": "舌質淡紅, 少食, 晝日明了, 悲傷欲哭, 反應遲鈍, 或高聲大笑, 面色蒼白, 哭喊驚恐, 苔白膩略厚, 苔白膩而厚, 胸腹痞悶, 嘔惡不舒, 嗜睡, 心中懊儂, 脈象濡細, 脈弦緊, 舌質淡, 暮則發作, 表情呆滯憂鬱",
    "肝膽氣火證": "弦數, 右脅不舒, 口苦目赤, 胸中懊儂, 脈數實, 兩脅時而刺痛, 舌黃, 脅痛, 嘔吐臭穢, 胃脘嘈雜泛酸, 心腹刺酸吐出, 痞滿,吞酸, 面赤身熱, 喜冷畏熱, 脘脅痛或作或止, 便秘溺赤, 或結於左脅之下, 胸脅脹滿, 口燥唇焦, 口渴, 嘔逆酸苦",
    "肝胃氣火證": "頻頻噯氣, 形寒肢冷, 反酸, 便閉, 脈弦滑, 脈數實, 水口泛苦水, 其痛或作或止, 苔白膩, 食則作惡, 舌苔薄黃, 脘腹疼痛陣發, 中脘隱痛, 少寐多夢, 不思食, 咽乾, 大便艱, 苔黃, 胸部吵雜, 脘脅痛, 飯後腹脹微痛, 人口即吐, 舌黃, 呃逆, 口苦, 便秘腹瀉交替出現, 痞脹, 心悸而煩, 細弦, 喜冷畏熱, 左脈弦數, 便秘溺赤, 小便短赤, 脈弦急, 口燥唇焦, 嘔吐酸, 有壓痛喜暖熨",
    "肝脾氣火證": "脈兩關弦細, 喜寒惡熱, 盤臍作痛, 胃不痛而脹, 有後重, 腹中急痛, 舌紅, 左關脈洪數, 沉數, 噯氣, 痛不耐按, 大便夾黏液, 腹痛腹熱, 發熱惡寒, 苔黃膩, 大便不通, 時作時止, 脈弦洪",
    "肝肺氣火證": "苔薄, 痰中帶血咳血, 飲而不多, 吞嚥時微痛, 氣上逆作痛, 得飲後咽痛暫時緩解, 微咳, 胸中敞口, 痰粘, 如乾茅草梗於喉間, 脈弦, 鬱怒胸悶, 兩脅引痛, 常因情志不遂而加劇, 口乾欲飲, 欬逆上氣, 舌質暗紅, 喉中乾痛",
    "肝腎寒瘀證": "經期少腹脹痛, 苔厚膩, 脈細弱, 發涼麻木, 下肢嚴重腫脹, 疼痛隱隱, 少腹疼痛劇烈, 局部有小結節, 遇寒則增劇發熱頭痛乏力, 觸痛明顯, 手足指趾麻痛腫脹, 膚色蒼白或暗紫, 甚至刺痛, 脈細弦, 不能持久, 足底肌肉萎縮, 苔薄, 皮膚光亮而色紫黯, 兩腰僂廢, 乃至汗出嘔吐, 顏面及四肢麻木加重, 鼻尖, 脈細弦而緊, 趺陽, 苔薄白膩微黃, 少腹部有下垂脹滿感, 身體暴露部位, 細澀, 色黯, 足踝部上下腫脹, 大小魚際肌萎縮,苔薄白膩, 不能起立, 腓腸肌發硬, 噁心納差, 苔白, 下肢腫脹疼痛劇烈, 太諫脈微弱, 劇則昏厥, 呼痛不止, 手不可按, 舌淡, 在寒冷環境下, 臥床徹夜痛叫, 臂腫痛, 甚則痛不能寐, 滿腹作脹, 全身肌肉關節痛, 四肢間歇性發生皮下結節, 腳痛時輕時重, 腰板硬, 舌質胖嫩, 走路腿腳疫脹麻木, 膚色暗褐, 臉色蒼白或萎黃, 抽痛發熱, 小腹悶痛, 舌紅苔白中夾黃, 發生青紫, 脅肋乳房酸脹, 面色白, 足背暗褐不榮, 局部足背動脈無法觸及, 出血多則腹痛減, 腰部及小腹脹痛, 有齒痕, 痛如刀刺, 苔薄黃, 或帶紫色, 脈象沉弦, 耳翼等處, 指趾甲殘脫不全, 甚則極微細, 如手足指(趾), 脈滑數, 或摸不到, 脈弦澀, 患肢發冷, 左脅時疼, 舌質紫黯",
    "肝胃寒瘀證": "汗出漆漆, 旁及兩脅, 脘腹時覺跳動, 脈濡軟, 平素喜暖, 吞酸多, 脈遲弱, 脈細, 脈搏反覆發作, 午後則劇, 胃脘疼如刺如絞,舌青苔薄膩, 脈遲細而短, 黃昏則甚, 神疲, 四肢欠溫, 有時刺痛欲厥, 苔黃, 右側腹痛陣作, 苔薄黃少津, 乏力, 大便溏結不一, 觸按則甚, 苔薄膩, 脈弦, 食後痛加, 久痛部位不移, 子夜痛甚, 晝夜不已, 舌淡苔白, 苔膩, 噫氣連連, 舌質暗淡, 脈弦緊, 脈緩, 按之稍減",
    "肝脾寒瘀證": "舌質暗, 面色晦暗, 小腹冷痛, 全身有僵硬感, 畏寒尤以背部為甚, 疼痛隱隱, 塊下痛減, 腹痛, 痛甚則大便, 兩少腹亦有大片棕色斑塊, 得熱則痛減, 臉部麻木, 腰酸, 多黑斑, 脈細澀, 腹痛陣發, 指趾冷麻, 舌質兩邊及口唇均有大片青紫色瘀斑, 形體消瘦, 脈細弦, 苔薄,少腹刺痛, 疲倦, 喜溫喜按, 經行腹痛, 手足發涼, 面色暗滯, 腰膝疫痛, 脈弦, 手足抽筋, 白帶多, 苔白, 便溏, 面色皖白, 關節疫痛, 舌淡, 脈沉遲而澀, 下肢輕度浮腫, 手觸不溫, 四肢不溫, 疼痛得溫稍減, 頭昏頭痛, 大便多行, 形寒怯冷, 月經錯後, 色紫黑成塊狀, 舌有瘀斑, 脘腹疼痛, 苔光, 色淡量少, 心悸氣短, 四肢厥冷, 脈沉緊, 肢體麻痺, 大便質軟夾黏腖, 經欲行而腹痛增劇",
    "心肝寒瘀證": "兩脅脹痛, 舌質黯苔薄白, 胸麻痺痛厥, 抑鬱不樂, 清晨六時左右發作, 脈細數, 手觸不溫, 噯氣, 肢厥, 脈沉澀或結代, 脈細, 指趾腫脹, 畏寒怕冷, 納差, 痛引肩臂, 面色紫暗, 神疲, 胸痛引背, 舌邊紫夾瘀斑, 痛有定處不移, 乏力, 紫癜紫暗點狀分佈, 面色乍紅乍白, 轉側若刀錐之刺, 脈遲緩, 手足發涼, 便溏溲清, 胸痛氣悶, 骨節疫楚, 脈弦, 胸中攻刺作痛, 遇寒則甚, 苔薄白, 納呆, 斑色紫紅, 脈緩帶澀",
    "肝肺寒瘀證": "頭頂而項背一直麻至兩踵, 夜不能眠, 腹不滿, 舌暗紅苔薄白, 疼痛隱隱然, 色紫暗, 鼻塞不通, 漸至眉梭骨痛, 痛如錐刺, 下午低燒, 其人終日昂首, 頭痛不止, 頭痛偏於左側, 脅痛右甚, 右側太陽穴悶脹, 右眼眶微紫, 對空調尤為敏感, 流白黏涕量多, 呈深在性鈍痛, 胸悶重, 脈細澀, 紅絲終處現紫色瘀點較明顯, 眼白珠紅絲較多, 其人言我滿, 口燥, 左胸前區憋悶, 察左, 唇痿舌青, 脈微大來遲, 不敢俯視, 前額及頂部呈刺痛感, 胸悶, 鼻甲腫大, 但欲漱水不欲咽, 苔薄白, 頭目暈眩, 欬逆, 胸滿",
    "心肺瘀熱證": "胸麻痺痛厥, 痰濃而臭, 苔少舌黯, 肢厥, 胸背有汗斑, 心跳心慌, 兩目紅絲, 左胸心區痛, 脈細澀, 痛有定處, 面色黧黑無華,心悸怔忡, 舌痛, 苔黃, 脈弦數, 舌裂, 尿黃, 兩足麻木, 大汗出, 苔膩, 舌紅燥, 皮膚甲錯, 痛時心慌, 神萎乏力, 口渴, 神萎, 怔忡不寧",
    "心肝瘀熱證": "衣不知熱, 噁心, 談笑自若, 急躁易怒, 雙眼隱隱現紅絲, 面色晦暗, 舌紅, 脈兩關均弦長, 頭痛如刺, 食不知味, 頭脹痛, 得涼則安, 脈數, 四肢發麻, 脈細澀, 吐血不止, 脈細弦, 舌邊有青紋, 脈弦數, 面部浮腫, 紅腫熱痛, 頭暈, 左胸前區憋悶, 項強肩背痛, 關節疼痛, 滑數, 頭覺有異物籠罩, 頭痛如裂, 思想不易集中, 齒衄, 舌質暗紅, 甚則穿破流膿, 眠差, 舌邊有紫斑, 面部潮紅, 口乾不欲飲, 頭頂劇痛, 下午頭痛如刀刺, 脈浮洪滑大, 眼眶周圍灰黑, 少腹脹疼, 徹夜不眠, 有瘀斑, 舌質紫紅, 舌紫而膩, 口咯紫血, 舌質深紅, 嘔吐, 鼻流血水, 神采飛揚, 灼熱紅腫, 舌質紫暗, 患肢劇痛腫脹, 胸悶重, 舌苔薄白, 劇時其痛如劈, 頭腦懵惜, 綾, 顏面色澤深綹,痛時兩足e紅而熱, 心悸, 苔黃, 兩足充血潮紅, 弦細數, 上午頭痛隱隱, 前額腫脹, 遇熱則甚, 胸悶, 苔薄黃, 四肢熱, 頭痛呈針扎樣,舌紫, 腫痛發燒, 鼻衄, 苔黃乾, 脈弦澀, 雙下肢浮腫疼痛",
    "肺胃瘀熱證": "懨懨衰倦, 甚則呼吸亦痛, 脅肋板欲痛, 聲嘶咽痛, 呼吸喉息有聲, 咳嗽帶紅, 乾咳, 咯嗆紫血, 胸脅悶痛, 脈浮而數",
    "胃腸瘀熱證": "煩渴, 腹部高度膨脹, 少腹堅痛, 午後寒熱, 胸中刺痛, 飲食不下, 脈微實, 有瀰漫性壓痛, 脈澀或數, 脈細澀, 反跳痛, 血後痛減, 寤寐不寧, 小腹赤斑, 鬱滯, 少腹硬滿, 既而但熱不寒, 飽悶, 煩滿, 少腹按痛, 但欲漱水不欲咽, 舌質幹紅, 吐血如湧,灼熱吵雜, 舌邊有紫斑, 脈弦滑, 煩躁不安, 脈沉細數, 舌赤, 痛不可按, 漱水不欲咽, 嘔吐酸苦痰沫, 臍下石堅, 色鮮紫相雜成塊, 產後3~4日惡露即止, 脈沉滑疾, 胸膈刺痛, 經停, 痛有定處不移, 大便燥結.大便不通, 目赤紫, 飲下作呃, 舌苔薄黃膩, 痛如刀刺, 口於燥而渴, 且拒痛, 至夜發熱, 大便色黑如墨, 少腹拘急脹滿, 舌紅邊瘀, 拒按, 胃痛嘈雜",
    "肝腎瘀熱證": "下腹脹滿, 脈沉滑而數, 腰背痛, 苔白膩, 如蒙灰塵, 頭重不舉, 小腹偏左痛引小腹, 脈左弦澀, 不敢俯仰, 小便灼熱赤澀, 中間一線無苔, 乳房發脹, 臉容黧黑, 脈弦數, 脈象細數, 腳脛在下午拘攣, 身重乏力, 舌紅邊有紫點, 帶下, 左尺細澀, 面黃, 舌苔長期如墨, 伴隨血塊, 質暗有瘀血斑點, 手不可近, 舌尖偏紅, 脈弦革, 眼中生花, 脅脹脘悶, 少腹痛而小便熱痛, 小腹裡急絞痛.串胯筋攣,苦薄, 脈澀, 暗晦不澤, 舌青, 輕則酸楚沉痛, 右細數, 小腹拘急, 舌苔白而暗, 重則狀如錐刺, 陰道頻流濁液, 舌苔兩邊淡黃,月經中斷, 色紫黯, 少腹及脅下疼痛如被杖, 並向陰莖放射, 舌苔白薄, 脈沉澀, 經期痛甚, 往來寒熱, 舌質紫黯",
    "肝胃瘀熱證": "脈沉弦而澀, 舌質暗, 大便瘀黑, 胸背拘束不遂, 譫語, 舌邊及舌尖夾紫, 吞酸, 胸脅下滿如結胸狀者, 反酸與喔氣, 納差, 舌苔白而暗, 身之側旁氣麻痺, 苔黃, 身體亦重, 脘腹疼痛, 脈弦數, 嘔血紫瘀, 脈遲, 如瘧狀, 發作有時, 口苦, 鬱滯, 少腹及脅下疼痛如被杖, 少腹滿痛, 身涼, 吵雜, 苔薄膩, 口膩, 往來寒熱, 手不可近, 灼熱痛",
    "肝脾瘀熱證": "皮膚紅斑, 經不調, 痛則大便, 脈弦細而澀, 肢指趾端紫紺, 閉經, 腹痛, 血塊甚多, 時有低熱, 口唇暗紫, 兩關弦, 經痛, 噯氣少食, 臍上有條索狀塊物, 瘀斑, 舌有瘀斑, 繼之成漏, 肝脾腫大, 少腹疼痛, 小腹脹痛, 兩脅痛, 呆痛不移, 痛則又下, 臥則腹墜, 便帶黏腖, 驟下如崩, 脈象兩寸微, 脘悶腹脹, 腹脹, 邊尖刺, 兩尺沉澀",
    "肝肺瘀熱證": "脘室, 舌紅兼紫, 短氣, 氣喘, 脅肋不適, 脈細, 唇燥咽乾, 經停不行, 胸悶重, 時有血絲, 胸脅串痛, 咳痰濃, 時粉紅色, 氣喘, 胸有重物壓迫感, 咳血, 左胸前區憋悶, 舌淡青, 逢寅卯時, 燥咳無痰, 汗多, 胸悶, 經前腰疫, 時咖啡色, 至天將明, 左沉弦澀, 脈右浮澀, 胸滿, 纏綿不止",
    "脾胃痰瘀證": "苔薄, 脈細弱, 飲食人口即吐, 舌苔白膩, 呃逆作止不常, 舌有裂紋, 胸中辣熱, 胃痛, 食則嘔吐, 脈弦澀, 泛酸頻頻, 其呃之氣自少腹上衝",
    "肺胃痰瘀證": "呼吸迫促, 胸悶呼吸不利, 數實脈反滑數, 咳聲不揚, 引背部, 久久吐膿如米粥者, 咳吐痰血有臭味, 苔濁厚實, 舌苔黑厚乾裂, 時出濁唾腥臭, 胸廓豐滿高出, 咳而胸滿, 胸憋痛, 氣短不足以息, 唇面紫紺, 口燥不欲飲水, 帶有血絲, 咽乾, 牽引背部, 欬逆倚息不得臥, 咯黃色膿痰, 小便黃赤, 餘部均弦數兼淌, 咽乾不渴, 胸痛, 便秘, 咳即胸中隱隱痛, 咯黃色膿臭痰, 兩寸微數",
    "膽胃痰瘀證": "大便偏乾燥, 右脅下絞痛, 噁心, 左關弦細, 略有咳嗽, 心前區陣發性絞痛, 舌質略淡, 胸感發憋氣短, 口苦, 牽引肩背及上腹掣痛, 脈象寸尺沉弱, 睡眠亦差, 指甲發青, 右關動數, 胸痛徹背, 疼劇時有大汗出, 後根苔薄穢膩",
    "肝腎痰瘀證": "面色不澤, 腰背疫痛, 六脈滑大無倫, 經水不下, 按之有硬塊, 婦候人宿有癥塊, 日輕夜重, 少腹膨滿, 腹大異常, 脈沉而澀, 按之堅實, 痛有定處, 少腹痛, 久則堅硬如石, 小腹有塊錐痛難忍",
    "肝胃痰瘀證": "懊儂難忍, 嘔血, 脈沉弦而澀, 著而不移, 質襯紫, 時有嘔吐, 脈細, 羸弱神疲, 面色晦滯, 時時作嘔, 脈細澀, 肢冷, 痞悶納呆, 吐水如蘇木汁, 苔白滑潤, 胃脘刺痛, 胸脅刺痛, 質胖青紫, 大便見黑糞, 胃脘脹滿, 胃反食則嘔吐, 泛酸頻頻, 脘痛疼痛頻繁劇烈, 吞酸噯氣, 脈弦, 頭汗淋漓舌象, 攻痛不止",
    "肝脾痰瘀證": "或欲吐不吐, 肢節木痛, 泛吐豬肝色涎沫, 臍腹絞痛, 骨節串疼腫痛, 舌邊瘀斑數處, 頭暈倦怠, 食不能下, 痛汗如珠, 下肢麻木不能屈伸, 胸膈滿悶, 舌邊暗, 肩背及手臂盡痛, 心中懊儂, 苔薄白, 食後腹鳴而痛, 手足牽引, 臍腹脹痛難忍, 脈緩, 脈弦澀或伏, 右少腹隆起, 得吐方適, 或欲瀉不瀉",
    "肝肺痰瘀證": "咳嗽, 咳甚時更覺氣短難續, 痰黃稠, 咯痰腥臭且多, 乏力, 尿不自禁, 膿痰濁血, 右肋下隱痛拒按, 脈澀, 咳喘大盛, 鼻竅掬動, 蘋塞不通, 胸脅板痛, 脈數, 右胸脅肋俱痛, 苔白, 咳聲重濁, 神疲, 痰韌成碗, 脅肋楚痛, 咳嗆吐血",
    "心肝痰瘀證": "夢語連篇, 舌苔薄, 頭暈目眩, 不欲食, 大便秘結不通, 脈細, 失眠多夢, 劇烈頭痛, 嗜睡, 邊有瘀點, 舌苔前半清, 後項板滯, 咯吐不爽, 後咯吐不爽, 後半濁膩, 胸悶脅痛, 雙目紅絲顯露, 喜咳吐涎沫, 神疲, 面色隱青, 喉間痰聲漉漉, 噁心嘔吐, 乏力, 煩亂不安, 寐多惡夢, 脈弦,脈沉弦, 脈滑, 脈象弦澀, 癲癇常發作, 體倦, 舌質暗紅, 舌質淡, 易疲乏",
    "脾胃濕痰證": "脈弦滑, 渴不多飲, 胃脘部脹痛不適, 心中滑澹欲吐, 胸脘痞悶, 胸脘部脹痛不適, 心中滑澹欲吐, 胸脘痞悶, 胸脘痞滿, 時吐酸水, 舌苔白膩, 不飢, 脈弦, 胸腹脹滿, 舌滑, 得辛熱而痛止, 不欲飲食, 脈象細弦",
    "肺胃濕痰證": "噁心, 身痛, 脈弦滑, 眼下色黑, 頭脹, 苔白膩, 身重或痛, 便溏溲赤, 寒熱似瘧, 脘悶痞滿, 脘痞腹脹, 寒熱模糊, 胸悶重, 飲食不進, 汗不暢達, 脈糊數, 咳嗽, 渴喜熱飲, 渴不多飲, 大發寒熱, 左胸前區憋悶, 脈遲緩, 脈寸關弦數, 胸悶, 脈弦滯, 胸脅滿痛, 不飢, 肢倦體疲, 胸痞, 泛惡, 發熱, 肢體若廢, 胸滿, 結澀, 懊儂煩, 氣喘而粗, 神鈍目呆",
    "肺脾濕痰證": "身重嗜臥, 舌苔白潤, 坐不得眠, 氣喘, 咳嗽痰多聲少, 脈細, 右寸關不調, 痰多色白, 氣逆痰多, 聲濁, 胸膈滿悶, 日漸消瘦, 痰白而稀, 舌苔白垢, 咳聲沉重, 獨寸沉而且滑, 痰隨, 腹痛便溏, 面黃, 苔白滑, 苔薄白膩, 口不作渴, 納谷減少, 脈滑, 欬逆, 痰白而黏, 脈緩",
    "膽胃濕痰證": "噁心, 昏迷, 脈弦滑, 脈弦而緊, 背寒, 熱時洪數, 嘔吐, 疲甚欲睡, 脈沉弦遲, 納差, 胸脅苦滿, 寒時脈沉弦, 胸悶重,頻唾清涎, 口渴引飲, 時時嘔惡, 苔灰膩, 反張上視, 面色蒼白, 左胸前區憋悶, 得汗而解, 寒去內外皆熱, 胸悶, 苔白滑膩, 苔白滑, 間日或三日一發, 繼則寒戰, 頭痛目眩, 苔淡黃而膩, 瘧來日晏, 始則肌膚栗起, 胸中痞結, 口乾喜暖飲",
    "心膽濕痰證": "不欲見人, 指天化地, 左關弦細, 輕則閉門獨坐, 納谷呆鈍, 劇則出外遊走, 苔白膩, 胸痛徹背牽引肩背, 悲傷欲哭或高聲大笑, 右關動數, 胸腹痞悶, 目直口呆, 幻想, 時時恐懼膽怯, 心中懊儂, 痛時大汗, 不食不寐, 坐臥不寧, 噁心有痰, 後根苔薄穢膩, 舌略淡, 脈寸尺沉弱, 不能作答, 舌淡苔中心黃膩, 大便三四天一行, 有異象惑, 脈沉弦有力, 厭油膩, 面色蒼白, 指甲發青,夜不安寐, 或獨言獨語, 胸悶發憋氣短, 嘔惡不舒, 或跪臥伏地, 脈滑脈弦, 及上腹掣痛, 多疑, 自覺腦部有片段歌聲(如東方紅等),時或無故悲泣, 心慌心悸",
    "肝脾濕痰證": "食少, 耳鳴, 苔厚膩, 噁心, 有時自覺有氣從少腹上沖至咽喉, 胸脘脹悶, 脈弦滑, 善太息, 視物搖搖欲墜, 心慌心悸脈象, 大便秘結不通, 目如蒙, 心下痞硬, 嘔吐, 失聰, 口苦舌乾, 胸悶重, 耳鳴如潮, 嘔吐頻作, 食人難化, 吐白黏痰, 左胸前區憋悶, 胸脘痞悶, 吐痰, 頭暈, 偶而作痛, 動多吐涎沫, 頭重如裹, 頭痛, 胸悶, 食慾不振, 大便秘結, 便秘, 胸悶咳嗽, 舌紅苔白, 腹脹, 如乘舟車之狀, 飲食不能人口, 脈滑數, 苔白厚濁膩, 臣床不能稍動, 視物旋轉",
    "脾腎濕痰證": "呵欠, 唇淡紫而潤, 氣促, 面部色素沉著, 苔白而潤, 脈細軟, 目暗, 手足痿軟, 端坐呼吸, 喉鳴咳聲高響, 脈遲緩, 舌偏淡, 面色蒼白, 轟熱起於臍下及脊背, 口泛膩痰酸腐, 心悸, 痰稠黏不易咯出, 肉胸",
    "肺胃熱痰證": "痰黃稠, 舌苔黃厚, 午後低熱, 脈象細滑, 胸脅痛, 舌紅, 舌苔白燥, 質偏紅, 咳喘, 心煩, 味臭, 嘔吐, 小便深黃, 口乾不思飲,大便乾燥, 口乾口臭, 痞悶, 舌苔薄白, 飲水嗆出, 喉麻痺, 五心煩熱, 胸膈不利, 胸滿胸痛, 鼻竅乾焦, 咳嗽, 苔黃, 口渴引飲, 五更咳甚, 脈弦數, 咯痰隨出隨阻, 右寸虛數, 脈右滑, 有聲不能音, 舌綛苔燥, 音噪, 汗多, 痰濁而多, 口燥咽乾, 苔黃膩, 發熱, 虛贏少氣, 苔膩, 乾咳少痰, 脈滑微數, 脈浮數, 脈滑數, 咳甚肋痛, 咽癢",
    "膽胃熱痰證": "大便結, 胸滿而悶, 脈弦滑, 舌紅, 舌苔黏膩, 氣喘, 脈濡數, 苔白膩, 喜熱飲而飲不多, 大便溏, 全身肢節疫痛, 口於而黏,嘔吐痰涎, 脈象細弦, 頭暈痛, 苔黃厚黏膩, 脈細滑有力, 脈浮數有力, 肢體疫困, 噁心泛噦, 頭汗出, 得汗而解, 夜躁, 寒熱往來,胸脅滿痛, 煩躁不靜, 胸痞, 發熱, 苔膩, 苔白, 寒熱間日而作, 寒則震戰, 熱多於寒, 小便短",
    "肝肺熱痰證": "舌紅, 脈細數, 形瘦, 顴赤, 脈沉細弦, 面赤, 右弱, 痰多黏沫, 滑而數, 五心煩熱, 舌紅潤苔微黃, 煩躁失眠, 若氣填膺, 咳嗽, 胸脅引痛, 苔黃, 苔薄, 脈弦數, 喘逆, 自咽至膈每感吵熱, 口苦舌象, 咳嗽少痰, 胸脘痞悶, 盜汗, 發熱, 苔膩, 咯血, 痰紅, 痰鳴, 氣逆",
    "肺胃痰火證": "頻呃, 捫之糙手, 鼻出熱氣, 火升少寐, 咽喉乾痛, 目紅唇赤, 舌苔白燥, 舌苔望之黃滑, 目如脫狀, 煩熱, 或白而黏, 舌燥, 胸脘不舒, 不得臥, 舌苔淡紅而鮮, 咳喘, 嘔吐, 寸微洪, 胸高氣喘, 食人即吐, 胸膈不利, 咳甚則吐, 脈軟數, 鼻準清冷,舌苔炱黑, 舌綿, 咳, 舌色金黃, 氣促, 舌尖綺根黃, 乾嘔, 痰黃而稠, 頭面浮腫, 右寸獨大, 或帶微白者, 痰黃氣粗, 咯黃氣口渴厚, 脈數糊滑, 口渴",
    "肝肺痰火證": "舌乾綿, 舌紅, 午後漸熱, 咽喉乾燥, 心累頭昏, 胸中咳悶, 晚上不能平臥, 咳痰黃稠厚, 咯.血量多, 痰難出, 苔黃厚, 而左關弦硬不和, 脈浮大而數, 形體枯瘦, 溲黃, 尖紅而痛, 雙足痿軟無力, 苔微黃, 口渴引飲, 脈滑大有力, 脈小數, 口乾不思飲食, 嗆則氣火上升, 咳血, 乾咳無痰, 口苦, 脅痛, 左弦細, 舌黃苔厚且黃, 左邊頭痛, 面黃, 胸脅滿痛, 脈弦, 身熱, 舌紅紫而乾, 咳嗆痰多白沫, 咽癢乾咳, 咳嗽氣粗, 脈洪數",
    "肝胃痰火證": "煩躁心悸, 晨起吐痰, 舌紅, 背惡寒, 時嘔酸液苦水, 大便秘結不通, 時手心熱, 眩昏驚悸失眠, 苔薄黃微膩, 面色灰不澤, 頭脹痛,目糊, 或先乾後溏, 朝食暮吐夾苦水, 兩目難開, 初則吐食物, 甚則胸背脹痛難受, 大便艱秘, 舌前紅根膩脈象, 小便黃赤, 脈細帶數, 心中煩熱, 繼則吐苦水, 記憶力減退, 頭痛, 口乾或口苦, 大便秘結, 脈弦, 舌體稍胖正紅, 苔膩, 苔白, 舌暗苔厚膩, 咽中作痛, 食後嘔吐食物痰涎酸水, 夜劇, 口乾不欲飲, 脈弦滑, 頭脹痛不已, 短氣, 脈細, 神疲肢軟, 苔黃厚, 小便黃, 善嘔, 溲黃, 臉色紅潤, 頭暈欲嘔, 脹悶不舒, 苔黃, 口苦舌燥, 脈沉弦數, 中腹痛拒按, 智力減退, 胃脘陣發性疼痛, 耳聾耳鳴, 便秘, 脈沉弦細滑, 欲捶打而後快, 目眩, 口舌潰爛",
    "心肺痰火證": "頭腫, 不食便閉, 脈形小滑, 夜不成寐, 欲飲涼水, 咳痰多, 咳喘痰黏氣臭, 寒熱, 狂妄譫語, 脘痞, 胸悶重, 心悸, 神識如迷,渴欲冷飲, 唇乾色淡, 心胸煩熱, 溺赤, 左胸前區憋悶, 胸突腹大, 頭痛, 大渴齒板燥裂, 胸悶, 舌苔白膩, 起坐無常, 咯吐稠痰色黃, 多笑難止, 煩渴引飲, 自言自語",
    "脾胃痰火證": "臍週疼痛, 噁心, 反酸, 腹脹疼, 痛時腹中攻竄, 脈小滑, 或大或小或痛或不痛, 苔黃白滑膩, 口乾苦不欲食辣, 大便不暢, 大便時結時溏, 舌苔黃白膩, 脘悶, 食後即吐, 夾有大量白色黏腖, 脈洪, 脈緩滑, 疲倦無力, 時升時降, 胸脘間有形作脹, 舌淡紅,口甜不知飢",
    "肺脾痰火證": "甚則見紅, 噁心, 胸滿脹, 苔黃白滑膩, 舌紅, 胸中腸中轆轆有聲, 大便秘結不通, 氣喘, 六脈洪數而滑, 鼻塞, 腹滿, 欬逆上氣, 苔薄, 呼吸困難, 大便乾結, 小便黃赤, 臉部浮腫, 吐稠痰, 頭暈, 吵雜, 大便秘結, 面紅唇紫, 苔膩, 胸悶不能食, 甚則嘔粘痰, 痰聲特甚, 胸痞不飢, 便溏, 口渴, 舌質暗紅, 聲曳如鋸, 不得臥, 咳嗽痰黃而厚, 嘔吐, 喘鳴迫塞, 兩旬不大便, 小便黃, 胸膈壅塞, 苔邊白中黃, 脘滿, 溲黃, 苔黃, 胸中煩滿, 口乾, 喉中有水雞聲, 口燥, 口苦, 語音不出, 便秘, 腹脹, 口乾咽燥, 頭目暈眩, 脈滑數, 小水淋澀",
    "心胃痰火證": "揚手擲足, 失眠, 笑罵不避親疏, 苔黑黃而厚, 脅肋牽痛, 入夜不知睡眠, 謾語, 徹夜不眠, 躁擾如狂, 舌紅苔黃厚糙, 痰韌性逆, 脈滑急, 痰鳴氣粗短促, 神糊如見鬼, 昏糊, 起坐如狂, 但言胸中似壓舌象, 心悸, 目睜手舞足蹈, 昏迷不醒, 痰不爽, 舌咳鮮紅, 語言不出, 數有力, 六脈沉實滑數, 燥起芒刺, 舌紅苔微黃, 不眠, 胸膈痞悶, 燥擾不寧",
    "心膽痰火證": "目定振栗, 弦滑, 驚悸, 語言謇澀, 心跳欲厥, 吐痰, 時疑時怯, 目瞑則夢弄髒, 驚駭, 咽喉若塞, 兀兀欲吐, 恐怯, 似若呆, 舌黃濁膩, 夢中恍惚, 神誌恍惚, 脈滑數, 口苦想嘔, 善忘",
    "心肝痰火證": "急躁易怒, 手足躁擾, 口目牽引, 舌紅, 盲語謇澀不利, 心煩, 頭暈頭痛, 夜不能寐, 舌體腫大, 活動失靈, 如見神鬼, 脈右弦滑, 臥床不起, 心跳, 脈弦數, 頭痛脹, 大便乾結, 甚至詈罵, 額汗肢冷, 面黃不華, 舌尖疼痛, 嘈雜, 鼓掌大笑, 驚悸不寧, 脈右寸浮滑, 左顧右盼, 兩目難張, 舌苔薄黃帶膩, 耳鳴, 眠差, 欲食冷飲, 頭眩嘔吐, 言舛而澀, 徹夜不眠, 呻吟錯語, 不能達意, 間有熱赤, 左虛散, 耳鳴如潮,體胖面赤, 妄言不休, 脈弦大略滑, 語出無倫, 顴紅唇朱, 脈弦帶滑, 煩躁不靜, 苔黃膩, 自覺內熱, 舌邊尖紅, 舌紅苔黃罩灰",
    "肝脾風痰證": "耳鳴, 手足麻木, 口乾不欲飲, 耳鳴之極, 語言不利, 脈小滑, 口眼歪斜, 倦怠乏力, 頭暈目眩, 嘔惡, 脈細, 舌無苔垢, 手足運動失靈, 口乾納呆食少, 肌肉蠕動, 脈緩滑, 口歪流涎, 胸悶重, 立則欲撲, 脈浮滑, 耳鳴如潮, 脈弦而滑, 苔薄, 心中動悸不寧, 懶言, 噁心欲吐, 發時嗜眠, 左胸前區憋悶, 頭重如裹, 脈濡滑, 吐出物似痰涎或未消化食物, 胸脅滿悶, 頭運劇烈, 胸悶, 震顫, 頭痛以兩側為主,苔白滑, 舌苔白膩, 脈弦, 面色不華, 自覺腦內鳴響, 肌膚不仁, 吐淨後痛遂止, 以頭頂為顯, 頭痛而重",
    "肝肺風痰證": "咳嗽痰多, 口眼歪斜, 面色晦暗, 抬頭屋轉眼見黑花, 活動穿衣均感艱難, 口舌麻木, 見物飛動, 呈撮口狀, 舌苔白, 脈沉細弦, 口唇發緊,腿足不仁, 卒然暈倒, 語不成句, 神情癡呆, 兩腮凹陷, 腿不能拾, 心悸, 右側肢體麻木, 右臂麻木, 納穀不香, 手不能舉, 神情淡漠, 頭目昏眩,脈弦滑數, 面曉白, 脅痛, 身體不能轉側, 舌尖紅, 脈弦細而滑, 胸悶, 四肢厥冷, 目眶發青, 頸項無力, 臉頰抽掣, 語言春澀, 手指腫脹攣縮伸不開, 脈緩, 肩關節疼痛, 舌本強硬",
    "肝胃風痰證": "噁心, 眉稜骨痛, 自覺皮膚燥熱, 咳嗽吐痰, 脈細滑數脈數, 如醉酒狀, 胸悶納呆, 噯噫惡氣, 胃脘隱痛不舒, 舌淡紅, 頭眩頭重, 頭臉部陣發性, 煩悶, 右胸脅突然劇痛, 劇烈的, 常突然發作, 關尺沉滑微微, 背部寒涼, 頭暈, 身熱不揚, 如楊梅色, 刀割樣疼痛, 苔薄黃苔黃, 眼眶及左側額顳部脹痛, 突然停止, 嘈雜欲吐不吐, 苔黃膩黑, 脈寸浮滑, 左耳失聰, 胃納不振, 少津",
    "心肝風痰證": "手足舞動, 手舞足蹈, 吐涎沫色青, 雙上肢關節伸直屈曲, 舌苔黃, 脈弦滑, 一日數發, 脈沉滑略數, 二便失禁, 拍床摸被, 兩手微暴, 神誌不清, 手足無力, 坐立不安, 上視或斜視, 不辨方向, 人夜不知睡眠, 扭轉, 不知便溺, 四肢亂動, 舌質紫暗, 苦笑無常, 雙下肢左右交替伸曲不停, 雙眼左右輪視, 頻頻點頭, 神情呆鈍, 兩拳緊握, 面青, 苔白膩糙, 不飢惡食, 身疲少言, 閉目似睡, 頭痛, 臥床亦不願起床, 胸脅滿悶,皺眉弄額, 方向不辨, 脈弦, 木呆不語, 小便尿床, 神呆語亂, 吐舌, 時躁怒, 霎眼",
    "肺脾虛痰證": "咳嗽, 口於, 氣促, 溺澀, 隨吐隨有, 咳嗽聲低, 食少羈瘦, 脈細數, 左胸前區憋悶, 苔白膩, 胸悶熱痛, 痰不止, 胸悶, 咽部不適, 脈細濡, 舌苔淡黃膩, 泡沫之痰雖不咳亦自喉中湧出, 便秘, 自汗惡風, 胸悶重, 動則喘息, 便溏, 面浮",
    "肺腎虛痰證": "苔薄, 喉中痰鳴, 上氣鬱悶, 痰多白沫, 咳嗽氣, 痰中有鹹味而黏厚, 脈弦滑, 口乾, 口燥, 氣喘, 左胸前區憋悶, 苔白膩, 胸悶, 咳痰不出, 口乾咽燥, 胸悶重, 痰雜血點, 痰中帶血",
    "脾腎虛痰證": "咳嗽, 胸滿腹脹, 小便不利, 兩足浮腫, 二便不利, 痰白黏, 胸悶心悸, 苔白膩, 脈浮大滑無力, 脈細, 周身乏力, 腹大脅痛, 脈弦, 唾多口乾, 腰酸, 咳喘早晚較重, 脈滑, 肢冷, 痰多味鹹",
    "脾胃水飲證": "渴能飲水, 噁心, 右脈沉滑, 怕冷, 噯氣, 腹中隱痛, 脈細, 畏寒怕冷, 消瘦, 納差, 腹中漉漉有聲, 煩悶, 心下悸, 時吐黃水,怯冷, 瀉而大渴, 畏寒, 吐清涎, 食後飽脹, 胃脘痛, 瀉水量多, 苔薄白, 動作水聲, 水下復瀉, 面色蒼白無華, 舌質淡",
    "肺胃水飲證": "身體疼痛, 小便不利, 天明漸止, 頭痛, 肢倦體瘦, 憎寒, 氣上沖喉咽不得息者, 六脈浮洪, 汗多不止, 右脈滑, 發熱向晚作甚, 胸中痞硬, 咳痰, 乍緊乍結, 心下煩滿, 鼻鳴, 惡風自汗, 咳嗽短氣, 飢不能食, 咳出青黃涕大如彈丸, 反多涎唾, 左脈遲, 下利日十餘行, 脈浮緊, 苔白滑, 頭項強痛, 手足厥冷, 翁翁發熱無汗, 胸中鬱痛, 使人揉按之, 身微痛, 心口如水, 重按豁然,自汗盜汗, 憎寒壯熱",
    "肺脾水飲證": "胸滿胸脹喘息, 幹無苔, 苔白膩, 脈沉遲, 胸脅苦悶, 夜間尤甚, 痰多色白, 上喘息高, 舌淡胖, 痰多清稀而多白沫, 脈弦細而疾, 咳聲重濁, 欬逆上氣, 咯大量黃黏痰, 面色紫黑, 短氣不得臥, 心悸, 倚息, 咳嗽, 苔厚白膩, 心下結滿, 面目及兩下肢浮腫, 苔滑, 小便短少脈象, 脈弦, 脈滑, 痰多而黏稠",
    "胃腸水飲證": "腸間濕有聲, 心下悸, 舌潤多津, 泛嘔不納, 嘔稀水, 脈弦滑數, 脈伏, 自覺有滿硬感, 自利反快, 嘔吐, 脘脅迫痛明顯,喘息不得臥, 腹脹, 心下堅滿, 脘脅痞結",
    "肝胃水飲證": "小便不利, 有震水音, 氣沖偏左, 厥逆, 嘔吐不止, 苔白膩, 嘔盡方適, 胸脅苦悶, 舌質嫩紅, 脘悶, 得食可緩, 腹痛, 神清疲乏,始則大量清水, 苔中厚濁而黃, 脈弦細緩, 飲水即嘔, 胃脘脹痛劇烈, 脈反沉弱, 脈細弦, 胸脅痞滿, 咳嗽, 口微幹, 上腹常有水聲漉漉, 胸中煩滿, 苦脅下痛, 口渴不能飲, 少腹作脹, 痛時泛酸, 欲嘔, 左尺脈重按不顯, 面黃, 繼為黃綠色苦水, 默默不欲食, 形容憔悴, 腹部脹滿, 不欲飲, 發熱無汗, 倦怠少氣, 獨右關錶弦而中滑",
    "肝脾水飲證": "聽力減退, 脈弦滑, 突發眩暈, 耳內不適, 面色晦暗, 自覺手足發冷, 手觸不溫, 四肢不溫, 腹痛作則欲瀉, 脈象沉細, 堵塞感甚, 納差, 睜眼, 腹中漉漉有聲, 舌苔薄白, 體倦乏力, 微痛, 翻身即要嘔吐, 吐涎沫, 浮腫心下逆滿, 日腹瀉2~3次, 手足發涼, 頭痛, 神情默然,脈弦, 瀉後痛略減而不止, 苔薄白, 舌質淡苔濕潤",
    "脾腎水飲證": "腰痛日重夜輕, 脈弦小, 脈弦滑, 腹脹食後更甚, 脈遲, 溺時灑然毛聳, 大便不實, 腸鳴漉漉, 甚則有石砂, 苔薄白, 莖中澀痛, 少腹冷感, 小便艱澀, 嘔渴腹冷",
    "心腎水飲證": "舌淡, 短氣, 兩關浮滑數結, 肢厥, 脈沈遲, 脈沉細弦, 倦怠無力, 晝夜不能人寐, 不能運動, 身為振振搖, 心中難受, 浮腫, 心悸, 夜臥感胸中痞塞, 苔薄白滑多涎, 苔薄, 脈兩關浮滑, 心下悸, 目不能張, 心下堅築, 面色蒼白, 舌尖紅, 脈沉緊, 胃脘憋悶, 尿少,苔白, 起則頭眩, 惡水不欲飲, 形寒, 心下逆滿",
    "肺腎水飲證": "身體疼痛, 腰痛尿少, 口乾不欲飲, 後及全身, 氣喘, 足腫而冷, 便溏溺短, 短氣乏力, 氣從小腹上沖至胸致陣咳, 沉細, 眼瞼腫甚, 惡風, 心悸胸悶, 腰酸, 脈浮緩, 惡寒肢厥, 咳嗽, 胸膈滿悶不適, 渴不多飲, 眼眶發黑, 緊, 面色蒼白, 腹大如鼓, 初起面目浮腫,頭痛, 脈沉弦而呈緊象, 發作時胸部不適, 神倦心煩, 舌苔白膩, 舌淡苔白, 陰囊腫如壺狀, 舌白滑兼淡灰, 腰痛, 無汗, 沉遲, 咽癢",
    "脾胃寒飲證": "食穀欲嘔, 小便不利, 背惡寒, 腹痛綿綿, 脈遲緊, 體倦神疲, 胃脘痞塞, 沉細, 苔灰白多津, 脘腹滿, 胸中覺冷, 時吐涎沫,完穀不止, 飲水即噦, 噯氣頻頻, 白滑而嫩, 泛吐清水, 胸室, 肢逆冷, 自利, 胸脘痞滿, 脈弦, 苔薄白, 脈沉弦, 胸滿, 舌淡中冷, 唾液津津, 得矢氣則痛可暫緩",
    "肺胃寒飲證": "上逆咳嗽, 汗大出不止, 口中熱, 背痛腰疼, 咳而微喘, 時泛吐清水, 胸膈滿悶, 惡風, 咳聲有力, 音啞不能出聲, 舌滑, 胸悶重,咳嗽, 飲而不多, 遍身疼痛, 背冷, 咽喉不利, 其人振振身劇, 口渴喜熱飲, 澀, 脈濡緩, 左胸前區憋悶, 鼻出清涕, 頭痛, 脈緊, 胸悶, 吐白色痰涎, 小水短, 沉弦, 欬逆胸滿, 聲音不揚, 形寒發熱無汗, 喉癢咳嗽, 惡水不欲飲, 目泣自出, 喘咳稀痰,胸滿短氣",
    "肺脾寒飲證": "肩痛, 脈沉弦而緊, 喉間如水雞聲, 腰背痛, 苔白膩, 不能平臥, 不得平臥, 納呆食少不便, 脈浮, 胸悶重, 鼻流清涕, 氣促, 脈沉細滑, 咳嗽痰稀, 左胸前區憋悶, 頭暈, 痰多泡沫, 頭痛, 口不渴, 胸悶, 形寒怕冷, 顏面浮腫, 舌淡苔白, 兩足冰冷, 哮喘痰鳴, 頭上有汗, 無汗, 夜間發作, 苦悶欲絕, 人冬加劇",
    "肝胃寒飲證": "無法進食, 背惡寒, 咳嗽吐痰, 心痛牽引背心及左肩亦痛, 胃脘不舒, 胸中謙悶, 舌暗淡邊有齒痕, 脈微弦, 脈弦, 胸中覺冷, 質淡苔薄白膩, 苔薄白, 食則脹痛, 胃脘劇痛, 食少腹脹",
    "脾腎寒飲證": "唇淡紫而潤, 咳吐白泡沫痰, 脈弦滑, 突發眩暈, 眼前昏黑, 苔白而潤, 端坐呼吸, 苔灰滑, 脈弦而遲, 睜眼則天旋地轉, 喜熱畏寒, 氣短, 唾液增多, 痰涎壅盛, 喜靜惡噪, 腹中漉漉如水聲舌象, 噁心嘔吐, 終日閉目而臥, 津津欲唾, 起則眩暈加劇, 脈遲緩, 頭眩眼花,蒼白, 苔白滑, 氣喘不能平臥, 脈弦, 兩尺不足",
    "肺腎寒飲證": "苔薄, 咯痰色白而稀, 呼吸困難, 舌淡, 面白唇紫, 腿無力, 左胸前區憋悶, 頭暈, 脈細, 不能平臥, 胸悶, 面黃, 脈沉, 痰咳氣急, 脈細痰, 舌有黑色瘀斑, 胸悶重, 脈滑, 苔白, 形寒畏冷, 神疲, 苔灰黑而滑潤, 夜間發作, 痰由黃膿轉白",
    "肝肺寒飲證": "氣喘發時氣不接續, 動則更甚, 咳嗽氣急, 頭痛, 甚於子夜, 心悸不安, 痰多如泡沫, 嘔吐, 胸滿不食, 苔膩脈象, 脈弦, 形寒發熱, 痛甚則嘔吐, 頭痛偏右",
    "肺胃飲熱證": "咯之不爽, 喉間痰聲漉漉, 音塞不揚, 面似虛浮, 脈弦滑, 胸中常悶, 咳嗽喉中燥痛或癢, 氣喘痰鳴, 而上氣, 右咳大於左, 不能平臥, 脈象沉弦, 痰多不利, 嗆咳, 苔薄白膩, 脈浮, 胸痞, 稀痰數日, 繼則痰濃咽乾, 脈洪數, 咳嗽氣急痰多, 咳嗽時連聲不止咳, 咽乾",
    "肝肺飲熱證": "臉部潮紅, 痰多色白而黏, 左脈芤數, 脈細, 咽部不適, 下午較甚, 舌暗苔黃, 右細數, 舌苔黃白, 口乾渴, 大便乾結, 咳血, 寒熱咳嗽,食慾不振, 痰黏稠, 胸痛, 發熱, 小便微黃, 苔薄白, 胸悶憋氣, 脈滑, 脈浮數, 胸悶時痛, 咳時尤劇舌象, 咳喘氣促",
    "肺腎飲熱證": "舌質暗, 胸悶難言, 倚息不得臥, 張口抬肩, 咳嗽痰多, 口苦口乾, 脈細數, 喘咳, 吐黃色稠痰, 喘咳不能平臥, 脈數, 自覺內熱, 口渴, 氣急, 苔薄微黃, 舌苔淡黃",
    "肺脾飲熱證": "氣喘, 胸悶而呼多吸少, 小便黃短, 大便難下, 喉間水雞之聲, 痰多難咯, 鼻涕黃稠, 苦不欲生, 舌赤, 聲音低沉, 面色晦滯, 腹脹而納食難下, 數, 煩躁難忍, 脅肋掣痛, 咽喉如阻, 口唇發紫, 口氣穢濁, 脈象弦細, 嘔吐清涎, 語言斷斷續續, 舌質淡而夾青",
    "肝脾飲熱證": "脈沉緩, 倚息不得臥, 口乾便秘, 大便秘結不通, 左胸前區憋悶, 晝輕夜重, 胸悶, 大便秘結, 哮喘發作, 便秘, 苔薄白, 腹滿, 胸悶重",
    "脾胃食滯證": "食少, 苔黃厚膩, 腹脹腹瀉, 大便穢臭, 氣粗, 胸腹痞滿, 口渴口臭, 嘔吐, 低熱, 噯腐吞酸, 納呆厭食, 噯氣頻頻, 完穀不化, 夜臥不安, 下午發熱, 手心熱, 舌苔白滑, 夜躁, 脘滿腹脹, 煩躁不靜, 不大便, 發熱, 脈滑, 矢氣時作, 中帶黃色, 舌苔厚膩, 脈滑數, 大便有不消化食物",
    "肺胃食滯證": "舌質淡紅, 喉中痰鳴, 惡寒發熱, 苔白厚, 噯氣, 色白量多, 頭痛, 胃脹, 惡食不納, 胸膈飽悶, 咳吐黏痰, 右關脈短滑,身體拘痛, 咳嗽頻頻, 或弦滑, 煩悶",
    "胃腸食滯證": "發熱不退, 舌黃尖起芒刺, 惡食, 煩躁不安, 大便乾結, 脈有力, 噯氣, 瀉多量少, 大便不暢, 喜熱飲, 腹脹硬, 矢氣頻頻, 小便結候短赤,時腹痛, 胃脘堵脹, 苔膩, 脈沉弦, 食後噁心, 苔白, 飽脹",
    "膽胃食滯證": "噫氣, 食即嘔逆, 舌淡, 怕冷, 畏寒怕冷, 腹痛, 噯腐吞酸, 大便不化, 舌苔白膩而厚, 怯冷, 惡食, 手足反涼, 頭痛, 脈右緊盛, 畏寒, 右大於左, 便洩, 面黃, 或黃厚而膩, 潮熱, 發熱夜甚, 胸滿, 脈滑數, 面色晦黑, 寒熱交作, 舌苔穢膩",
    "肝脾食滯證": "咳嗽有痰, 脈沉數, 怯冷, 苔黃膩而厚, 臍腹痛, 手足反涼, 怕冷, 大便不行, 腹時痛, 畏寒, 食慾不振, 面黃, 身熱持續不退, 畏寒怕冷, 小便短黃, 苔轉白膩, 脈沉澀, 不知飢, 無汗, 人夜尤甚, 嘔逆, 下午潮熱, 舌質淡",
    "胃腸積熱證": "苔黃, 燥渴, 自覺發熱, 大便乾結, 關脈實, 大便閉, 小短赤, 舌尖灰黑, 脈弦, 咽及扁桃體潰瘍多處, 口穢納呆, 大熱喘脹, 腹脹, 捫之腹堅脹而拒按, 苔膩, 舌尖潰瘍成片, 乾燥起刺, 心煩不寐, 下腹痞滿, 舌體腫脹, 咽喉紅腫",
    "膽胃蟲積證": "苔黃, 噁心, 或沉伏, 脈弦數, 右肩背及腰亦痛, 中脘飽悶不舒, 或黃白相間, 煩熱, 嘔吐酸苦, 脈細, 上腹部劇烈疼痛, 苔乾糙或黃或白, 頻繁嘔吐, 胸脅脹痛, 苔膩, 大便或秘或溏",
    "肝脾蟲積證": "脈細弱, 表情呆滯, 肌肉消瘦, 大便燥結, 面黃肌瘦, 低熱不清, 乾咳息促, 腹脹大露青筋, 毛髮焦枯, 臍週捫及蛔蟲纏結之條索狀物, 睡眠齙齒, 舌苔白厚, 夜臥不寧, 夜盲, 怕光, 精神極。, 腹瀉日久, 脈弦數, 煩哭不止, 目陷聲低, 眼角膜乾燥, 面黃, 手足枯細, 小便色黃, 舌幹, 面色無華, 臉部出現花白色斑, 頻尿, 頭髮稀疏, 舌質淡",
    "肺脾氣虛證": "形寒肢冷, 舌淡, 鼻流清涎, 倦怠少食, 面皖黃白, 痞滿, 苔根白膩, 脈細, 動則加重, 懶言少神, 痰濃而白, 聲低, 飲食少思, 每遇風寒便發作咳喘, 痰清, 舌體無榮, 咳嗽, 短氣不續, 動輒汗出, 脈虛而數, 少氣, 汗多, 苔薄白, 腹脹, 便溏",
    "肺衛氣虛證": "苔薄膩脈象, 濡, 面, 細弱, 乏力, 身酸痛, 舌紅, 脈虛浮, 腹中鳴響, 汗多, 盜汗, 倦怠, 惡風, 自覺冷風人侵並抽痛, 苔薄白,舌淡紅, 體倦, 神疲",
    "肺胃氣虛證": "苔薄膩, 奈差, 脈小滑, 疲倦無力, 大便不通, 面色蒼白, 乾咳, 氣息短促, 胸中不快, 脈微弱, 不思食",
    "心肺氣虛證": "心累, 咳嗽, 胸悶短氣, 乏力, 脈虛而結, 頭暈, 面色蒼白, 胸翳, 心跳間歇, 脈細, 汗多, 舌質淡暗, 夜睡不寧, 心神恍惚, 飲食減少, 苔薄白, 舌尖稍紅, 苔薄黃偏乾, 心悸, 精神萎靡, 久咳不止",
    "肝肺氣虛證": "心累, 咳嗽, 胸悶短氣, 乏力, 脈虛而結, 頭暈, 面色蒼白, 胸翳, 心跳間歇, 脈細, 汗多, 舌質淡暗, 夜睡不寧, 心神恍惚, 飲食減少, 苔薄白, 舌尖稍紅, 苔薄黃偏乾, 心悸, 精神萎靡, 久咳不止",
    "肺腎氣虛證": "咳嗽, 苔白潤, 咳聲低怯, 面色晦暗, 氣喘, 呼吸淺短難續, 感染較輕, 形寒汗出, 甚則張口抬肩, 脈沉細無力, 咳嗽、咳痰較少, 紫紺,痰如白沫, 咳吐不利, 舌淡或暗紫, 倚息不能平臥, 心悸, 胸滿短氣",
    "脾氣氣虛證": "腹鳴喜按, 噁心吐涎, 且量多勢暴如注, 形瘦骨立呼吸微弱, 久瀉瀉下完谷, 便頻糞稀, 吐食, 食少運遲, 乳食不思, 或大便不實, 脘悶, 瀉物青綠質稀如水, 神情困頓, 神倦乏力, 腹滿, 苔白嫩, 二便清利, 無華, 瀉次無度, 貪睡, 瀉如蠶豆花色綠, 倦怠嗜臥, 形體瘦弱, 臉色蒼白, 苔白滯, 面黃, 胃痛得暖得食則緩, 食後困頓思睡, 脈沉細無力, 不食, 洩瀉, 嘔惡不食, 露睛, 緩大,唇舌淡白, 舌頭淡白, 緩小無力, 極膩不化",
    "胃腸氣虛證": "洩時必欠而嘔, 面色白, 神疲色萎, 萎黃, 目而臥, 少納, 日數十行完穀不化, 下利不止, 苔白膩, 憔悴, 大便溏薄, 脈細,有里急後重感, 嘔而暈, 舌淡胖, 久瀉粘液",
    "心脾氣虛證": "呼吸急促, 倦怠乏力, 有特殊腥味, 失眠多夢易醒, 大便溏薄, 動則益甚, 舌淡紅, 虛而促, 形體消瘦, 面唇青紫, 驚悸, 瀉洩, 腰痛腿酸,目神呆鈍, 氣憋氣喘, 六脈虛弱無力, 面色蒼黃, 汗多, 面黃, 苔薄膩, 終日戚, 胸痛徹背, 夜寐不安, 多疑, 浮腫, 脈沉而結代,拉幹而動, 怕冷, 苔薄白而滑, 脈細, 頭暈頭眩, 失眠多夢, 畏寒怕冷, 少氣短氣, 心中空虛, 月經少而帶下多, 心悸, 食少納呆, 怯冷, 胸悶短氣, 語聲低細, 脈濡, 畏寒, 盜汗, 夜躁, 煩躁不靜, 腹脹, 默默少神, 脈大無力, 眼花, 精神萎靡",
    "心肝氣虛證": "狀若驚悸, 舌暗淡, 倦怠少神, 氣短善太息, 右脈大而無力, 驚艷, 面色較暗, 聞聲即驚, 頭腦昏沉, 言語失倫, 心下空豁, 納差, 心悸陣作, 神疲, 常常戲笑, 乏力, 面暗, 頭暈, 煩躁不寧不寐, 左寸脈必虛小, 目昏, 脈律不整, 腰酸膝軟, 脈沉細無力, 睡眠不安, 胸悶憋氣, 有時停跳感, 面色無華, 怔忡不寧",
    "心脾血虛證": "脈細弱, 嗜臥, 言語妄謬, 其人如痴, 頭眩目重, 脈沉細略弦, 舌淡紅, 鼻癢不已, 健忘, 脈空虛, 心悸怔忡, 心悸驚嚇, 恍惚, 奈呆食少, 有時徹夜不寐, 經行您期, 形體瘦弱, 頭暈, 邊有齒印, 脈澀無力, 脈細軟無神, 脈弦, 苔薄白, 便溏, 帶下赤白相兼, 舌質淡, 怔忡不寧, 脈象濡細帶數, 舌淡嫩, 頭垂目合, 苔薄白而滑, 脈細, 失眠多夢, 氣短, 少寐多夢, 飢則怔忡, 體瘦神疲,心悸, 氣怯懶言, 神怠困 , 體倦無力, 面色少華, 色淡量少, 面色淡白不澤, 盜汗, 夜躁, 忽寐忽醒, 緩緩, 煩躁不靜, 經行時間長, 困倦不起",
    "心肝血虛證": "呼吸短促, 睡眠差, 舌質淡少苔, 脈象沉弱, 脈細無力, 目幹, 舌質淡紅無苔, 短暫即止, 面色白無華, 神思恍惚, 心痛頻發, 脈結代, 失眠多夢, 心煩, 頭昏, 聲低氣短, 右脈虛數, 少寐, 右脈虛微, 健忘, 聞聲驚醒, 形體消瘦, 心悸怔忡, 精神疲倦, 至數模糊不清, 睡眠欠佳, 面及下肢時有浮腫, 攣急, 右關濡數, 頭暈, 食慾不振, 左關弦勁, 人寐汗出, 若有所失, 腰痛, 唇舌淡白",
    "肝腎血虛證": "四肢拘攣, 經血量少, 甚至一現輒淨, 舌苔淨少, 色黑, 一月一行, 麻木不仁, 腰酸, 形體虛羸, 提前或落後, 目昏不明, 手指麻木, 精神萎頓, 聲低息短, 脅下筋急, 苔薄, 經行錯亂, 脈象澀弱, 或二月一行, 少氣懶言, 僅發於食指中指, 腰痛抽掣, 活動不利, 食慾不振, 顏面蒼白, 量較多, 腰間酸軟痛楚",
    "肺胃陰虛證": "吞之若不能續, 咳嗆, 日晡發熱, 舌紅, 倦怠乏力, 聲音低沉, 足背浮腫, 中有黃苔, 氣欲喘急, 氣怯, 時吐白沫如米粥, 提之若不能升, 苔薄, 脈數而虛, 脈弦數, 肌熱於午後, 五心多熱, 左胸前區憋悶, 咽喉燥癢, 咽痛音啞, 食慾不振, 惶惶然若氣欲斷,唇咽乾燥, 為咳為喘, 咳甚於夜間, 口吐涎沫, 脈細數, 咳唾鼻流清涕, 咳嗽時咯血, 右寸偏大, 甚則語言難出, 飢不欲食,胸悶重, 苔黃, 皮毛焦枯, 喘息少氣, 口乾, 咳血, 面色少華, 口燥, 行動數武, 內熱頭痛, 喘則汗出, 脈濡滑數, 胸悶, 舌邊紅, 音聲不揚, 口乾嚥燥, 脈左搏堅",
    "心肺陰虛證": "胸口壓迫感, 眠差, 脈虛細, 煩熱痰咳, 舌紅, 乾咳, 脈弦細遲, 或可記憶, 面腫, 邊有瘀點, 脈虛大或微細, 遇事答應不周,或不可記憶, 有裂痕, 偶見結代, 日漸消瘦, 質淡紅, 脈數, 胸悶重, 健忘, 手足心熱, 心悸怔忡, 舌苔薄淨, 易自汗出, 夜難成寐, 驚悸, 乏力, 心煩神亂, 左胸前區憋悶, 口舌乾燥, 夜不安寐, 心悸而煩, 怔忡不寐, 胸悶, 口燥咽乾, 心情不定, 脈細數而澀促, 胸悶氣短, 咯血, 心煩夜咯血, 心煩夜咯甚, 舌質淡",
    "肝肺陰虛證": "午後低熱, 舌紅, 心煩口乾, 乾咳, 頭痛偏左, 咽部不適, 時而作痛, 乾燥隱痛, 咳嗽痰少, 痰中帶血, 手足心熱, 胃納減少, 苔薄質綹, 甚則巨口咯出, 自汗漆漆, 咽常似有物阻塞, 汗出不能左臥, 舌淨, 或帶血絲, 精神不振, 大便乾結, 面部浮腫, 頭暈, 左胸前區憋悶, 心慌心煩眠, 久咳聲啞, 脈浮大, 咽中熱衝即作嗆咳, 體質消瘦, 顴部殷紅, 吵雜易飢, 久咳灼熱自汗, 質偏紅, 短氣, 舌燥, 小便黃少, 咽喉乾燥, 脈細, 咳痰黏著難出, 不易咯出, 胸悶重, 咳血, 咯吐鮮血, 盜汗, 胸悶, 苔薄黃, 鮮紫不一, 目眩, 其色粉紅, 兩脈細數, 作癢咳嗽, 舌紅少苔, 痰色暗紅",
    "肺腎陰虛證": "吞之若不能續, 脈左弦疾, 午後低熱, 肌肉消瘦, 咳血聲啞, 咽乾口燥, 舌紅, 灼熱疼痛, 頰赤, 背寒, 脈象虛數, 心悸少寐, 舌焦, 脈濡數, 汗多口渴, 口於不欲多飲, 夜間尤甚, 甚則有汗, 舌綿燥無苔, 納差, 大便乾燥, 提之若不能升, 夜間汗出, 臨晚寒熱,舌燥口渴, 咳嗽痰少, 唾血鮮紅, 五心煩熱, 舌紅苔淡白, 四肢瘦軟, 夜有盜汗, 舌幹苔白, 脈沉數, 咯痰黏白, 脈弦數, 舌體較小, 右浮洪而尺搏指, 心煩眠差, 潮熱, 惶惶然若氣欲斷, 發熱, 苔膩, 咳嗽上氣, 大便閉結, 脈微數, 痰紅, 乏力倦怠, 痰夾紅絲, 耳鳴, 脈細數, 咽喉乾燥, 脈細, 步履艱難, 晝輕夜劇, 遺精, 舌苔薄白, 低熱久熱, 二便艱澀, 時煩躁, 耳鳴如潮, 兩足腫痛, 喘息少氣, 咳嗽作嗆, 形槁毛枯, 咳喘痰稠, 細數, 胸部悶痛, 欬逆氣短, 寸口獨弱, 口苦, 咽破失音, 虛弱骨蒸, 心悸氣短, 喘則汗出, 盜汗, 喘息, 尿少灼熱, 舌無苔, 皮膚發斑, 舌紅苔花剝, 口唇紅赤, 腰痛, 舌紅少苔, 臨晚潮熱",
    "脾胃陰虛證": "唇舌乾燥, 納差, 大便燥結, 脈細數, 甚則乾嘔, 呃逆, 口渴, 面色潮紅, 舌紅少苔",
    "肺脾陰虛證": "低熱達38℃, 痰黏如絲透明, 眠差, 汗自出, 骨蒸潮熱, 口角糜爛, 夜咳尤甚, 舌紅, 二便不多, 終日嗜睡, 頭髮乾枯, 舌偏紅, 脈細, 奈差, 動則氣急, 面色枯, 脈虛弦數, 舌淡紅, 大便乾結難下, 面皮萎黃, 夜煩少寐, 舌質光絳裂痕, 口乾, 咳血, 肌肉瘦脫,脈虛數無力, 口苦, 失音, 頭暈, 苔少, 盜汗, 神疲倦怠無力, 寐則汗出, 面色無華, 尿少, 欬逆",
    "心脾陰虛證": "身體枯變, 睡眠差, 頭暈, 邊有齒印, 脈細, 汗多, 舌質淡紅而淨, 面黃, 手震, 脈律不整, 形寒怕冷, 消瘦, 氣短, 納差, 怔仲, 舌淡暗, 四肢發麻, 疲倦, 多, 心悸, 口中發渴, 脈象浮弱",
    "肝胃陰虛證": "痛則汗出無力, 失眠, 煩悶心煩, 舌紅, 低熱逗留, 神疲形瘦色萎, 口苦燥渴, 脈左弦細, 脅腹疼痛, 心煩, 舌紅無苔, 倦怠無力, 口咽髮乾, 消瘦, 不欲飲食, 汗少, 噝氣矢氣甚少, 右則弦滑, 胃熱如烙, 神疲, 嘈雜胃痛, 苔薄, 午後潮熱, 舌裂, 大便乾結, 弦大無力, 舌尖紅, 光剝而燥, 大便先堅後溏, 雖食則胃脘發脹, 胸脅滿悶, 嘈雜, 夜寐不安, 苔膩, 不飢不飽, 精神困乏, 不眠, 眠差,耳鳴, 花剝, 入夜不知睡眠, 舌燥, 徹夜不眠, 食後胃脹痛, 胃痛噁心, 舌光紅無苔, 胸脘脅痛, 脈弦細而數, 頭昏, 低燒, 嘈雜似飢而不能納食, 食後脘腹作脹, 性情急躁, 舌光紅如錦, 咽乾, 耳鳴如潮, 氣上沖, 紅絳少苔, 口乾, 面色白, 小便赤黃, 大便反溏,人夜痛甚, 口燥, 口苦, 肝脾腫大且痛, 舌紅綿無苔無津, 脘中攻撐, 胃脘痞脹, 盜汗, 夜睡而夢遺, 滿悶痞脹, 唇紅, 飲食日減, 甘溫香燥病情加重, 大便不爽, 腹脹, 口乾咽燥, 食則痛甚, 小便赤黃尿頻, 不能食, 脈弦細數, 胃脘疼痛作脹, 尿紅少苔, 便舌紅少苔, 便舌結, 形體蒼瘦",
    "肝脾陰虛證": "肝區悶痛, 脈細弱, 脈細勁, 失眠, 舌質淡紅而光, 間或作痛, 不欲食, 怠速, 偏頭痛, 消瘦, 小便短黃, 口渴舌幹, 腹痛洩瀉, 津乾少苔, 形體消瘦, 腹痛腸鳴, 大便乾結, 口唇乾, 大便堅實為多, 納穀不馨, 面紅唇紅發皺, 脈弦, 飢則頭眩, 脘部疼痛痞脹, 不眠,尤其於舌根部, 眠差, 耳鳴, 肢體無力, 舌苔薄, 午後為甚, 入夜不知睡眠, 徹夜不眠, 勞動多汗, 脈細, 目瞀花, 納少神疲, 而痛不為瀉減,舌苔微黃而厚, 低熱, 心悸, 耳鳴如潮, 右脅掣痛, 口臭, 口乾, 神倦體困, 口燥, 口苦, 善飢, 質紅, 飽則脹滿, 胸腹脹悶, 口燥咽乾, 肌熱, 舌光紅, 口乾咽燥, 苔薄黃於, 脈弦細數, 舌綛色暗",
    "肝腎陰虛證": "腿軟, 易被激惹, 舌苔黃, 舌紅, 小便短少, 反應活躍, 牙齦出血, 血脂紊亂, 腹水, 大便乾硬, 唇紫, 面色晦滯, 易怒, 時或鼻衄, 視疲勞,腹大脹滿, 腰酸, 苔少或光剝, 體重減輕, 神疲, 口乾而燥, 抑鬱, 乏力, 口乾, 焦慮, 自主活動增加, 絳少津, 口燥, 小便發黃, 苔少, 尿黃, 心煩眠差, 或見青筋暴露, 喜冷畏熱, 肝硬化, 口乾咽燥, 體倦, 脈弦細數, 舌體暗無光澤, 舌苔稍偏黃",
    "肺脾陽虛證": "痰清白難出, 小便數, 脈滑數無力, 脈沉細弱, 舌淡, 苔白而厚膩, 鼻塞不通, 或盜汗, 肢體困倦, 咳色低微, 苔白膩, 苔白而厚膩, 鼻塞不通, 或盜汗, 肢體困倦, 咳色低微, 苔白膩, 苔白而厚膩, 鼻塞不通, 脈咳遲, 不渴, 惡寒, 日2~3行, 倦怠無力, 感受寒冷, 或食生冷之物, 微細, 眼胞浮腫, 遺尿, 神疲, 青黃, 涕如水, 心腹冷痛, 脈虛大, 胸脅逆滿牽引背痛, 少氣, 四肢逆冷, 脈濡, 脈虛浮, 流清, 頭暈, 多涎唾吐涎沫, 頻頻咳嗽, 腹中拘急, 噴嚏頻作, 口唇青紫, 汗多, 根略黃, 食慾不振, 面黃, 頭目暈眩, 大便溏瀉, 則洩瀉尤甚",
    "肺衛陽虛證": "形寒肢冷, 面色虛, 怯冷, 脈虛而稍浮, 身冷如水, 撓後微有血痕, 脈遲, 怕冷, 面色蒼白, 畏寒, 兩脛自冷, 疹塊, 淡白, 畏寒怕冷, 腰以上有汗, 舌淡苔白, 身困酸楚, 身疼重, 遍布全身, 冷汗自出, 腰髖弛痛",
    "心肺陽虛證": "唇乾眠差, 張口抬肩, 額汗淋漓, 頭昏跌僕, 怕冷, 脈沉細結代, 尺脈不至, 畏寒怕冷, 稍活動而突發胸悶氣逼, 氣短, 早搏出現頻繁, 心煩難寐, 語音低怯, 臥床不起, 心悸怔忡, 精神萎頓, 喘促, 怯冷, 汗出淋漓, 面白唇紺, 畏寒, 夢寐驚悸, 頭暈如旋, 脈大而虛緩無力, 脈遲結代, 胸悶憋氣, 心慌心跳, 唇舌淡白, 舌淡白",
    "肺腎陽虛證": "脈虛細, 四末發涼, 食減, 小便不利, 形寒蜷縮, 背惡寒, 動則喘促, 懶於舉動, 眼瞼輕度浮腫, 大便多溏, 納差, 舌質紫暗,精神萎頓, 下肢腫, 顏面灰不澤, 手足欠溫, 口唇紫暗, 咳嗽, 胸滿氣喘, 脈沉弱, 舌胖嫩, 舌紫滯, 痰白黏, 動則短氣, 喘促以夜間為多, 面青晦暗, 身倦短氣, 脈沉細無力, 面色不華, 苔薄白, 舌質淡, 重按若無",
    "脾胃陽虛證": "泛吐清水, 呃聲低長無力, 手觸不溫, 四肢不溫, 手足發涼, 大便溏薄, 脈細, 脈沉, 喜暖喜按, 苔薄白, 脘腹不舒, 舌質淡, 氣不得續, 食少乏力",
    "胃腸陽虛證": "小便不利, 濡小, 或如死豬肝, 不進食, 舌淡舌潤無苔, 洩瀉不覺, 六脈沉遲, 大便有血水粘液, 下利不止, 肢厥, 脈細, 下利稀水, 口不渴飲, 脈微細, 腹痛, 下利雜色, 或五色雜下, 滑脫不禁, 五更洩瀉, 下如魚腦或膠腖, 便膿血, 紫色而光, 腹冷腸鳴, 下痢無度, 或下如鴨溏, 身體瘦削",
    "心脾陽虛證": "活動後加甚, 脈虛澀特甚, 心悸怔仲, 心下悸欲得按者, 舌嫩苔白膩, 大便不實, 脈至數不調, 納差, 昏沉困倦, 筋脈拘急,胸悶重, 肢冷, 舌質紫氣, 時驚悸囈語, 神疲, 脈來細弱, 心悸, 乏力, 左胸前區憋悶, 夜不安寐, 口淡不渴, 胸悶, 脈沈遲無力, 面黃, 大便溏洩, 稍有畏寒, 舌胖而嫩, 四至一代, 舌淡少華, 又手自冒心, 言語無力",
    "肝脾陽虛證": "腹冷喜暖, 神困乏力, 兩足微腫, 全身疼痛, 脈沉細略數, 寒熱如瘧, 脈細, 失眠多夢, 時痛時脹, 飲食減少, 脈細弦遲, 形體消瘦,頭暈欲嘔, 低熱不揚, 耳鳴耳聾, 氣短吸微, 汗出心悸, 行經時大便溏瀉, 蜷縮臥床上, 大便清稀, 面黃, 兩足麻木, 脈沉, 面色青白, 苔薄白,厥冷, 口乾不渴, 頭脹痛, 舌淡",
    "脾腎陽虛證": "胃酸倒流, 畏寒肢冷, 糞便粒數增加, 負重游泳時間減少, 易疲勞, 脘腹痞滿, 脈細, 大便洩瀉, 喜食熱飲, 腹痛欲瀉瀉後痛減, 腸鳴, 舌淡胖, 握力降低, 黏液膿血便, 形體肥胖, 舌苔薄白, 腰酸, 抑鬱, 浮腫, 腰膝酸痛, 焦慮, 腹脹腹痛, 甚或四肢厥冷, 肛門降低, 進食減少, 小溲黃赤, 食慾不振, 脈沉, 飲水量增加, 可見四肢不溫, 小便清長, 肛門墜脹",
    "肝腎陽虛證": "脈細弱, 痛時喜手按摩, 小腹冷痛, 腰亦酸痛, 苔白稍滑, 沉重乏力, 腰酸, 健忘, 四肢欠溫, 尺脈沉遲, 帶下清淡, 舌淡胖嫩, 腰脊強痛不運, 腰膝酸軟, 記憶力減退, 其痛悠悠, 頭暈腦脹, 頭痛, 怯怯少氣, 舌淡暗或紫, 苔白滑, 脈沉軟, 陽痿, 唇淡或紫, 耳鳴, 小便清利, 怕冷, 失眠多夢, 畏寒怕冷, 寒在骨髓, 遺精, 右側臀部, 頭痛從巔頂連及前額, 冷劇時, 脈沉弱, 膝軟, 怯冷, 兩尺尤甚, 腿足痿軟無力, 脊膂腰髀痿墜酸痛, 畏寒, 心悸氣短, 不耐遠行久立, 脅肋不舒, 神衰力弱, 脈虛細, 體力日衰, 得溫輕減, 喜手按摩, 見風如直人腦戶, 舌偏淡, 夜尿多, 寒從背起, 脈來遲弱, 形胖色曉, 神疲氣短, 精神疲倦, 腰酸背痛, 渾身戰苦, 陰莖或陰囊, 頭暈, 邊有齒印, 腰亦冷, 苔薄白, 語言低微, 脈微遲緩, 脊痛起於骶部連背, 性慾淡薄, 月經錯亂, 下肢疼痛, 冷而不溫, 沉重難以言狀, 步履艱難, 面色黧黑, 或腰間冷痛, 形寒怯冷, 口唇紫黯, 腰痛腿軟, 特別怕冷, 膝骨至跗易冷無力, 麻木, 不能久立, 耳鳴如潮, 精子減少, 不能挺直, 腰以下怕冷, 虛軟無力, 少腹疼痛, 夜晚更甚, 色淡量少, 周身酸楚, 精薄清冷, 小便頻數清長, 脈沈細無力, 常如風寒侵人, 早洩, 甚則脊中一線覺冷, 更不耐遠行, 精神萎靡",
    "風寒束表證": "甚則疼痛, 咳嗽, 惡寒重, 肢體酸楚, 頭痛, 打噴嚏, 發熱輕, 鼻塞聲重, 舌苔薄白, 痰白稀薄, 脈浮或浮緊, 時流清涕, 無汗, 咽癢",
    "風熱犯表證": "咳嗽, 身熱較著, 汗洩不暢, 咽乾甚則咽痛, 舌尖紅, 舌苔薄白乾或薄黃, 鼻塞, 痰黏或黃, 頭脹痛, 微惡風, 流黃稠涕, 口乾欲飲, 脈浮數",
    "暑濕傷表證": "汗出不暢, 胸悶脘痞, 脈濡數或滑, 頭重如裹, 流濁涕, 身熱不揚, 心煩口渴, 大便或溏, 鼻塞, 小便短赤, 微惡風, 發熱, 肢體困重或酸痛, 舌苔白膩或黃膩, 納呆",
    "氣虛感冒證": "咳, 苔薄, 痰白, 乏力, 舌淡, 平素神疲體弱, 汗多, 脈浮無力, 惡寒較甚, 鼻塞, 或易感冒, 氣短, 咳痰, 流涕, 苔白, 體倦, 神疲, 或併發熱, 咳痰無力",
    "陰虛感冒證": "頭昏, 身熱, 無汗或微汗或盜汗, 口乾, 微惡風寒, 脈細數, 乾咳少痰, 口燥, 口乾咽燥, 甚則口渴, 舌紅少苔, 心煩",
    "陽虛感冒證": "語聲低微, 惡寒重, 脈沉細無力, 面色白, 發熱輕, 苔白, 無汗, 四肢不溫, 舌質淡胖, 頭痛身痛",
    "風寒襲肺證": "肢體酸痛, 惡寒發熱, 咳白稀痰, 流清涕, 舌苔薄白, 咳嗽聲重, 脈浮或浮緊, 無汗, 氣急, 頭痛, 常伴有鼻塞, 咽癢",
    "風熱犯肺證": "脈浮數或浮滑, 喉燥咽痛, 舌紅, 氣粗或咳聲沙啞, 咳痰不爽, 頭痛, 苔薄黃, 痰粘稠或色黃, 常伴有鼻流黃涕, 身熱, 惡風,咳嗽頻劇, 口渴",
    "風燥傷肺證": "初起或伴有少許惡寒, 或痰少而黏, 身熱頭痛, 或痰中帶有血絲, 咽喉乾痛, 脈浮數或小數, 乾咳無痰, 口鼻乾燥, 不易咳出, 舌尖紅, 苔薄白或薄黃而乾",
    "痰濕蘊肺證": "納差乏力, 咳嗽反覆發作, 胸悶脘痞, 因痰而咳, 左心功能障礙, 每於晨起或食後咳甚痰多, 脈濡滑, 黏膩或稠厚成塊, 痰多色白,大便時溏, 舌苔白膩, 痰出則咳緩, 咳聲重濁",
    "痰熱鬱肺證": "口渴欲飲, 咳嗽, 感染較重, 痰黃或白, 氣喘, 胸滿煩躁, 溲黃便乾, 黏稠難咳, 或發熱汗出, 苔黃或黃膩, 咳痰較多, 欬逆喘息氣粗, 氣喘、紫紺較輕, 目脹睛突, 脈滑數, 紫紺, 舌暗紅, 或微惡寒",
    "肝火犯肺證": "脈弦數, 咳嗽陣作, 胸脅脹痛, 口苦, 痰中帶血或純血鮮紅, 煩躁易怒, 苔薄黃",
    "肺陰虧虛證": "午後潮熱, 乏力, 脈細數, 乾咳, 咳聲短促, 痰少質黏色白, 或聲音逐漸嘶啞, 常伴有日漸消瘦, 顴紅盜汗, 或痰中帶血絲, 口乾咽燥, 神疲, 舌紅少苔",
    "寒哮證": "天冷或受寒易發, 咳不甚, 初起多兼惡寒、發熱、頭痛等表證, 咳吐不爽, 舌苔白滑, 喉中哮鳴有聲, 痰稀薄色白, 脈弦緊或浮緊, 呼吸急促, 口不渴或渴喜熱飲, 胸膈滿悶如塞, 面色晦滯帶青, 形寒畏冷",
    "熱哮證": "氣粗息湧, 咳嗆陣作, 苔黃, 煩悶不安, 咳痰色黃或色白, 胸高脅脹, 喉中哮鳴, 面赤口苦, 黏濁稠厚, 脈滑數或弦滑, 汗出口渴喜飲, 苔膩, 不惡寒, 咳吐不利",
    "肺虛證": "顏面顴潮紅, 痰吐稀薄, 或咳嗆, 咽喉不利, 喉有鼾聲, 氣怯聲低, 痰少質黏, 喘促短氣, 煩熱口乾, 脈軟弱或細數, 或舌紅少苔, 咳聲低弱, 舌淡紅, 自汗畏風",
    "脾虛證": "脈細弱, 肥胖, 食少便溏, 胸脘滿悶, 或食油膩易腹瀉, 面色萎黃無華, 咳吐不爽, 苔白滑或膩, 噁心納呆, 倦怠無力, 痰多而黏, 肝硬化,舌質淡, 每因飲食不當而誘發",
    "腎虛證": "或見喘咳, 面紅煩躁, 動則喘甚, 汗出如油, 口咽乾燥, 舌淡苔白或黑潤, 面青唇紫, 喘促日久, 脈沉弱或細數, 足冷, 呼多吸少, 形瘦神。, 跗腫, 或舌紅少津, 汗出肢冷, 氣不得續",
    "風寒犯肺證": "頭痛鼻塞, 脈浮緊, 呼吸急促, 舌苔薄白而滑, 喘息欬逆, 胸部脹悶, 痰多色白清稀, 或有發熱, 惡寒無汗, 口不渴",
    "表寒肺熱證": "身痛, 胸脹或痛, 咳而不爽, 息粗鼻扇, 舌苔薄白或罩黃, 吐痰稠黏, 有汗或無汗, 舌邊紅, 伴形寒, 身熱, 喘逆上氣, 脈浮數或滑, 口渴, 煩悶",
    "痰濁阻肺證": "甚則胸盈仰息, 口黏不渴, 脈滑或濡, 胸中滿悶, 喘咳痰鳴, 嘔惡納呆, 苔白膩, 痰多黏膩色白, 咳吐不利, 舌質淡",
    "肝氣乘肺證": "平素多憂思抑鬱, 息粗氣憋, 或心煩易怒, 但喉中痰鳴不著, 面紅目赤, 苔薄白或黃, 突然呼吸短促, 每遇情志刺激而誘發, 脈弦,咽中如 胸脅悶痛, 或失眠, 心悸",
    "水凌心肺證": "舌淡胖或胖暗, 舌下青筋顯露, 或有瘀斑、瘀點, 脈沉細或澀, 倚息難於平臥, 面色瘀暗, 咳痰稀白, 苔白滑, 全身浮腫, 唇甲青紫, 喘咳氣逆, 尿少, 怯寒肢冷, 心悸",
    "喘脫證": "心悸煩躁, 四肢厥冷, 或脈微欲絕, 張口抬肩, 面青唇紫, 稍動則咳喘欲絕, 脈浮大無根, 鼻翼扇動, 喘逆劇甚, 不能平臥, 或有痰鳴, 汗出如珠",
    "初期證": "咳嗽, 口乾鼻燥, 脈浮數而滑, 胸痛, 咳時尤甚, 惡寒發熱, 痰量由少漸多, 呼吸不利, 苔薄黃或薄白少津, 咳吐白色黏痰, 舌尖紅",
    "成癰期證": "苔黃, 或黃綠色痰, 胸滿作痛, 自覺喉間有腥味, 身熱轉甚, 煩躁不安, 咳嗽氣急, 汗出身熱不解, 轉側不利, 苔膩, 口乾咽燥, 脈滑數有力, 咳吐黃稠痰",
    "潰膿期證": "面赤, 甚則氣喘不能臥, 苔黃, 有時咯血, 咳吐大量膿血痰, 身熱, 苔膩, 胸中煩滿而痛, 煩渴喜飲, 或如米粥, 腥臭異常, 脈滑數或數實",
    "恢復期證": "苔薄, 午後潮熱, 身熱漸退, 食慾改善, 氣短乏力, 或淡紅, 咯吐膿血漸少, 汗多, 盜汗, 心煩, 脈細或細數無力, 痰液轉為清稀,低熱, 臉色不華, 精神漸振, 口乾咽燥, 臭味亦減, 咳嗽減輕, 或見胸脅隱痛, 難以久臥, 形瘦神疲",
    "肺陰虧損證": "苔薄, 皮膚乾灼, 或咳少量黏痰, 色鮮紅, 乾咳, 胸部隱隱悶痛, 咳聲短促, 或痰中帶血絲或血點, 口乾咽燥, 午後手足心熱, 或有輕微盜汗, 舌邊尖紅, 脈細或兼數",
    "虛火灼肺證": "眠差, 午後潮熱, 骨蒸, 盜汗量多, 脈細數, 顴紅, 男子可見遺精, 嗆咳氣急, 痰少質黏, 心煩, 苔薄黃或剝, 性情急躁易怒, 女子月經不易調, 或胸脅掣痛, 時時咯血, 血色鮮紅, 舌紅而乾, 形體日漸消瘦, 量多, 或吐稠黃痰, 五心煩熱, 口渴",
    "氣陰耗傷證": "苔薄, 午後潮熱, 舌質光淡、邊有齒印, 面色白, 偶或夾血, 顴紅, 咳嗽無力, 伴有畏風、怕冷, 自汗與盜汗並見, 納少神疲, 血色淡紅, 脈細弱而數, 氣短聲低, 便溏, 咳痰清稀色白, 或咯血",
    "陰陽虛損證": "大肉盡脫, 男子滑精、陽痿, 咳痰色白, 聲嘶或失音, 脈微細而數, 舌質光淡隱紫, 汗多, 盜汗, 唇紫, 或見五更洩瀉, 潮熱, 面浮肢腫, 或夾血絲, 血色暗淡, 肢冷, 形寒, 或虛大無力, 心悸, 口舌生糜, 女子經少、經閉, 欬逆喘息少氣, 少津",
    "外寒內飲證": "欬逆喘滿不得臥, 咳痰白稀, 舌苔白滑, 周身酸楚, 舌體胖大, 惡寒, 脈浮緊, 呈泡沫狀, 胸部膨滿, 面色青暗, 氣短氣急, 舌質暗淡,或有口乾不欲飲",
    "痰濁壅肺證": "怕風汗多, 咳痰多, 色白黏膩或呈泡沫, 稍勞即著, 倦怠乏力, 脈滑, 短氣喘息, 舌暗, 苔薄膩或濁膩, 脘痞納少",
    "痰蒙神竅證": "苔白膩或黃膩, 或肢體動, 昏迷, 煩躁不安, 表情淡漠, 咳痰不爽, 脈細滑數, 嗜睡, 欬逆喘促日重, 入夜尤甚, 舌質暗紅或淡紫, 甚或意識朦朧, 或紫綺, 撮空理線, 譫妄, 抽搐",
    "痰瘀阻肺證": "舌質暗或紫, 苔膩或濁膩, 脈弦滑, 咳嗽痰多, 色白或呈泡沫, 面色灰白而暗, 胸部膨滿, 喉間痰鳴, 憋悶如塞, 唇甲紫紺, 舌下瘀筋增粗, 喘息不能平臥",
    "陽虛水氾證": "咳嗽, 或脅下痞塊堅硬, 咳嗽較重, 畏寒肢冷, 乏力, 氣喘, 左心功能障礙, 脈沉細或結、代、促, 面浮肢腫, 頸脈顯露, 喘息不得臥,腹脹, 或有瘀點、瘀斑, 氣喘、紫紺程度較重, 口唇發紺, 舌淡胖有齒痕, 尿少, 便溏, 神疲, 胸部刺痛, 心悸",
    "肺脾兩虛證": "咳嗽, 脈細或脈緩或弱, 腹脹, 面色少華, 痰白泡沫狀, 便溏, 少食乏力, 舌體胖大、齒痕, 舌質淡, 舌苔白, 自汗畏風",
    "虛熱證": "或咳痰帶血, 口渴咽燥, 咳聲不揚, 舌紅而乾, 咳吐濁唾, 甚則音嘎, 氣急喘促, 可伴潮熱盜汗, 皮毛乾枯, 脈虛數, 形體消瘦",
    "虛寒證": "食少, 小便數, 乏力, 頭暈, 短氣不足以息, 不渴, 咳吐涎沫, 脈虛弱, 頭目暈眩, 神疲, 形寒, 或遺尿, 舌質淡",
    "心虛膽怯證": "坐臥不安, 食少納呆, 善驚易恐, 脈細數或細弦, 心悸不寧, 惡聞聲響, 不寐多夢而易驚醒, 苔薄白",
    "心血不足證": "面色少華, 苔白, 心悸怔忡, 舌質淡, 脈細, 睡則汗出, 失眠多夢, 神疲氣短, 醒則自止",
    "陰虛火旺證": "睡眠差, 耳鳴, 食少, 急躁易怒, 畏寒肢冷, 舌淡, 脈細數, 或有自汗, 大便秘結不通, 滑, 面紅, 夜尿頻, 胸悶重, 健忘, 五心煩熱心, 耳鳴如潮, 苔薄, 兩顴色紅, 紅, 膝軟, 口苦, 頭暈, 左胸前區憋悶, 頭痛, 胸悶, 頭如裹, 大便秘結, 脈弦, 便秘, 或兼午後潮熱, 高血壓, 目赤, 口渴, 膩, 夜寐盜汗, 舌紅少苔, 溲赤",
    "心陽不振證": "形寒肢冷, 脈象虛弱或沉細無力, 舌淡苔白, 動則尤甚, 胸悶氣短, 面色蒼白, 心悸不安",
    "水飲凌心證": "心悸眩暈, 流涎, 或下肢浮腫, 形寒肢冷, 苔白滑, 胸悶痞滿, 欲吐, 伴噁心, 舌淡胖, 小便短少, 脈象弦滑或沉細而滑, 渴不欲飲",
    "瘀阻心證": "心痛時作, 舌質紫暗或有瘀斑, 唇甲青紫, 胸悶不舒, 脈澀或結或代, 痛如針刺, 心悸不安",
    "痰火擾心證": "苔黃, 便秘, 小便短赤, 脈弦滑, 口乾, 舌紅, 苔膩, 受驚易作, 心悸時發時止, 口苦, 胸悶煩躁, 失眠多夢",
    "心血瘀阻證": "苔薄, 反酸, 如刺如絞, 背痛徹心, 可因暴怒、勞累而加重, 伴有胸悶, 有瘀斑, 心胸疼痛, 或痛引肩背, 入夜為甚, 舌質紫暗,痛有定處, 日久不癒, 甚則心痛徹背, 脈弦澀",
    "氣滯心胸證": "苔薄或薄膩, 心胸滿悶, 遇情志不遂時容易誘發或加重, 或兼有胸部脹悶, 時欲太息, 隱痛陣發, 痛有定處, 脈細弦, 得噯氣或矢氣則舒",
    "痰濁閉阻證": "伴隨倦怠乏力, 咳吐痰涎, 肢體沉重, 苔濁膩或白滑, 胸悶重而心痛微, 形體肥胖, 脈滑, 遇陰雨天而易發作或加重, 痰多氣短, 納呆便溏,舌體胖大且邊有齒痕",
    "寒凝心證": "伴形寒, 甚則手足不溫, 苔薄白, 脈沉緊或沉細, 心痛徹背, 多因氣候驟冷或驟感風寒而發病或加重, 胸悶氣短, 面色蒼白, 冷汗自出, 喘不得臥, 心悸, 猝然心痛如絞",
    "氣陰兩虛證": "舌苔黃, 口咽乾燥, 易飢多食, 倦怠乏力, 腹脹或納少, 舌苔色白, 細脈, 關節痛, 咽部不適, 腹痛, 目糊, 納差, 夜尿頻, 舌淡暗, 腰酸,小便頻數, 舌淡紅, 神疲, 五心煩熱, 黑便, 多飲, 飲水有異常, 皮膚紫癜, 乏力, 頭暈, 少氣懶言, 肢體不遂, 左胸前區憋悶, 腰膝酸軟, 頭暈耳鳴, 沈脈, 苔少, 汗多, 脈沉, 便後汗出氣喘, 苔薄白, 心絞痛, 小便清長, 口乾欲飲, 排便順暢, 體倦, 口渴, 舌苔稍偏黃, 眠差, 大便秘結或溏爛, 半身不遂, 肢體麻木, 脈細, 氣短, 浮腫或疲倦乏力, 胸悶重, 舌質淡紅少苔, 抑鬱, 黑便消失, 心悸, 膝軟, 小便頻, 口乾小便頻, 口乾, 焦慮, 糞便性狀, 呈舌質暗淡, 腹脹腹痛, 口燥, 左心功能障礙, 身體困重, 盜汗, 胸悶, 胸痛, 脈細或細數, 腹脹, 口乾咽燥, 腰痛, 納呆,舌體暗無光澤, 視物昏花",
    "心腎陰虛證": "眠差, 驚悸, 膝軟, 舌紅, 脈細數, 腰膝酸軟, 頭暈耳鳴, 虛煩少寐, 盜汗, 女子月經不調, 少苔或無苔, 男子遺精, 腰酸, 口乾咽燥,健忘, 五心煩熱",
    "心腎陽虛證": "四肢欠溫或腫脹, 動則更甚, 邊齒, 面色白, 心悸而痛, 脈沉細遲, 胸悶氣短, 舌質淡胖, 汗多, 神倦怯寒, 苔白或膩",
    "正虛陽脫證": "四肢厥冷, 喘促不寧, 口開目合, 大汗淋漓, 煩躁不安或表情淡漠, 胸中憋悶或有窒息感, 心胸絞痛, 面色蒼白, 脈疾數無力或脈微欲絕, 重則神識昏迷, 手尿遺, 心悸",
    "氣虛血瘀證": "舌苔色白, 細脈, 或謇澀或不語, 目糊, 胸悶噁心, 夜尿頻, 舌淡紅, 神疲, 肢體酸軟, 乏力, 身疲力乏, 氣短乏力, 手足或偏身腫脹, 頭暈,少氣懶言, 肢體不遂, 左胸前區憋悶, 口舌歪斜, 沈脈, 汗多, 小便頻多, 脈沉, 舌質暗淡或瘀斑, 言語蹇澀, 舌苔薄白或膩, 偏癱, 苔薄白, 肌膚不仁, 心絞痛, 便溏, 體倦, 言語不利, 納呆痰多, 面色紫黯, 舌下絡脈紫, 舌苔薄, 半身不遂, 肢體麻木, 口角流涎, 脈細眩, 偏癱失語, 半身不遂, 肢體麻木, 口角流涎, 脈絡眩, 偏癱失語, 暈暈頭重, 氣短, 疲倦乏力, 胸悶重, 心悸, 脈沉細、細緩或細弦, 肢體疼痛, 口乾, 口燥, 身體困重, 胸悶, 胸痛, 臉色無華, 口乾咽燥",
    "喘脫危證": "或額汗如油, 四肢厥冷, 脈微細欲絕或疾數無力, 舌淡苔白, 煩躁不安, 面色晦暗, 尿少肢腫, 喘悸不休",
    "肝火擾心證": "不寐多夢, 急躁易怒, 伴隨頭暈頭脹, 目赤耳鳴, 納差, 甚則徹夜不眠, 便秘溲赤, 脈弦而數, 口乾而苦, 舌紅苔黃",
    "痰熱擾心證": "苔黃, 目眩, 胸悶脘痞, 苔膩, 伴頭重, 脈滑數, 泛惡噯氣, 舌偏紅, 心煩不寐",
    "心脾兩虛證": "脈細弱, 多思善慮, 納差, 失眠健忘, 苔薄白, 面色無華, 心悸膽怯, 舌質淡, 頭暈神疲",
    "心腎不交證": "睡眠差, 膝軟, 脈細數, 腰膝酸軟, 女子月經不調, 男子遺精, 潮熱, 腰酸, 咽乾少津, 五心煩熱, 舌紅少苔, 心煩不寐, 心悸多夢, 伴頭暈耳鳴",
    "心膽氣虛證": "膽怯心悸, 終日 擲骰, 脈弦, 舌淡, 倦怠乏力, 虛煩不寐, 伴氣短自汗, 脈細, 觸事易驚",
    "濕盛困脾證": "胸脘痞滿, 納差, 頭蒙如裹, 肢體沉重, 偶伴浮腫, 泛惡, 脈濡, 昏昏嗜睡, 舌苔膩",
    "瘀血阻滯證": "脅下癥結刺痛、拒按, 脈澀, 黃疸日久, 面頸部見有赤絲紅紋, 膚色暗黃、蒼黃, 舌有紫斑或紫點, 甚則黧黑",
    "脾氣虛弱證": "嗜睡多臥, 面黃, 飯後尤甚, 脈虛弱, 苔薄白, 倦怠乏力, 伴納少便溏",
    "陽氣虛衰證": "頭搖肢顫, 畏寒肢冷, 四肢麻木, 舌苔薄白, 心悸懶言, 舌質淡, 筋脈拘攣, 小便清長或自遺, 動則氣短, 汗多, 大便溏, 脈沉遲無力",
    "風寒頭痛證": "呈掣痛樣, 遇風尤劇, 頭痛喜裹, 苔薄白, 舌淡紅, 脈浮或浮緊, 時有拘急收緊感, 常伴惡風畏寒, 連及項背, 頭痛時作, 口不渴",
    "風熱頭痛證": "發熱或惡風, 口渴喜飲, 脈浮數, 甚則頭脹如裂, 便秘尿赤, 舌尖紅, 頭痛而脹, 面紅目赤, 苔薄黃",
    "風濕頭痛證": "肢體困重, 胸悶納呆, 小便不利, 舌淡, 苔膩, 脈濡, 苔白, 頭痛如裹, 大便或溏",
    "肝陽頭痛證": "苔薄, 苔黃, 口苦面紅, 脈弦數, 煩躁不安, 舌紅, 心煩, 頭脹痛而眩, 煩躁, 以兩側為主, 或兼脅痛, 煩躁不寧, 心煩易怒",
    "血虛頭痛證": "脈細弱, 乏力, 頭痛而暈, 苔薄白, 面色少華, 神疲, 心悸怔忡, 舌質淡",
    "氣虛頭痛證": "脈細弱, 氣短自汗, 苔薄白, 時發時止, 倦怠乏力, 舌質淡, 遇勞則加重, 頭痛隱隱, 納食減少",
    "痰濁頭痛證": "舌淡, 苔膩, 苔白, 胸脘痞悶, 納呆嘔惡, 脈滑或弦滑, 頭痛昏蒙沉重",
    "腎虛頭痛證": "遺精帶下, 膝軟, 乏力, 腰酸, 脈細無力, 腰膝酸軟, 神疲, 頭痛且空, 頭暈耳鳴, 舌紅少苔, 少寐健忘",
    "瘀血頭痛證": "痛處固定不移, 頭痛經久不癒, 或有頭部外傷史, 苔薄白, 舌質紫暗, 可見瘀斑、瘀點, 痛如錐刺, 脈細或細澀",
    "肝陽上亢證": "耳鳴, 急躁易怒, 遇煩勞鬱怒而加重, 口苦, 肢麻震顫, 頭暈, 頭目脹痛, 失眠多夢, 脈弦或數, 舌紅苔黃, 甚則僕倒, 耳目脹痛, 失眠多夢, 脈弦或數, 舌紅苔黃, 甚則僕倒, 耳鳴如潮, 顏面潮紅",
    "痰濕中阻證": "身重困倦, 脈沉滑, 脘腹痞塞不舒, 胸膈滿悶, 小便不利, 高血壓, 頭暈目眩, 嘔惡納呆, 大便頻率異常, 口淡不渴, 大便性狀異常, 舌苔白厚膩",
    "瘀血阻竅證": "眠差, 耳鳴耳聾, 兼見健忘, 舌暗有瘀斑, 多伴見舌下脈絡迂曲增粗, 精神不振, 且痛有定處, 脈澀或細澀, 頭暈, 頭痛, 心悸, 面唇紫暗",
    "氣血虧虛證": "頭搖肢顫, 舌質淡紅, 臉色白, 乏力, 舌苔薄白滑, 表情淡漠, 脈沉濡無力或沉細弱, 頭暈, 舌體胖大, 心悸健忘, 神疲, 納呆, 動則氣短",
    "腎精不足證": "形寒肢冷, 舌淡嫩, 或遺精滑洩, 視力減退, 脈細數, 或面色白, 兩目乾澀, 眩暈日久不癒, 腰酸膝軟, 耳鳴齒搖, 脈沉細無力, 少寐多夢, 健忘, 或顴紅咽乾, 苔白, 尺脈尤甚, 五心煩熱, 舌紅少苔, 精神萎靡",
    "風陽上擾證": "舌紅少苔或苔黃, 急躁易怒, 脈弦數, 或舌強不語, 半身不遂, 頭暈, 口舌歪斜, 頭痛, 面紅目赤, 尿赤, 口苦咽乾, 大便秘結, 言語謇澀, 肌膚不仁, 便乾",
    "風痰阻絡證": "脈弦滑, 頭暈目眩, 半身不遂, 舌苔色白, 舌苔膩, 或謇澀或不語, 滑脈, 胸悶重, 神疲, 頭暈昏沉, 乏力, 頭暈, 少氣懶言, 肢體不遂, 左胸前區憋悶, 身體困重, 口舌歪斜, 弦脈, 胸悶, 甚則半身不遂, 舌苔白膩, 胸痛, 肌膚不仁, 舌質暗淡, 體倦, 言語不利",
    "痰熱腑實證": "吐痰或痰多, 舌質暗紅或暗淡, 腹脹、便乾或便秘, 肌膚不仁, 頭暈目眩, 苔黃或黃膩, 半身不遂, 脈弦滑或兼數, 或言語謇澀, 言語不利, 口舌歪斜",
    "陰虛風動證": "綾或暗紅, 急躁易怒, 脈細弦或細弦數, 一側手足沉重麻木, 半身不遂, 平素頭暈頭痛, 口舌歪斜, 耳鳴目眩, 少苔或無苔, 腰酸腿軟, 雙目乾澀, 舌強語謇, 少眠多夢",
    "陽閉證": "躁擾不寧, 兩手握固, 氣粗口臭, 舌苔黃膩, 口噤不開, 不省人事, 突然昏僕, 牙關緊閉, 大小便閉, 兼有面赤身熱, 肢體強痙, 脈弦滑強痙攣, 脈弦滑強痙攣, 大小便而數",
    "陰閉證": "脈沉滑, 舌苔白膩, 兩手握固, 面白唇暗, 口噤不開, 不省人事, 靜臥不煩, 四肢不溫, 牙關緊閉, 大小便閉, 突然昏倒, 肢體強痙",
    "脫證": "鼻鼾息微, 目合口張, 舌痿, 不省人事, 手撒遺尿, 四肢冰冷, 突然昏僕, 脈微欲絕, 汗多不止",
    "髓海不足證": "頭搖肢顫, 耳鳴, 膝軟, 失眠心煩, 脈象細數, 頭暈, 腰膝酸軟, 或紅絳無苔, 持物不穩, 腰酸, 老年患者常兼有神呆、癡傻, 舌苔薄白,善忘, 耳鳴如潮",
    "脾腎虧虛證": "舌苔白或膩, 食少納呆, 或呃逆不食, 脈沉細弱, 兩尺尤甚, 反應遲鈍, 迷惑善忘, 四肢不溫, 興趣缺失, 小便混濁, 尿頻, 或二便失禁, 舌淡體胖大有齒痕, 易驚恐恐, 口涎",
    "氣血不足證": "找詞困難, 脈細弱, 納呆食少, 言語顛倒, 善忘茫然, 大便溏薄, 面唇無華, 少言寡語, 倦怠少動, 舌淡苔白, 多夢易驚, 爪甲蒼白,不識人物",
    "痰濁蒙竅證": "親疏不辨, 表情呆滯, 忽歌忽笑, 迷路誤事, 舌苔黏膩濁, 潔穢不分, 體肥懶動, 口吐痰, 不言不語, 多忘不慧, 納呆嘔惡,脈弦而滑",
    "瘀阻腦絡證": "多繼發於中風、顱腦外傷、產傷、顱內感染性疾患後, 常伴單側肢體抽搐, 舌苔薄白, 平素頭暈頭痛, 痛有定處, 或一側面部抽動, 舌質暗紅或有瘀斑, 顏面口唇青紫, 脈澀或弦",
    "心肝火旺證": "惡夢或夢幻遊離或夢寐喊叫, 急躁易怒, 妄思妄行, 煩躁不安, 或舉止異常, 苔黃或黃膩, 口臭、口瘡、尿赤、便幹, 妄聞妄見, 脈弦滑或弦數, 頭暈目眩、頭痛、耳鳴如潮, 舌紅或綏",
    "熱毒內盛證": "或譫語妄言, 躁擾不寧, 肢體僵硬, 神呆遺尿, 或癇痙, 或腐穢厚積, 身體蜷縮不動, 無欲無語, 苔黏膩濁, 脈數, 舌紅綛少苔, 不識人物, 或二便失禁, 或顫動, 甚則狂越, 迷濛昏睡",
    "痰氣鬱結證": "脅迫脹滿, 咽中如有異物梗塞, 脈弦滑, 吞之不下, 咯之不出, 精神抑鬱, 胸部滿悶, 苔白膩",
    "氣虛痰結證": "不動不語, 食少便溏, 舌淡, 目瞪如愚, 傻笑自言自語, 自責自罪, 情感淡漠, 甚至呆若木雞, 靈機混亂, 面黃, 脈細滑或細弱, 苔膩, 苔白, 妄聞妄見",
    "痰火擾神證": "突然狂暴無知, 踰垣上屋, 頭痛失眠, 棄衣而走, 起病常先有性情急躁, 脈弦滑數, 不食不眠, 苔多黃膩, 面紅目赤, 不避親疏, 登高而歌, 兩目怒視, 或哭笑無常, 綹, 或毀物傷人, 罵詈叫號",
    "火盛傷陰證": "少苔或無苔, 精神疲憊, 情緒焦慮, 脈細數, 病勢較緩, 五心煩熱, 狂證日久, 煩躁不眠, 時作時止, 形瘦面紅",
    "痰熱瘀結證": "舌紫暗或有瘀斑, 癲狂日久不愈, 棄衣而走, 脈弦細或細澀, 多言無序, 面色晦滯而穢, 情緒躁擾不安, 頭痛, 妄思離奇, 心悸而煩, 甚至登高而歌, 惱怒不休, 妄見妄聞, 苔少或薄黃而乾",
    "陽癇證": "或發怪叫, 平素多有情緒急躁, 口吐涎沫, 苔白膩或黃膩, 脈弦數或弦滑, 便秘尿黃等症, 不省人事, 面色潮紅、紫紅, 或喉中痰鳴, 突然昏僕, 甚則二便自遺, 兩目上視, 病發前多有眩暈, 頭痛而脹, 口唇青紫, 心煩眠差, 口苦咽乾, 四肢抽搐, 喜欠伸等先兆症狀, 項背強直, 胸悶乏力, 繼之轉為青紫或蒼白, 牙關緊閉, 移時甦醒",
    "陰癇證": "不動不語, 口吐涎沫, 胸悶咳痰, 面色晦暗青灰而黃, 一般口不啼叫, 突然昏僕, 醒後周身疲乏, 手足清冷, 納差便溏等症, 脈多沉細或沉遲, 苔白膩, 恢復後對上述症狀全然不知, 肢體拘急, 或聲音微小, 平素多見神疲乏力, 不聞不見, 或如常人, 數秒至數分鐘即可恢復, 或僅表現為一過性呆木無知, 不省人事, 噁心泛嘔, 或抽搐時作, 雙眼半開半合, 多則一日數次或十數次發作, 舌質淡",
    "肝火痰熱證": "苔黃, 或有吼叫, 舌紅, 咳痰不爽, 面紅目赤, 平時急躁易怒, 心煩眠差, 口苦咽乾, 吐涎, 苔膩, 發作時昏僕抽搐, 便秘溲黃, 脈弦滑而數",
    "脾虛痰盛證": "蜷臥拘急, 發作時面色晦滯或白, 嘔吐涎沫, 納差便溏, 少氣懶言, 胸脘痞悶, 四肢不溫, 叫聲低怯, 苔白膩, 舌質淡, 脈濡滑或弦細滑, 平素神疲乏力",
    "寒邪客胃證": "遇寒加重, 苔薄, 或喜熱飲, 舌淡, 得溫痛減, 苔白, 惡寒喜暖, 脈弦緊, 口淡不渴, 胃痛暴作",
    "宿食積滯證": "吐後痛減, 納差, 大便不爽, 噯腐吞酸, 或嘔吐不消化食物, 得矢氣及便後稍舒, 脈滑, 舌苔厚膩, 脹滿拒按, 其味腐臭, 胃脘疼痛",
    "肝胃鬱熱證": "煩躁不安, 口乾, 胃痛, 口苦, 燒心外, 胃脹, 胃脘灼痛, 脈弦或數, 煩躁易怒, 舌紅苔黃, 脅脹不舒, 泛酸, 暖氣, 胃胺部灼熱感, 泛酸嘈雜",
    "肝氣犯胃證": "脈弦, 脘脅脹痛, 苔薄膩或微黃, 嘔吐吞酸, 煩悶不舒, 或乾嘔泛惡, 噯氣頻頻, 每因情志不遂而發作或加重, 舌邊紅",
    "濕熱中阻證": "苔黃, 洩瀉腹痛, 小便短黃, 脈滑數或濡數, 苔膩, 肛門灼熱, 煩熱口渴, 瀉下急迫, 或瀉而不爽, 糞色黃褐臭穢",
    "瘀血停滯證": "脈澀, 胃脘刺痛, 舌質紫暗或有瘀斑, 食後加劇, 入夜尤甚, 按之痛甚, 痛有定處, 或見吐血、黑便",
    "胃陰不足證": "納差, 或食後飽脹, 或有煩渴, 舌紅, 呃聲短促而不連續, 大便乾結, 脈細數, 口舌乾燥, 苔少",
    "熱證": "苔黃, 咳嗽, 胃脘悶脹, 噯腐氣穢, 脈弦數, 尿赤短, 煩躁不安, 口乾, 兩脅脹滿, 舌紅, 口苦, 左胸前區憋悶, 吞酸時作, 時有嗆咳, 心煩, 胸悶, 口色赤紅, 咽乾口渴, 煩躁, 咳痰, 胸悶重, 煩躁不寧, 脈洪數, 心煩易怒",
    "寒證": "噯氣酸腐, 胸脘脹悶, 大便溏洩, 舌淡苔白, 飲食喜熱, 喜唾涎沫, 吐酸時作, 四肢不溫, 脈沉遲",
    "胃熱證": "吵雜而兼噁心吞酸, 口渴喜冷, 口臭心煩, 脘悶痰多, 或似飢非飢, 脈滑數, 多食易飢, 苔黃幹",
    "胃虛證": "脈虛, 奈差, 口淡無味, 體倦乏力, 舌質淡, 食後脘脹, 吵雜時作時止",
    "血虛證": "脈細弱, 脾臟顯著腫大, 苔白, 起立時眼前昏暗, 面色蒼白, 嘈雜而兼面白唇淡, 舌質淡, 頭暈心悸, 失眠多夢, 胸腺嚴重萎縮",
    "外寒內滯證": "噯氣嘔惡, 納差, 惡寒發熱, 身體疼痛, 舌苔薄白或白膩, 脘腹痞悶, 脈浮緊或濡, 頭痛無汗, 大便溏薄",
    "飲食內停證": "脘腹痞脹, 進食尤甚, 臭如敗卵, 噯腐吞酸, 惡食嘔吐, 或大便不規則, 脈滑, 矢氣頻作, 舌苔厚膩",
    "寒熱錯雜證": "心下痞滿, 腸鳴下利, 舌淡苔膩, 噯氣不舒, 納呆嘔惡, 脈濡或滑",
    "肝鬱氣滯證": "脈弦, 情緒憂鬱, 脅腹脹滿, 舌紅, 或多煩善怒, 小便不通或通而不爽, 苔薄黃",
    "脾胃虛弱證": "苔薄, 脈細弱, 起病緩慢, 舌淡, 苔白, 肌肉萎縮, 少氣懶言, 面色萎弱無華, 神疲肢倦, 納呆便溏, 面浮, 肢體軟弱無力逐漸加重",
    "外邪犯胃證": "舌苔白膩, 突然嘔吐, 頭身疼痛, 伴有惡寒發熱, 脈濡, 胸脘痞悶, 或心中懊, 頻頻泛惡",
    "飲食停滯證": "得食更甚, 吐後反快, 嘔吐酸腐量多, 或吐出未消化的食物, 氣味臭穢, 脈滑實有力, 噯氣厭食, 腹脹, 舌苔厚實, 大便秘結或溏洩",
    "痰飲內阻證": "脈沉弦滑, 或胃部如囊裹水, 嘔吐物多為清水痰涎, 頭目暈眩, 或逐漸消瘦, 舌苔白滑而膩, 胸脘痞悶, 頭暈, 或嘔而腸鳴, 納食不佳, 心悸",
    "胃陰虧虛證": "噁心, 脈細數, 似飢而不欲食, 或時作乾嘔, 胃中吵雜, 苔少, 嘔吐反覆發作, 舌紅少津, 口燥咽乾",
    "痰氣交阻證": "苔薄膩, 便秘, 脈弦滑, 胸膈痞滿, 噯氣呃逆, 口乾咽燥, 嘔吐痰涎, 吞嚥阻塞, 或疼痛, 情緒憂鬱時加重",
    "津虧熱結證": "乾燥少津, 食入即復出, 脈細數, 心煩口乾, 大便乾結如羊糞, 舌質光紅, 小便短赤, 瘙癢, 吞嚥梗澀而痛, 五心煩熱, 胃脘灼熱, 形體消瘦, 甚則水飲難進",
    "瘀血內結證": "腹部積塊明顯, 脈細澀, 時有寒熱, 舌質紫暗或有瘀點, 硬痛不移, 面色晦暗黧黑, 面頸胸臂或有血痣赤縷, 女子可見月事不下",
    "氣虛陽微證": "脈細弱, 精神疲憊, 面浮足腫, 面色白, 吞嚥受阻, 泛吐涎沫, 飲食不下, 苔白, 形寒氣短, 舌質淡, 腹脹便溏",
    "胃中寒冷證": "喜食熱飲, 舌淡苔薄而潤, 遇寒則甚, 呃聲沉而有力, 胃脘部及膈間不舒, 得熱則減, 進食減少, 脈遲緩, 口淡不渴",
    "胃火上逆證": "便秘, 小便短黃, 呃聲洪亮有力, 多喜冷飲, 脘腹滿悶, 舌紅苔黃或燥, 脈滑數, 沖逆而出, 口臭煩渴",
    "氣機鬱滯證": "苔薄, 常因情志不暢而誘發或加重, 脈弦, 或有噯氣納呆, 腹脹, 呃逆連聲, 腸鳴矢氣, 胸脅滿悶",
    "寒邪內阻證": "形寒肢冷, 脈沉緊, 痛勢急暴, 得溫痛減, 遇寒痛甚, 小便清長, 大便清稀或秘結, 苔白膩, 舌質淡, 口淡不渴, 腹痛拘急",
    "濕熱壅滯證": "苔黃燥或黃膩, 潮熱, 便秘, 或溏滯不爽, 小便短黃, 腹痛拒按, 脈滑數, 煩渴引飲",
    "飲食積滯證": "瀉後痛減, 噯腐吞酸, 厭食嘔惡, 腹脹, 脈滑, 舌苔厚膩, 痛而欲瀉, 疼痛拒按, 或大便秘結",
    "瘀血內停證": "腹痛較劇, 痛處固定, 經久不癒, 入夜尤甚, 舌質紫暗, 脈細澀, 痛如針刺",
    "中虛寒證": "脈弱或沉緩, 疲倦, 腹痛綿綿, 氣短懶言, 納食不佳, 大便溏薄, 面黃, 喜暖喜按, 苔白, 神疲, 畏寒怯冷, 舌質淡, 時作時止",
    "寒濕內盛證": "腹痛腸鳴, 肢體酸痛, 脘悶食少, 或兼惡寒, 發熱, 脈濡緩, 洩瀉清稀, 頭痛, 甚則如水樣, 舌苔白或白膩",
    "食滯腸胃證": "腹痛腸鳴, 舌苔垢濁或厚膩, 瀉後痛減, 納差, 腹脹, 脈滑, 瀉下糞便臭如敗卵, 喳腐酸臭",
    "肝氣乘脾證": "腹痛攻竄, 平時心情抑鬱, 或情緒緊張而發洩瀉, 脈弦, 舌淡紅, 伴有胸脅脹悶, 噯食少, 或急躁易怒, 腸鳴矢氣, 每因抑鬱惱怒",
    "腎陽虛衰證": "腹部喜暖喜按, 脈沉, 完穀不化, 形寒肢冷, 膝軟, 瀉後痛減, 舌淡苔白, 腰酸, 黎明前腹部作痛, 腰膝酸軟, 脈細, 腸鳴即瀉",
    "濕熱痢證": "痢下赤白膿血, 裡急後重, 舌苔黃膩, 小便短赤, 腹部疼痛, 腥臭, 肛門灼熱, 脈滑數, 黏稠如膠凍",
    "疫毒痢證": "噁心嘔吐, 後重感特著, 脈滑數或微欲絕, 舌苔黃燥, 痢下鮮紫膿血, 頭痛煩躁, 起病急驟, 甚者神昏驚厥, 絳, 腹痛劇烈, 大便頻頻, 壯熱口渴",
    "寒濕痢證": "舌苔白膩, 裡急後重, 脘脹腹滿, 身重, 白多赤少, 或為純白凍, 脈瀨緩, 口淡乏味, 痢下赤白粘凍, 舌質或淡, 腹痛拘急",
    "陰虛痢證": "食少, 膿血黏稠, 臍下灼痛, 至夜轉劇, 或下鮮血, 脈細數, 心煩口乾, 苔少或花剝, 舌紅絳少津, 日久不癒, 虛坐努責, 痢下赤白",
    "虛寒痢證": "食少神疲, 苔薄, 痢下赤白清稀, 膝軟, 脈沉細弱, 舌淡, 無腥臭, 甚則滑脫不禁, 或為白凍, 纏綿不已, 四肢不溫, 腰膝酸軟, 喜腥按喜溫, 腹部隱痛, 腰酸, 苔白, 形寒冷, 便後更甚, 肛門墜脹",
    "休息痢證": "發時大便次數增加, 舌質淡苔膩, 遷延不癒, 倦怠嗜臥, 夾有赤白黏凍, 腹脹食少, 下痢時發時止, 常因飲食不當、受涼、勞累而發, 脈濡軟或虛數",
    "熱秘證": "臉紅心煩, 小便短赤, 腹脹或痛, 口乾口臭, 大便乾結, 脈滑數, 苔黃燥, 或有身熱",
    "氣秘證": "脈弦, 噯氣頻作, 舌苔薄膩, 大便乾結, 或不甚乾結, 欲便不得出, 脅腹痞滿脹痛, 腸鳴矢氣, 或便後不爽",
    "冷秘證": "脅下偏痛, 大便艱澀, 手觸不溫, 呃逆嘔吐, 脈弦緊, 脹滿拒按, 四肢不溫, 苔白膩, 手足發涼, 腹痛拘急",
    "氣虛秘證": "肢倦懶言, 但排出困難, 雖有便意, 面白神疲, 舌淡苔白, 大便乾或不干, 脈細, 用力努掙則汗出短氣, 便後乏力",
    "血虛秘證": "口唇色淡, 大便乾結, 搔癢, 頭暈目眩, 面色無華, 舌淡苔少, 健忘少寐, 脈細, 心悸氣短",
    "陰虛秘證": "潮熱, 膝軟, 大便乾結, 兩顴紅赤, 脈細數, 腰酸, 心煩少寐, 腰膝酸軟, 形體消瘦, 頭暈耳鳴, 舌紅少苔",
    "陽虛秘證": "腹中冷痛, 腰膝酸冷, 舌淡苔白, 面色白, 排出困難, 大便乾或不乾, 小便清長, 四肢不溫, 脈沉遲",
    "邪鬱少陽證": "胸脅苦滿疼痛, 舌苔薄白或微黃, 脈弦, 心煩喜嘔, 頭痛目眩, 兼寒熱往來, 口苦咽幹",
    "肝膽濕熱證": "口臭, 噁心嘔吐, 口乾, 舌紅, 脈弦滑數, 小便黃赤, 口燥, 口苦, 口臭或有異味, 尿黃, 胸悶納呆, 易怒, 大便不爽, 有異味, 身目發黃, 苔黃膩, 小便色黃, 口苦口黏, 口乾咽燥, 外源性發炎反應, 脂質過氧化自由基損傷, 脅肋脹痛或灼熱疼痛、劇痛, 或兼有身熱惡寒",
    "瘀血阻絡證": "舌紫暗, 轉側若刀錐之刺, 痛有定處, 入夜痛甚, 脈象沉澀, 痛處拒按, 脅肋下或見有癥塊",
    "肝絡失養證": "脈細弦而數, 悠悠不休, 頭暈目眩, 口乾咽燥, 脅肋隱痛, 心中煩熱, 舌紅少苔, 遇勞加重",
    "疫毒熾盛證": "或肌膚瘀斑, 脈弦滑或數, 發病急驟, 高熱口渴, 脅痛腹滿, 神昏譫語, 苔黃而燥, 黃疸迅速加深, 其色如金, 瘙癢, 煩躁抽搐, 綾, 或見衄血、血",
    "熱重於濕證": "或見心中懊, 脈象弦數, 發熱口渴, 噁心嘔吐, 小便短少黃赤, 便秘, 舌苔黃膩, 身目俱黃, 黃色鮮明, 腹部脹悶, 口乾而苦",
    "濕重於熱證": "胸脘痞滿, 噁心嘔吐, 身目俱黃, 舌苔厚膩微黃, 黃色不及前者鮮明, 食慾減退, 腹脹或大便溏垢, 脈象濡數或濡緩, 頭重身困",
    "膽腑鬱熱證": "或寒熱往來, 尿黃赤, 嘔吐呃逆, 身目發黃, 脈弦滑數, 黃色鮮明, 大便秘, 身熱不退, 苔黃舌紅, 上腹、右脅脹悶疼痛, 牽引肩背,口苦咽乾",
    "寒濕阻遏證": "脘腹痞脹, 大便不實, 神疲畏寒, 身目俱黃, 納谷減少, 舌淡苔膩, 或如煙熏, 脈濡緩或沉遲, 黃色晦暗, 口淡不渴",
    "濕熱留戀證": "脘痞腹脹, 飲食減少, 苔膩, 小便黃赤, 脅肋隱痛, 脈濡數, 口中乾苦",
    "肝脾不調證": "飲食欠香, 大便不調, 脈來細弦, 舌苔薄白, 脘腹痞悶, 脅肋隱痛不適, 肢倦乏力",
    "氣滯血阻證": "脅肋疼痛, 脈弦, 固定不移, 苔薄白, 脘腹痞滿, 舌暗, 積塊軟而不堅",
    "正虛瘀阻證": "形脫骨立, 疲倦, 疼痛逐漸加劇, 脈細數或弦細, 面色萎黃或黧黑, 積塊堅硬, 舌光無苔, 神疲, 舌質淡紫, 飲食大減, 或嘔血、便血、衄血",
    "食滯痰阻證": "大便秘結, 便秘, 脈弦滑, 腹脹或痛, 腹部時有條索狀物聚起, 大便秘結不通, 重按則脹痛更甚, 舌苔膩, 納呆",
    "氣滯濕阻證": "食後脹甚, 得噯氣、矢氣稍減, 脈弦, 飲食減少, 小便短少, 脅迫下脹滿或疼痛, 腹脹按之不堅, 舌苔薄白膩",
    "水濕困脾證": "脘腹痞脹, 精神困倦, 舌苔白膩, 小便少, 怯寒懶動, 腹大脹滿, 兩足浮腫, 按之如囊裹水, 得熱則舒, 脈緩, 甚則顏面微浮,大便溏",
    "濕熱蘊結證": "小便赤澀, 脈象弦數, 苔黃, 腹大堅滿, 大便秘結或溏垢, 脘腹脹急, 舌苔黃, 痤瘡, 苔黃膩或兼灰黑, 苔少, 煩熱口苦, 舌紅舌質紋理粗糙, 肝硬化, 舌體暗無光澤, 舌邊尖紅, 渴不欲飲",
    "肝脾血瘀證": "口乾不欲飲水, 脘腹堅滿, 青筋顯露, 面、頸、胸、臂出現血痣或蟹爪紋, 脈細澀, 脅下癥結痛如針刺, 面色晦暗黧黑, 或見赤絲血縷, 舌質紫暗或有紫斑, 或見大便色黑",
    "黃疸證": "身目黃染如金, 苔黃, 舌暗紅, 脈弦滑, 腹部膨隆, 倦怠乏力, 肝區脹痛, 納食欠佳或不欲食, 雙下肢水腫, 大便溏, 噁心厭油, 尿少如濃茶, 苔膩, 煩躁不寧",
    "出血證": "重者病勢突變, 脈弦數, 大量嘔吐鮮血或大便下血, 輕者可見牙齦出血、鼻衄或膚下瘀斑, 舌紅苔黃",
    "神昏證": "口臭便秘, 溲赤尿少, 神昏諦語, 發熱, 黃疸, 脈細數, 昏不識人, 綾, 苔黃燥, 煩躁不寧",
    "氣鬱痰阻證": "頸部覺脹, 頸前喉結兩旁結塊腫大, 病情常隨情志波動, 脈弦, 或兼胸脅竄痛, 苔薄白, 胸悶重, 左胸前區憋悶, 質軟不痛, 喜太息, 胸悶",
    "痰結血瘀證": "舌質暗或紫, 頸前喉結兩旁結塊腫大, 納差, 腫塊經久未消, 胸悶重, 脈弦或澀, 左胸前區憋悶, 按之較硬或有結節, 苔薄白或白膩, 胸悶",
    "肝火旺盛證": "性情急躁易怒, 頸前喉結兩旁輕度或中度腫大, 脈弦數, 面部烘熱, 眼球突出, 煩熱, 口苦, 手指顫抖, 一般柔軟光滑, 容易出汗, 苔薄黃",
    "心肝陰虛證": "倦怠乏力, 目幹, 頸前喉結兩旁結塊或大或小, 病起較緩, 舌體顫動, 心悸不寧, 手指顫動, 目眩, 質軟, 心煩少寐, 易出汗, 脈弦細數, 苔少或無苔",
    "正瘧證": "寒罷則內外皆熱, 頭痛面赤, 口渴引飲, 熱退身涼, 脈弦, 先有哈欠乏力, 繼則寒栗鼓頷, 舌紅, 寒戰壯熱, 終則遍身汗出,苔薄白或黃膩, 休作有時",
    "溫瘧證": "苔黃, 口渴引飲, 熱多寒少, 脈弦數, 汗出不暢, 舌紅, 骨節酸痛, 便秘尿赤, 頭痛",
    "寒瘧證": "脈弦, 熱少寒多, 神疲體倦, 胸脘痞悶, 苔白膩, 口不渴",
    "熱瘴證": "胸悶嘔吐, 或壯熱不寒, 頭痛, 面紅目赤, 熱甚寒微, 甚至神昏諦語, 便秘, 煩渴飲冷, 小便熱赤, 肢體煩疼, 綾, 苔黃膩或垢黑, 脈洪數或弦數",
    "冷瘴證": "脈弦, 或但寒不熱, 或嘔吐腹瀉, 苔膩, 苔白, 寒甚熱微, 甚則神昏不語, 嗜睡昏蒙",
    "勞瘧證": "寒熱時作, 短氣懶言, 面黃, 遇勞則發, 瘧疾遷延日久, 倦怠乏力, 脈細無力, 納少自汗, 形體消瘦, 舌質淡",
    "風水相搏證": "兼惡寒, 眼瞼浮腫, 繼則四肢及全身皆腫, 可兼惡寒, 咳喘, 偏於風寒者, 脈浮滑或浮緊, 脈浮滑數, 偏於風熱者, 發熱, 肢節酸楚,舌苔薄白, 來勢迅速, 伴隨咽喉紅腫疼痛, 小便不利等症",
    "濕毒浸淫證": "甚則潰爛, 皮膚光亮, 脈浮數或滑數, 惡風發熱, 身發瘡痍, 眼瞼浮腫, 延及全身, 尿少色赤, 苔薄黃",
    "水濕浸漬證": "脈沉, 發病緩慢, 小便短少, 病程較長, 全身水腫, 身體困重, 左胸前區憋悶, 苔白膩, 下肢明顯, 胸悶, 按之沒指, 泛惡, 胸悶重, 納呆",
    "濕熱壅盛證": "苔黃, 小便短赤, 舌紅, 脈沉數或濡數, 大便乾結, 苔膩, 遍體浮腫, 胸脘痞悶, 煩熱口渴, 皮膚繃急光亮",
    "脾陽虛衰證": "疲倦, 小便短少, 四肢倦怠, 苔白膩或白滑, 脈沉緩或沉弱, 面色不華, 腰以下為甚, 納減緩便溏, 神疲, 脘腹脹悶, 舌質淡, 身腫日久, 按之凹陷不易恢復",
    "腎陽衰微證": "水腫反覆消長不已, 按之凹陷不起, 面色蒼白, 腰以下甚, 舌質淡胖, 腰酸冷痛, 脈沉細或沉遲無力, 四肢厥冷, 喘促難臥, 腹大脹滿, 怯寒神疲, 心悸胸悶, 苔白, 尿量減少或反多, 面浮身腫",
    "瘀水互結證": "水腫延久不退, 或有皮膚瘀斑, 以下肢為主, 腰部刺痛, 苔白, 四肢或全身浮腫, 腫勢輕重不一, 脈沉細澀, 或伴血尿, 舌紫暗",
    "熱淋證": "苔黃, 便秘, 少腹拘急脹痛, 寒熱起伏, 灼熱刺痛, 小便頻數短澀, 苔膩, 口苦, 溺色黃赤, 脈滑數, 嘔惡, 腰痛拒按",
    "石淋證": "脈弦或帶數, 甚則牽及外陰, 排尿澀痛, 或排尿時突然中斷, 舌紅, 尿中帶血, 少腹拘急, 一側腰腹絞痛難忍, 尿中夾砂石,尿道窘迫疼痛, 常突發, 苔薄黃",
    "血淋證": "苔黃, 尿色深紅, 或夾有血塊, 脈滑數, 舌尖紅, 小便熱澀刺痛, 疼痛滿急加劇, 心煩",
    "氣淋證": "脈弦, 淋瀝不已, 苔薄白, 小便澀滯, 少腹脹滿疼痛, 鬱怒之後",
    "膏淋證": "苔黃, 上有浮油, 口乾, 口燥, 脈濡數, 尿道熱澀疼痛, 置之沉澱, 苔膩, 小便渾濁, 口乾咽燥, 尿時阻塞不暢, 乳白或如米泔水,或伴有絮狀凝塊物",
    "勞淋證": "小便赤澀, 但淋瀝不已, 小腹墜脹, 脈細弱, 膝軟, 乏力, 少氣懶言, 腰膝酸軟, 面黃, 裡急後重或大便時小便點滴而出, 溺痛不甚, 腰酸, 病程纏綿, 神疲, 五心煩熱, 遇勞即發, 舌質淡, 時作時止, 腎陽虛見畏寒肢冷, 腎陰虛見面色潮紅",
    "濕熱下注證": "苔黃, 腓腸肌壓痛, 皮膚緊繃, 乏力, 脈濡數或滑數, 熱澀不暢, 小溲黃赤, 體溫升高, 遺精頻作, 苔膩, 皮溫升高, 體倦, 口苦而黏, 神疲",
    "脾氣陷證": "小腹墜脹, 舌淡苔白, 狀如白漿, 神倦無力, 面色無華, 尿濁反覆發作, 日久不癒, 脈虛軟, 勞累後發作或加重",
    "腎虛不固證": "舌質淡紅, 形寒肢冷, 膝軟, 口乾, 腎陰虧虛者兼見煩熱, 脈細數, 口燥, 消瘦無力, 腰膝酸軟, 頭暈耳鳴, 脈細, 脈沉, 尿濁日久不癒, 腰酸, 口乾嚥燥, 腎陽虧虛者兼臉色白, 小便乳白如脂膏, 精神萎靡",
    "膀胱濕熱證": "苔黃, 或口渴不欲飲, 小腹脹滿, 小便點滴不通, 口苦口黏, 或大便不暢, 苔膩, 或量極少而短赤灼熱, 脈數或濡數",
    "肺熱壅盛證": "呼吸急促, 小便不暢, 舌紅, 煩渴欲飲, 脈數, 甚或點滴不通, 或有咳嗽, 咽乾, 苔薄黃",
    "濁瘀阻塞證": "脈澀, 小腹脹滿疼痛, 或尿如細線, 或有瘀點、瘀斑, 時有排尿中斷, 甚則阻塞不通, 小便點滴而下, 舌紫暗",
    "脾氣不升證": "苔薄, 脈細弱, 氣短而語聲低微, 乏力, 舌淡, 伴小腹墜脹, 神疲, 時欲小便而不得出, 或量少而不暢, 食慾不振",
    "腎陽衰症證": "排尿無力, 畏寒肢冷, 腰膝冷而酸軟無力, 舌淡胖, 脈沉細或弱, 神氣怯弱, 苔薄白, 小便不通或點滴不爽, 面白神萎",
    "脾腎陽虛, 濕濁內蘊證": "形寒肢冷, 色清, 乏力, 泛惡嘔吐, 小便短少, 邊有齒印, 苔白膩, 大便溏薄, 脈細, 面色晦滯, 脈沉, 納差, 浮腫腰以下為主, 甚則尿閉, 腹脹, 神疲, 舌淡體胖",
    "肝腎陰虛, 虛風內動證": "苔黃, 膝軟, 臉部烘熱, 舌紅, 小便短少, 腰膝酸軟, 脈細, 頭暈頭痛, 脈弦, 手足抽搐, 苔膩, 腰酸, 嘔惡頻作",
    "腎衰微, 邪陷心包證": "苔白膩或灰黑, 無尿或少尿, 四肢厥冷, 全身浮腫, 循衣摸床, 面白唇暗, 神識昏蒙, 脈沉細欲絕, 淡胖, 口中尿臭, 舌卷縮",
    "肝氣鬱結證": "舌質淡紅, 善太息, 胸部滿悶, 女子月事不行, 脘悶噯氣, 苔薄膩, 大便不調, 脈弦, 痛無定處, 納差, 精神抑鬱, 情緒不寧, 胸脅疼痛",
    "命門火衰證": "或舉而不堅, 神疲倦怠, 膝軟, 畏寒肢冷, 面色白, 腰膝酸軟, 頭暈耳鳴, 性慾減退, 精薄清冷, 陰器冷縮, 夜尿清長, 舌淡胖, 陽痿不舉, 苔薄白, 腰酸, 脈沉遲或細, 五更洩瀉",
    "心脾虧虛證": "顏面黃, 舌淡邊有齒痕, 脈細弱, 食少納呆, 乏力, 陽痿不舉, 苔薄白, 神疲, 心悸, 失眠多夢, 遇勞加重, 腹脹便溏",
    "驚恐傷腎證": "兼見膽怯多疑, 脈弦, 夜寐多夢, 苔白, 臨房不舉, 時有自舉, 舌質淡, 脈細, 言遲聲低, 心悸驚",
    "君相火旺證": "腰酸耳鳴, 易舉易洩, 性慾亢進, 舌紅, 脈細數, 潮熱顴紅, 溲黃便結, 心煩寐差, 遺精夢洩, 口乾多飲, 苔少或薄黃",
    "勞傷心脾證": "顏面黃, 脈細弱, 納少腹脹, 勞則加重, 遺精, 失眠健忘, 舌質淡胖邊有齒印, 舌苔薄白, 四肢倦怠, 伴心悸氣短, 大便溏薄",
    "腎氣不固證": "腰脊酸痛, 脈沉弱, 血色淡紅, 久病尿血, 舌質淡, 精神困則, 伴頭暈耳鳴",
    "肝經濕熱證": "苔黃, 小便黃濁, 陰囊濕癢, 舌紅, 早洩, 苔膩, 伴口苦咽乾, 陰莖易舉, 胸悶脅痛, 脈弦滑而數",
    "相火妄動證": "膝軟, 潮熱, 早洩, 脈細數, 腰酸, 陽事易舉, 腰膝酸軟, 五心煩熱, 舌紅少苔",
    "氣鬱化火證": "苔黃, 急躁易怒, 便秘, 脈弦數, 口乾, 或嘈雜吞酸, 口苦, 或頭痛、目赤、耳鳴, 胸悶脅迫",
    "心神失養證": "或手舞足蹈, 喜怒無常, 脈弦, 精神恍惚, 心神不寧, 喊叫罵詈, 多疑易驚, 悲憂善哭, 舌質淡, 時時欠伸",
    "熱邪犯肺證": "咳嗽, 苔薄, 或兼有身熱, 惡風, 脈數, 鼻燥衄血, 口乾咽燥, 頭痛, 痰少",
    "胃熱熾熱證": "尿多, 苔黃, 脈滑實有力, 大便乾燥, 口渴, 多食易飢, 形體消瘦",
    "肝火上炎證": "苔黃, 脈弦數, 舌紅, 口苦, 鼻衄, 耳鳴目眩, 煩躁易怒, 兩目紅赤",
    "胃火熾盛證": "苔黃, 口渴口臭, 血色鮮紅, 舌紅, 齒齦出血, 脈洪數, 伴隨齒齦紅腫疼痛",
    "燥熱傷肺證": "口乾鼻燥, 苔薄黃少津, 喉癢咳嗽, 脈數, 痰中帶血, 或有身熱",
    "陰虛肺熱證": "潮熱, 血色鮮紅, 或反覆咳血, 舌紅, 伴口乾咽燥, 脈細數, 顴紅, 咳痰少, 痰中帶血, 苔少",
    "胃熱壅盛證": "口臭便秘, 苔黃, 常夾有食物殘渣, 大便色黑, 吵雜不適, 吐血色紅或紫暗, 甚則作痛, 苔膩, 脈滑數, 伴脘腹脹悶",
    "肝火犯胃證": "脈弦數, 煩躁, 煩躁不安, 吐血色紅或紫暗, 寐少夢多, 伴口苦脅痛, 煩躁不寧, 心煩",
    "氣虛血溢證": "脈細弱, 伴神疲乏力, 血色暗淡, 面色蒼白, 時輕時重, 舌質淡, 吐血纏綿不止, 心悸氣短",
    "腸道濕熱證": "苔黃, 肛門升高, 口苦, 脈濡數, 大便性狀異常, 伴大便不暢或稀溏, 苔膩, 黃褐色稀便, 懶動, 血色紅粘稠, 或有腹痛, 大便頻率異常,肛門污穢",
    "熱灼胃絡證": "伴隨胃脘疼痛, 常有飲食傷胃史, 脈弦, 便色如柏油, 口乾, 或稀或稠, 口燥, 口乾咽燥, 舌淡紅, 脈細, 苔薄黃",
    "氣虛不攝證": "顏黃, 舌淡, 伴隨倦怠食少, 心悸少寐, 脈細, 便血淡紅或紫暗不稠",
    "下焦濕熱證": "面赤口瘡, 小便黃赤灼熱, 夜寐不安, 尿血鮮紅, 脈數, 伴心煩口渴",
    "腎虛火旺證": "膝軟, 舌紅, 顴紅潮熱, 脈細數, 腰酸, 小便短赤帶血, 腰膝酸軟, 苔少, 伴頭暈耳鳴",
    "脾不統血證": "脈細弱, 面色不華, 甚或兼見齒衄、肌衄, 伴食少便溏, 氣短聲低, 體倦乏力, 久病尿血, 量多色淡, 舌質淡",
    "血熱妄行證": "苔黃, 甚則鼻衄、齒衄、便血、尿血, 大便秘結, 便秘, 脈弦數, 大便秘結不通, 口渴, 皮膚出現青紫斑點或斑塊, 伴有發熱",
    "氣不攝血證": "脈細弱, 久病不癒, 頭暈目眩, 伴神疲乏力, 面色蒼白或萎黃, 舌質淡, 皮膚青紫斑點或斑塊反覆發生, 食慾不振",
    "脾陽虛弱證": "食少, 頭暈目眩, 飲入易吐, 胸脅支滿, 伴脘腹喜溫畏冷, 舌苔白滑, 胃中有水聲, 脈弦細而滑, 心悸氣短, 大便或溏, 口渴不欲飲水, 形體逐漸消瘦, 心下痞悶, 泛吐清水痰涎",
    "飲留胃腸證": "瀝瀝有聲, 脈沉弦或伏, 或雖利, 但心下續堅滿, 腹滿, 舌苔膩, 利後反快, 色白或黃, 排便不暢, 心下堅滿或痛, 或水走腸間, 自利",
    "邪犯胸肺證": "咳嗽, 脈弦數, 汗少, 身熱起伏, 伴寒熱往來, 或發熱不惡寒, 有汗而熱不解, 呼吸、轉側則疼痛加重, 胸痛氣急, 心下痞硬, 痰少, 舌苔薄白或黃",
    "飲停胸脅證": "伴欬逆氣喘, 病側肋間脹滿, 息促不能平臥, 痛勢較前減輕, 甚則可見偏側胸廓隆起, 胸脅疼痛, 而呼吸困難加重, 或僅能偏臥於停飲一側, 咳唾引痛, 舌苔白, 脈沉弦或弦滑",
    "絡氣不合證": "可見病側胸廓變形, 脈弦, 如灼如刺, 或有悶咳, 甚則遷延, 舌苔暗, 胸悶不舒, 呼吸不暢, 胸脅疼痛, 陰雨天更甚, 質暗, 經久不已",
    "陰虛內熱證": "或伴胸脅悶痛, 或午後潮熱, 脈小數, 咳嗆時作, 伴口乾咽燥, 顴紅, 盜汗, 心煩, 少苔或無苔, 舌質偏紅, 病久不復, 無苔, 胸脅悶痛, 咯吐少量黏痰, 手足心熱, 形體消瘦",
    "表寒裡飲證": "身體沉重而疼痛, 痰多白沫, 甚則肢體浮腫, 胸悶重, 乾嘔, 苔白, 左胸前區憋悶, 脈弦緊, 伴惡寒無汗, 或有喘咳, 口不渴, 胸悶",
    "寒飲伏肺證": "身體振振動, 舌苔白滑或白膩, 經久不癒, 欬逆喘滿不得臥, 遇寒即發, 痰吐白沫量多, 甚至引起面浮跗腫, 或平素伏而不作, 發則寒熱, 脈弦緊, 腰痛, 目泣自出, 天冷受寒加重, 背痛",
    "肺熱津傷證": "咽乾不利, 苔黃, 可較快發生肌肉瘦削, 大便乾燥, 搔癢, 脈細數, 發病急, 病起發熱, 或熱後突然出現肢體軟弱無力, 小便黃赤或熱痛, 心煩口渴,咳嗆少痰",
    "氣陰虧虛證": "舌質淡紅, 口渴引飲, 或飲食減少, 精神不振, 體瘦, 苔白而乾, 四肢乏力, 脈細, 能食與便溏並見",
    "腎陰虧虛證": "尿頻量多, 膝軟, 口乾唇燥, 乏力, 舌紅, 脈細數, 或尿甜, 腰膝酸軟, 頭暈耳鳴, 苔少, 混濁如脂膏, 癢, 腰酸, 體倦, 神疲",
    "陰陽兩虛證": "食少, 急躁易怒, 面紅, 夜尿頻, 小便頻數, 腰酸, 舌淡紅, 健忘, 四肢欠溫, 五心煩熱, 苔薄, 紅, 頭暈, 左胸前區憋悶, 腰膝酸軟, 陽痿或月經不順, 頭痛, 汗多, 頭如裹, 脈弦, 耳輪乾枯, 苔薄白, 目赤, 舌苔淡白而乾, 眠差, 耳鳴, 肢體活動不利, 面容憔悴, 小便不利, 畏寒肢冷, 舌淡, 肢體麻木, 脈細, 滑, 氣短, 胸悶重, 抑鬱, 心悸, 耳鳴如潮, 肢體疼痛, 混濁如膏, 膝軟, 口乾, 焦慮, 口燥, 口苦, 胸悶, 甚至飲一溲一, 肢體浮腫, 脈沉細無力, 高血壓, 口乾咽燥, 膩, 溲赤",
    "肺衛不固證": "脈細弱, 稍勞尤甚, 汗出惡風, 苔薄白, 易於感冒, 面色少華, 體倦乏力",
    "邪熱鬱蒸證": "脈象弦數, 舌苔薄黃, 煩躁不靜, 汗黏, 面赤烘熱, 小便色黃, 蒸蒸汗出, 口苦, 易使衣服黃染, 夜躁",
    "陰虛發熱證": "或有裂痕, 午後潮熱, 煩躁不靜, 少寐多夢, 脈細數, 不欲近衣, 口乾咽燥, 手足心熱, 或夜間發熱, 夜躁, 盜汗, 苔少甚至無苔",
    "血虛發熱證": "面白少華, 脈細弱, 唇甲色淡, 心悸不寧, 發熱, 身倦乏力, 熱勢多為低熱, 舌質淡, 頭暈眼花",
    "氣虛發熱證": "脈細弱, 食少便溏, 熱勢或低或高, 發熱, 苔薄白, 倦怠乏力, 易於感冒, 氣短懶言, 舌質淡, 汗多, 常在勞累後發作或加劇",
    "陽虛發熱證": "膝軟, 苔白潤, 臉色白, 或有齒痕, 納差便溏, 少氣懶言, 四肢不溫, 腰膝酸軟, 舌質淡胖, 脈沉細無力, 形寒怯冷, 腰酸, 發熱而欲近衣, 頭暈嗜臥",
    "氣鬱發熱證": "苔黃, 發熱多為低熱或潮熱, 熱勢常隨情緒波動而起伏, 脅肋脹滿, 脈弦數, 舌紅, 精神抑鬱, 口乾而苦, 納食減少, 煩躁易怒",
    "痰濕鬱熱證": "心內煩熱, 納差, 發熱, 午後熱甚, 胸悶脘痞, 脈濡數, 嘔惡, 舌苔白膩或黃膩, 大便稀薄或黏滯不爽, 渴不欲飲",
    "血瘀發熱證": "但不多飲, 肢體或軀幹有固定痛處或腫塊, 或自覺身體某些部位發熱, 舌質青紫或有瘀點、瘀斑, 脈弦或澀, 午後或夜晚發熱, 面色萎黃或晦暗, 口燥吞乾",
    "實證": "舌暗紅, 不省人事, 脈弦有力, 多因急躁惱怒而發, 面赤唇紫, 牙關緊閉, 突然昏倒",
    "虛證": "呼吸微弱, 四肢震顫, 焦慮, 自汗肢冷, 目陷口張, 常因失血過多, 面色蒼白, 舌質淡, 抑鬱, 突然昏厥, 脈芤或細數無力, 口唇無華",
    "痰厥證": "脈沉滑, 多濕多痰, 舌苔白膩, 喉有痰聲, 或嘔吐涎沫, 惱怒或劇烈咳嗽後突然昏厥, 素有咳喘宿痰, 呼吸氣粗",
    "肺氣虛證": "平素易感冒, 聲音低怯, 咳痰喘, 面白, 咳嗽無力, 痰液清稀, 舌質淡, 短氣自汗, 時寒時熱, 脈細",
    "心氣虛證": "氣短, 神疲體倦, 勞則尤甚, 舌質淡, 脈細, 心悸, 汗多",
    "脾氣虛證": "苔薄, 舌淡, 倦怠乏力, 血脂紊亂, 大便溏薄, 脈細, 食後胃脘不舒, 面黃, 倦怠, 納差, 飲食減少, 高血壓, 大便粘滯",
    "腎氣虛證": "便頻數, 膝軟, 乏力, 小便頻數而清, 腰酸, 小便清長, 神疲, 腰膝酸軟, 舌質淡, 脈細, 白帶清稀",
    "心血虛證": "睡眠不佳, 面色不華, 健忘, 心悸怔忡, 舌質淡, 脈細或結代",
    "肝血虛證": "脈弦細或細澀, 目眩, 面色不華, 筋脈拘急, 肢體麻木, 頭暈, 脅痛, 舌質淡, 或肌肉動, 婦女月經不規則甚則閉經",
    "肺陰虛證": "咽燥, 潮熱, 脈細數, 甚或失音, 乾咳, 咯血, 面色潮紅, 盜汗, 舌紅少津",
    "心陰虛證": "眠差, 或口舌生瘡, 潮熱, 煩躁不靜, 脈細數, 面色潮紅, 心悸, 夜躁, 盜汗, 舌紅少津",
    "肝陰虛證": "耳鳴, 急躁易怒, 筋斗肉, 舌乾紅, 疲倦易困, 頭暈, 頭痛, 煩躁易怒, 面潮紅, 脈弦細數, 視物不明, 毛髮無光澤, 耳鳴如潮, 目幹畏光, 或肢體麻木",
    "腎陰虛證": "纏綿不癒, 不孕, 腰部隱隱作痛, 臉色潮紅, 口燥咽乾, 潮熱, 酸軟無力, 經少閉經, 發炎, 心煩少寐, 脈弦細數, 五心煩熱, 手足心熱, 形體消瘦, 舌紅少苔",
    "心陽虛證": "神倦嗜臥, 形寒肢冷, 心胸憋悶疼痛, 舌淡或紫暗, 脈細弱或沉遲, 臉色蒼白, 心悸, 汗多",
    "脾陽虛證": "食少, 胃寒, 大便濕爛, 舌淡, 腸吸收功能減退, 少氣懶言, 大便溏薄, 脈細, 面黃, 神倦乏力, 毛髮稀少, 苔白, 形寒, 每因受寒或飲食不慎而加劇, 腸鳴腹痛",
    "腎陽虛證": "纏綿不癒, 腰部隱隱作痛, 肢冷畏寒, 常反覆發作, 面色白, 喜溫喜按, 遇勞更甚, 脈沉細無力, 酸軟無力, 臥則減輕, 苔薄白, 局部發涼,舌質淡",
    "胃熱火鬱證": "苔黃, 消谷善飢, 可有大便不爽, 喜飲水, 脈數, 甚或乾結, 尿黃, 肥胖多食, 或有口乾口苦",
    "痰濕內盛證": "舌質淡胖或大, 脘痞胸滿, 形體肥胖, 嗜食肥甘醇酒, 脈滑, 肢體困倦, 口乾而不欲飲, 大便黏滯不爽, 身體沉重, 可伴頭暈, 苔白膩或白滑, 喜臥懶動",
    "氣鬱血瘀證": "眠差, 可伴便幹, 舌苔薄, 舌質暗或有瘀斑瘀點, 男子性慾下降甚至陽痿, 脈弦或澀, 甚或青紫, 肢端色澤不鮮, 女性月經不調、量少甚或閉經, 肥胖懶動, 喜太息, 面晦唇暗, 經血色暗或有血塊, 胸悶脅滿",
    "脾虛不運證": "勞累後更為明顯, 小便不利, 肥胖臃腫, 大便溏或便秘, 乏力, 晨輕暮重, 身體困重, 既往多有暴飲暴食史, 邊有齒印, 舌質淡胖, 或有四肢輕度浮腫, 飲食如常或偏少, 脘腹痞悶, 神疲, 脈濡細, 苔薄白或白膩",
    "氣鬱痰瘀證": "或隱痛或刺痛, 納呆食少, 便溏或嘔血、黑便, 善太息, 乏力, 或脹痛不適, 舌苔薄膩, 脈弦或細澀, 質暗隱紫, 腹脹, 痰白或黃白相兼, 痰質稠黏, 神疲, 胸膈痞悶, 或咳嗽咳痰",
    "熱毒熾盛證": "脈細數或弦細數, 久稽不退, 口咽乾燥, 舌苔黃膩或薄黃少津, 或痰中帶血, 甚則咳血不止, 局部腫塊灼熱疼痛, 胸痛或腰酸背痛, 小便短赤, 發燒, 或熱勢壯盛, 心煩寐差, 大便秘結或便溏洩瀉, 咳嗽無痰或少痰",
    "濕熱鬱毒證": "苔黃, 噁心, 裡急後重, 口乾, 煩躁不安, 身黃, 肛門灼熱, 時有發熱, 口苦, 或大便乾稀不調, 左胸前區憋悶, 尿黃, 胸悶, 心煩, 便中帶血或黏液膿血便, 脈弦滑或滑數, 煩躁, 苔膩, 胸悶重, 目黃, 煩躁不寧, 脅痛或腹部陣痛, 心煩易怒",
    "瘀毒內阻證": "如錐如刺, 口唇紫暗, 舌質暗或有瘀點、瘀斑, 苔薄或薄白, 或肌膚甲錯, 面色晦暗, 痛有定處, 胸痛或腰腹疼痛, 痰中帶血或尿血, 血色暗紅, 脈澀或細弦或細澀",
    "氣血雙虧證": "伴隨頭昏心悸, 納呆食少, 脈細或細弱, 唇甲色淡, 或淡, 面色無華, 氣短乏力, 動輒尤甚, 形體消瘦, 動則多汗, 口乾舌燥, 眼花",
    "行麻痺證": "脈浮或浮緩, 可涉及多個關節, 初起可見惡風、發熱等表證, 苔薄白或薄膩, 疼痛呈遊走性, 舌質淡, 活動不利, 肢體關節、肌肉疼痛",
    "痛麻痺證": "得熱痛減, 惡風寒, 苔薄白, 遇寒痛甚, 痛有定處, 疼勢較劇, 局部皮膚或有寒冷感, 脈弦緊, 舌質淡, 口淡不渴, 肢體關節疼痛, 關節活動不利",
    "著麻痺證": "手足困重, 脈濡緩, 肌膚麻木不仁, 苔白膩, 肢體關節、肌肉酸楚、重著、疼痛, 舌質淡, 或有腫脹, 關節活動不利",
    "風濕熱麻痺證": "煩悶不安, 苔黃膩或黃燥, 得冷則舒, 脈滑數或浮數, 肢體關節疼痛, 活動不利, 汗多, 尿黃, 局部灼熱紅腫, 多兼有發熱, 可有皮下結節或紅斑, 大便秘結, 惡風, 便乾, 口渴",
    "痰瘀麻痺阻證": "有硬結, 舌質暗紫或有瘀點瘀斑, 面色暗黧, 眼瞼浮腫, 麻痺證日久不癒, 苔白膩, 肢體關節腫脹刺痛, 活動不利, 或痰多胸悶, 夜間痛甚,或關節僵硬變形, 或關節肌膚紫暗、腫脹, 按之較硬, 肢體頑麻或重著, 痛有定處, 脈弦澀, 甚則肌肉萎縮, 瘀斑, 肌膚甲錯",
    "肝腎兩虛證": "陽痿遺精, 睡眠差, 肌肉瘦削, 膝軟, 骨蒸潮熱, 或頭暈目眩, 脈細數, 心煩口乾, 腰膝酸軟, 面色潮紅, 活動不利, 少苔或無苔, 關節腫大, 腰酸, 無苔, 僵硬變形, 或畏寒肢冷",
    "邪壅經絡證": "四肢抽搐, 脈浮緊, 項背強直, 肢體酸重, 甚至口噤不能語, 惡寒發熱, 無汗或汗出, 舌苔薄白或白膩, 頭痛",
    "肝經熱盛證": "四肢抽搐, 角弓反張, 舌苔薄黃或少苔, 甚則項背強急, 高熱頭痛, 口噤齒, 綿, 手足躁動, 脈弦細而數",
    "陽明熱盛證": "壯熱汗出, 項背強急, 口渴喜冷飲, 脈弦數, 腹滿便結, 苔黃燥, 手足攣急, 甚則角弓反張",
    "心營熱盛證": "項背強急, 四肢抽搐, 神昏譫語, 脈細數, 高熱煩躁, 綾, 苔黃少津, 甚則角弓反張",
    "瘀血內阻證": "項背強直, 舌質紫暗, 邊有瘀斑、瘀點, 痛有定處, 形體消瘦, 頭痛如刺, 脈象細澀, 四肢抽痛",
    "痰濁阻滯證": "項背強急, 四肢抽搐, 舌苔白膩, 頭痛昏蒙, 神識呆滯, 胸脘滿悶, 嘔吐痰涎, 脈滑或弦滑",
    "陰血虧虛證": "項背強急, 頭目昏眩, 四肢麻木, 舌質淡或舌紅無苔, 脈細數, 抽搦或筋疲力盡, 汗多, 神疲氣短, 或低熱",
    "濕熱浸淫證": "痿軟無力, 手足麻木, 舌苔黃膩, 起病較緩, 小便赤澀熱痛, 胸脘痞悶, 或有發熱, 脈濡數或滑數, 兼見微腫, 喜涼惡熱, 逐漸出現肢體困重, 尤以下肢或兩足痿弱為甚, 捫及微熱",
    "肝腎虧損證": "膝軟, 舌咽乾燥, 發病緩慢, 脈細數, 腿脛大肉漸脫, 腰膝酸軟, 漸見肢體痿軟無力, 遺精或遺尿, 腰酸, 或伴有眩暈耳鳴, 尤以下肢明顯, 甚至步履全廢, 舌紅少苔, 或婦女月經不調, 不能久立",
    "脈絡瘀阻證": "手足麻木不仁, 舌質暗淡或有瘀點瘀斑, 肌肉瘦削, 四肢痿弱, 可伴有肌肉活動時隱痛不適, 脈細澀, 久病體虛, 四肢青筋顯露, 舌痿不能伸縮",
    "風陽內動證": "流涎, 苔黃, 脈弦滑數, 程度較重, 面赤煩躁, 伴有肢體麻木, 頭暈耳鳴, 心情緊張時顫動加重, 尿赤, 不能自製, 口苦而乾, 易激動, 便乾, 語言遲緩不清, 肢體顫動粗大, 便結",
    "痰熱風動證": "重則手不能持物, 舌苔黃膩, 頭搖不止, 脈弦滑數, 頭暈目眩, 口苦口黏, 甚則口吐痰涎, 肢麻震顫, 有齒痕, 胸脘痞悶, 舌體胖大悶, 舌體胖大",
    "寒濕腰痛證": "轉側不利, 腰部冷痛重著, 靜臥病痛不減, 寒冷或陰雨天加重, 苔白膩, 舌質淡, 脈沉而遲緩",
    "濕熱腰痛證": "苔黃, 腰部疼痛, 重著而熱, 活動後或可減輕, 小便短赤, 苔膩, 脈濡數或弦數, 身體困重, 暑濕陰雨天氣加重",
    "瘀血腰痛證": "日輕夜重, 脈澀, 或有瘀斑, 重者不能轉側, 痛有定處, 舌質暗紫, 痛處拒按, 輕者俯仰不便, 部分患者有跌僕閃挫病史, 腰痛如刺"
}